[NoCoverage] Statement mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/GetClub.cs:14:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("subscriptions/{subscriptionId:guid}/clubs/{clubId:guid}",
-			async (Guid subscriptionId,
-				   Guid clubId,
-				   ISender sender,
-				   CancellationToken cancellationToken) =>
-				   {
-						GetClubQuery query = new(subscriptionId, clubId);
-
-						Result<Club> getClubResult = await sender.Send(query, cancellationToken);
-
-						IResult result = getClubResult.Match(
-							onSuccess: club => Results.Ok(new ClubResponse(club.Id, club.Name)),
-							onFailure: errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-						return result;
-					})
-			.WithTags(Tags.Clubs)
-			.WithName("GetClub")
-			.WithSummary("Get club")
-			.WithDescription("Get club for specific clubId and subscriptionId")
-			.Produces<ClubResponse>()
-			.ProducesProblem(StatusCodes.Status404NotFound);
+		;
 	}
 }

[NoCoverage] Block removal mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/GetClub.cs:19:8
 				   Guid clubId,
 				   ISender sender,
 				   CancellationToken cancellationToken) =>
-				   {
-						GetClubQuery query = new(subscriptionId, clubId);
-
-						Result<Club> getClubResult = await sender.Send(query, cancellationToken);
-
-						IResult result = getClubResult.Match(
-							onSuccess: club => Results.Ok(new ClubResponse(club.Id, club.Name)),
-							onFailure: errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-						return result;
-					})
+				   {})
 			.WithTags(Tags.Clubs)
 			.WithName("GetClub")
