[NoCoverage] Statement mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/AddInstructor.cs:13:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("subscriptions/{subscriptionId:guid}/clubs/{clubId:guid}/instructors",
-					async (AddInstructorRequest request,
-							Guid subscriptionId,
-							Guid clubId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						AddInstructorCommand command = new(subscriptionId, clubId, request.InstructorId);
-
-						Result addTrainerResult = await sender.Send(command, cancellationToken);
-
-						IResult result = addTrainerResult.Match(() => Results.Ok(clubId),
-																err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return result;
-					})
-			.WithTags(Tags.Clubs)
-			.WithSummary("Add instructor")
-			.WithDescription("Add instructor for a subscription (and a club)");
+		;
 		//.RequireAuthorization();
 	}

[NoCoverage] String mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/AddInstructor.cs:13:15
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("subscriptions/{subscriptionId:guid}/clubs/{clubId:guid}/instructors",
+		app.MapPost("",
 					async (AddInstructorRequest request,
 							Guid subscriptionId,

[NoCoverage] Block removal mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/AddInstructor.cs:19:6
 							Guid clubId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						AddInstructorCommand command = new(subscriptionId, clubId, request.InstructorId);
-
-						Result addTrainerResult = await sender.Send(command, cancellationToken);
-
-						IResult result = addTrainerResult.Match(() => Results.Ok(clubId),
-																err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return result;
-					})
+					{})
 			.WithTags(Tags.Clubs)
 			.WithSummary("Add instructor")

[NoCoverage] String mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/AddInstructor.cs:31:21
 					})
 			.WithTags(Tags.Clubs)
 			.WithSummary("Add instructor")
-			.WithDescription("Add instructor for a subscription (and a club)");
+			.WithDescription("");
 		//.RequireAuthorization();
 	}
