[NoCoverage] Statement mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/ListClubs.cs:14:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("subscriptions/{subscriptionId:guid}/clubs",
-			async (
-				Guid subscriptionId,
-				ISender sender,
-				CancellationToken cancellationToken) =>
-			{
-				ListClubsQuery query = new(subscriptionId);
-
-				Result<List<Club>> listClubsResult = await sender.Send(query, cancellationToken);
-
-				IResult response = listClubsResult.Match(
-					onSuccess: clubs => Results.Ok(clubs.ConvertAll(c => new ClubResponse(c.Id, c.Name))),
-					onFailure: errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-				return response;
-			})
-			.WithTags(Tags.Clubs)
-			.WithSummary("List clubs")
-			.WithDescription("List clubs for a subscription")
-			.Produces<List<ClubResponse>>()
-			.ProducesProblem(StatusCodes.Status404NotFound);
+		;
 	}
 }

[NoCoverage] Block removal mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/ListClubs.cs:19:4
 				Guid subscriptionId,
 				ISender sender,
 				CancellationToken cancellationToken) =>
-			{
-				ListClubsQuery query = new(subscriptionId);
-
-				Result<List<Club>> listClubsResult = await sender.Send(query, cancellationToken);
-
-				IResult response = listClubsResult.Match(
-					onSuccess: clubs => Results.Ok(clubs.ConvertAll(c => new ClubResponse(c.Id, c.Name))),
-					onFailure: errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-				return response;
-			})
+			{})
 			.WithTags(Tags.Clubs)
 			.WithSummary("List clubs")

[NoCoverage] String mutation
ClubAdministrationService.WebApi/Endpoints/Clubs/ListClubs.cs:31:17
 				return response;
 			})
 			.WithTags(Tags.Clubs)
-			.WithSummary("List clubs")
+			.WithSummary("")
 			.WithDescription("List clubs for a subscription")
 			.Produces<List<ClubResponse>>()
