[NoCoverage] String mutation
ClubAdministrationService.WebApi/Endpoints/Courts/CreateCourt.cs:14:15
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("clubs/{clubId:guid}/courts",
+		app.MapPost("",
 					async (CreateCourtRequest request,
 							Guid clubId,
