[NoCoverage] Statement mutation
ClubAdministrationService.WebApi/Endpoints/Courts/DeleteCourt.cs:12:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapDelete("clubs/{clubId:guid}courts/{courtId:guid}",
-					async (Guid clubId,
-							Guid courtId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						DeleteCourtCommand command = new(clubId, courtId);
-
-						Result deleteCourtResult = await sender.Send(command, cancellationToken);
-
-						IResult result = deleteCourtResult.Match(Results.NoContent,
-																err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return result;
-					})
-			.WithTags(Tags.Courts)
-			.WithSummary("Delete court")
-			.WithDescription("Delete court for a club");
+		;
 		//.RequireAuthorization();
 	}

[NoCoverage] Block removal mutation
ClubAdministrationService.WebApi/Endpoints/Courts/DeleteCourt.cs:17:6
 							Guid courtId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						DeleteCourtCommand command = new(clubId, courtId);
-
-						Result deleteCourtResult = await sender.Send(command, cancellationToken);
-
-						IResult result = deleteCourtResult.Match(Results.NoContent,
-																err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return result;
-					})
+					{})
 			.WithTags(Tags.Courts)
 			.WithSummary("Delete court")
