[Killed] Statement mutation
src/ClubAdministrationService.WebApi/Extensions/MediatorExtensions.cs:13:3
 {
 	internal static IServiceCollection AddMediatorServices(this IServiceCollection services)
 	{
-		services.AddMediator(options =>
-		{
-			options.ServiceLifetime = ServiceLifetime.Scoped;
-			options.GenerateTypesAsInternal = true;
-			options.NotificationPublisherType = typeof(ForeachAwaitPublisher);
-			options.CachingMode = CachingMode.Eager;
-			options.Assemblies =
-			[
-				typeof(AdminProfileCreatedEventHandler).Assembly
-			];
-		});
+		;
 
 		return services;
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[NoCoverage] Boolean mutation
src/ClubAdministrationService.WebApi/Extensions/MediatorExtensions.cs:16:38
 		services.AddMediator(options =>
 		{
 			options.ServiceLifetime = ServiceLifetime.Scoped;
-			options.GenerateTypesAsInternal = true;
+			options.GenerateTypesAsInternal = false;
 			options.NotificationPublisherType = typeof(ForeachAwaitPublisher);
 			options.CachingMode = CachingMode.Eager;
