[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
ClubAdministrationService.WebApi/Endpoints/Subscription/CreateCourt.cs:19:11
 						ISender sender,
 						CancellationToken cancellationToken) =>
 					{
-						if (!Domain.SubscriptionAggregate.SubscriptionType
-									.TryFromName(request.SubscriptionType.ToString(),
-												out Domain.SubscriptionAggregate.SubscriptionType? subscriptionType))
+						if (Domain.SubscriptionAggregate.SubscriptionType
+									.TryFromName(request.SubscriptionType.ToString(),
+												out Domain.SubscriptionAggregate.SubscriptionType? subscriptionType))
 						{
 							return Results.Problem("Invalid subscription type",

[NoCoverage] String mutation
ClubAdministrationService.WebApi/Endpoints/Subscription/CreateCourt.cs:42:21
 					})
 			.WithTags(Tags.Subscription)
 			.WithSummary("Create subscription")
-			.WithDescription("Create subscription");
+			.WithDescription("");
 		//.RequireAuthorization();
 	}
