[NoCoverage] String mutation
src/ClubAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:58:28
 	{
 		return error.Type switch
 		{
-			ErrorType.Validation => "Validation error",
+			ErrorType.Validation => "",
 			ErrorType.Problem => error.Code,
 			ErrorType.NotFound => error.Code,

[NoCoverage] String mutation
src/ClubAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:83:25
 		return errorType switch
 		{
 			ErrorType.Validation => "https://tools.ietf.org/html/rfc7231#section-6.5.1",
-			ErrorType.Problem => "https://tools.ietf.org/html/rfc7231#section-6.5.1",
+			ErrorType.Problem => "",
 			ErrorType.NotFound => "https://tools.ietf.org/html/rfc7231#section-6.5.4",
 			ErrorType.Conflict => "https://tools.ietf.org/html/rfc7231#section-6.5.8",
