[Killed] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:26:1
 builder.Services.AddProblemDetails();
 builder.Services.AddHttpContextAccessor();
 
-builder.Services
-		.AddMediatorServices()
-		.AddServices()
-		.AddPersistence(builder.Configuration);
+;
 //.AddInfrastructure(builder.Configuration);
 
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[NoCoverage] Negate expression
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:65:5
 // app.UseMiddleware<EventualConsistencyMiddleware>(); I'll need this back at some point.
 
 // Configure the HTTP request pipeline for DEVELOPMENT only
-if (app.Environment.IsDevelopment())
+if (!(app.Environment.IsDevelopment()))
 {
 	app.MapOpenApi();

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:67:2
 // Configure the HTTP request pipeline for DEVELOPMENT only
 if (app.Environment.IsDevelopment())
 {
-	app.MapOpenApi();
+	;
 	app.MapScalarApiReference(opts =>
 	{

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:68:2
 if (app.Environment.IsDevelopment())
 {
 	app.MapOpenApi();
-	app.MapScalarApiReference(opts =>
-	{
-		opts.Title = Assembly.GetExecutingAssembly().GetName().Name!;
-		opts.Theme = ScalarTheme.DeepSpace;
-	});
+	;
 }
 

[NoCoverage] Block removal mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:69:2
 {
 	app.MapOpenApi();
 	app.MapScalarApiReference(opts =>
-	{
-		opts.Title = Assembly.GetExecutingAssembly().GetName().Name!;
-		opts.Theme = ScalarTheme.DeepSpace;
-	});
+	{});
 }
 

[NoCoverage] String mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:75:36
 	});
 }
 
-if (!app.Environment.IsEnvironment("Testing"))
+if (!app.Environment.IsEnvironment(""))
 {
 	using IServiceScope scope = app.Services.CreateScope();

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.WebApi/Program.cs:79:2
 {
 	using IServiceScope scope = app.Services.CreateScope();
 	ClubDbContext dbContext = scope.ServiceProvider.GetRequiredService<ClubDbContext>();
-	await dbContext.Database.MigrateAsync();
+	;
 }
 
