[Killed] Equality mutation
src/ClubAdministrationService.WebApi/Extensions/EndpointExtensions.cs:13:18
 	{
 		ServiceDescriptor[] serviceDescriptors = assembly.DefinedTypes
 														.Where(type =>
-																	type is { IsAbstract: false, IsInterface: false } &&
+																	type is not { IsAbstract: false, IsInterface: false } &&
 																	type.IsAssignableTo(typeof(IEndpoint)))
 														.Select(type => ServiceDescriptor.Transient(
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[Killed] Boolean mutation
src/ClubAdministrationService.WebApi/Extensions/EndpointExtensions.cs:13:40
 	{
 		ServiceDescriptor[] serviceDescriptors = assembly.DefinedTypes
 														.Where(type =>
-																	type is { IsAbstract: false, IsInterface: false } &&
+																	type is { IsAbstract: true, IsInterface: false } &&
 																	type.IsAssignableTo(typeof(IEndpoint)))
 														.Select(type => ServiceDescriptor.Transient(
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[NoCoverage] Conditional (true) mutation
src/ClubAdministrationService.WebApi/Extensions/EndpointExtensions.cs:31:35
 	{
 		IEnumerable<IEndpoint> endpoints = app.Services.GetRequiredService<IEnumerable<IEndpoint>>();
 
-		IEndpointRouteBuilder builder = routeGroupBuilder is null ? app : routeGroupBuilder;
+		IEndpointRouteBuilder builder = (true?app :routeGroupBuilder);
 
 		foreach (IEndpoint endpoint in endpoints)
