[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:26:3
 
 	protected override void OnModelCreating(ModelBuilder modelBuilder)
 	{
-		modelBuilder.ApplyConfigurationsFromAssembly(Assembly.GetExecutingAssembly());
+		;
 
 		base.OnModelCreating(modelBuilder);

[NoCoverage] Negate expression
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:38:7
 														.SelectMany(x => x)
 														.ToList();
 
-		if (IsUserWaitingOnline())
+		if (!(IsUserWaitingOnline()))
 		{
 			AddDomainEventsToOfflineProcessingQueue(domainEvents);

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:40:4
 
 		if (IsUserWaitingOnline())
 		{
-			AddDomainEventsToOfflineProcessingQueue(domainEvents);
+			;
 			return await base.SaveChangesAsync(cancellationToken);
 		}

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:44:3
 			return await base.SaveChangesAsync(cancellationToken);
 		}
 
-		await PublishDomainEventsAsync(domainEvents);
+		;
 		return await base.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Equality mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:50:10
 
 	private bool IsUserWaitingOnline()
 	{
-		return httpContextAccessor.HttpContext is not null;
+		return httpContextAccessor.HttpContext is null;
 	}
 

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:57:4
 	{
 		foreach (IDomainEvent domainEvent in domainEvents)
 		{
-			await publisher.Publish(domainEvent);
+			;
 		}
 	}

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/ClubDbContext.cs:76:3
 			domainEventsQueue = new Queue<IDomainEvent>();
 		}
 
-		domainEvents.ForEach(domainEventsQueue.Enqueue);
+		;
 		httpContextAccessor.HttpContext.Items[EventualConsistencyMiddleware.DomainEventsKey] = domainEventsQueue;
 	}
