[NoCoverage] Null coalescing mutation (remove left)
src/ClubAdministrationService.Domain/AdminAggregate/Admin.Behavior.cs:13:10
 		Guid userId,
 		Guid? subscriptionId = null,
 		Guid? id = null)
-		: base(id ?? Guid.CreateVersion7())
+		: base(Guid.CreateVersion7())
 	{
 		UserId = userId;

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Domain/AdminAggregate/Admin.Behavior.cs:14:2
 		Guid? subscriptionId = null,
 		Guid? id = null)
 		: base(id ?? Guid.CreateVersion7())
-	{
-		UserId = userId;
-		SubscriptionId = subscriptionId;
-	}
+	{}
 
 	private Admin()
