[NoCoverage] Equality mutation
src/ClubAdministrationService.Domain/AdminAggregate/Admin.Data.cs:9:7
 {
 	internal void SetSubscription(Subscription subscription)
 	{
-		if (SubscriptionId is not null)
+		if (SubscriptionId is null)
 		{
 			throw new InvalidOperationException();

[NoCoverage] Statement mutation
src/ClubAdministrationService.Domain/AdminAggregate/Admin.Data.cs:11:4
 	{
 		if (SubscriptionId is not null)
 		{
-			throw new InvalidOperationException();
+			;
 		}
 
