[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:12:3
 {
 	public void Configure(EntityTypeBuilder<Club> builder)
 	{
-		builder.HasKey(g => g.Id);
+		;
 
 		builder.Property(g => g.Id).ValueGeneratedNever();

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:14:3
 	{
 		builder.HasKey(g => g.Id);
 
-		builder.Property(g => g.Id).ValueGeneratedNever();
+		;
 
 		builder.Property("_maxCourtCapacity")

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:16:3
 
 		builder.Property(g => g.Id).ValueGeneratedNever();
 
-		builder.Property("_maxCourtCapacity")
-				.HasColumnName("MaxCourtCapacity");
+		;
 
 		builder.Property<List<Guid>>("_courtIds")

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:19:3
 		builder.Property("_maxCourtCapacity")
 				.HasColumnName("MaxCourtCapacity");
 
-		builder.Property<List<Guid>>("_courtIds")
-				.HasColumnName("CourtIds")
-				.HasListOfIdsConverter();
+		;
 
 		builder.Property<List<Guid>>("_instructorIds")

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:20:20
 				.HasColumnName("MaxCourtCapacity");
 
 		builder.Property<List<Guid>>("_courtIds")
-				.HasColumnName("CourtIds")
+				.HasColumnName("")
 				.HasListOfIdsConverter();
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:23:3
 				.HasColumnName("CourtIds")
 				.HasListOfIdsConverter();
 
-		builder.Property<List<Guid>>("_instructorIds")
-				.HasColumnName("InstructorIds")
-				.HasListOfIdsConverter();
+		;
 
 		builder.Property(g => g.Name);

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:23:32
 				.HasColumnName("CourtIds")
 				.HasListOfIdsConverter();
 
-		builder.Property<List<Guid>>("_instructorIds")
+		builder.Property<List<Guid>>("")
 				.HasColumnName("InstructorIds")
 				.HasListOfIdsConverter();

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:27:3
 				.HasColumnName("InstructorIds")
 				.HasListOfIdsConverter();
 
-		builder.Property(g => g.Name);
+		;
 		builder.Property(g => g.SubscriptionId);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/ClubConfiguration.cs:28:3
 				.HasListOfIdsConverter();
 
 		builder.Property(g => g.Name);
-		builder.Property(g => g.SubscriptionId);
+		;
 	}
 }
