[Survived] Statement mutation
SessionBookingService.WebApi/Endpoints/Bookings/CreateBooking.cs:13:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("/sessions/{sessionId:guid}/bookings",
-					async (CreateBookingRequest request,
-							Guid sessionId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						CreateBookingCommand command = new(sessionId, request.PlayerId);
-
-						Result createBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = createBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Bookings)
-			.WithSummary("Create booking")
-			.WithDescription("Create booking for a session");
+		;
 		//.RequireAuthorization();
 	}

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Bookings/CreateBooking.cs:13:15
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("/sessions/{sessionId:guid}/bookings",
+		app.MapPost("",
 					async (CreateBookingRequest request,
 							Guid sessionId,

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Bookings/CreateBooking.cs:18:6
 							Guid sessionId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						CreateBookingCommand command = new(sessionId, request.PlayerId);
-
-						Result createBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = createBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Bookings)
 			.WithSummary("Create booking")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Bookings/CreateBooking.cs:30:21
 					})
 			.WithTags(Tags.Bookings)
 			.WithSummary("Create booking")
-			.WithDescription("Create booking for a session");
+			.WithDescription("");
 		//.RequireAuthorization();
 	}
