[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/OutboxIntegrationEventsConfiguration.cs:11:3
 {
 	public void Configure(EntityTypeBuilder<OutboxIntegrationEvent> builder)
 	{
-		builder.Property<int>("Id").ValueGeneratedOnAdd();
+		;
 
 		builder.HasKey("Id");

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/OutboxIntegrationEventsConfiguration.cs:13:3
 	{
 		builder.Property<int>("Id").ValueGeneratedOnAdd();
 
-		builder.HasKey("Id");
+		;
 
 		builder.Property(o => o.EventName);

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Configurations/OutboxIntegrationEventsConfiguration.cs:13:18
 	{
 		builder.Property<int>("Id").ValueGeneratedOnAdd();
 
-		builder.HasKey("Id");
+		builder.HasKey("");
 
 		builder.Property(o => o.EventName);

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/OutboxIntegrationEventsConfiguration.cs:15:3
 
 		builder.HasKey("Id");
 
-		builder.Property(o => o.EventName);
+		;
 		builder.Property(o => o.EventContent);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/OutboxIntegrationEventsConfiguration.cs:16:3
 		builder.HasKey("Id");
 
 		builder.Property(o => o.EventName);
-		builder.Property(o => o.EventContent);
+		;
 	}
 }
