[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/SubscriptionConfiguration.cs:12:3
 {
 	public void Configure(EntityTypeBuilder<Subscription> builder)
 	{
-		builder.HasKey(s => s.Id);
+		;
 		builder.Property(s => s.Id).ValueGeneratedNever();
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/SubscriptionConfiguration.cs:13:3
 	public void Configure(EntityTypeBuilder<Subscription> builder)
 	{
 		builder.HasKey(s => s.Id);
-		builder.Property(s => s.Id).ValueGeneratedNever();
+		;
 
 		builder.Property("_maxCourtsAllowed").HasColumnName("MaxCourtsAllowed");

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/SubscriptionConfiguration.cs:15:3
 		builder.HasKey(s => s.Id);
 		builder.Property(s => s.Id).ValueGeneratedNever();
 
-		builder.Property("_maxCourtsAllowed").HasColumnName("MaxCourtsAllowed");
+		;
 
 		builder.Property(s => s.SubscriptionType)

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/SubscriptionConfiguration.cs:17:3
 
 		builder.Property("_maxCourtsAllowed").HasColumnName("MaxCourtsAllowed");
 
-		builder.Property(s => s.SubscriptionType)
-				.HasConversion(subscriptionType => subscriptionType.Value,
-								value => SubscriptionType.FromValue(value));
+		;
 
 		builder.Property<List<Guid>>("_clubIds").HasColumnName("ClubIds").HasListOfIdsConverter();

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Configurations/SubscriptionConfiguration.cs:21:3
 				.HasConversion(subscriptionType => subscriptionType.Value,
 								value => SubscriptionType.FromValue(value));
 
-		builder.Property<List<Guid>>("_clubIds").HasColumnName("ClubIds").HasListOfIdsConverter();
+		;
 	}
 }
