[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Sessions/CreateSession.cs:25:6
 						SessionCategoryUtils.ToDomain(request.Categories);
 
 					if (categoriesToDomainResult.IsFailure)
-					{
-						return ProblemDetailsMapper.Problem([categoriesToDomainResult.Error]);
-					}
+					{}
 
 					CreateSessionCommand command = new(courtId,

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Sessions/CreateSession.cs:57:17
 						return response;
 					})
 			.WithTags(Tags.Sessions)
-			.WithSummary("Create session")
+			.WithSummary("")
 			.WithDescription("Create session for a court")
 			.Produces<SessionResponse>(StatusCodes.Status201Created);
