[NoCoverage] Block removal mutation
src/ClubAdministrationService.Infrastructure/Converters/FluentApiExtensions.cs:8:2
 public static class FluentApiExtensions
 {
 	public static PropertyBuilder<T> HasListOfIdsConverter<T>(this PropertyBuilder<T> propertyBuilder)
-	{
-		return propertyBuilder.HasConversion(new ListOfIdsConverter(),
-											new ListOfIdsComparer());
-	}
+	{}
 }
 
