[Survived] Boolean mutation
src/SessionBookingService.WebApi/Extensions/EndpointExtensions.cs:13:60
 	{
 		ServiceDescriptor[] serviceDescriptors = assembly.DefinedTypes
 														.Where(type =>
-																	type is { IsAbstract: false, IsInterface: false } &&
+																	type is { IsAbstract: false, IsInterface: true } &&
 																	type.IsAssignableTo(typeof(IEndpoint)))
 														.Select(type => ServiceDescriptor.Transient(
