[Killed] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/DependencyInjection.cs:20:3
 	{
 		var connectionString = config.GetConnectionString("Database");
 
-		services.AddDbContext<ClubDbContext>(opts => { opts.UseNpgsql(connectionString); });
+		;
 
 		services.AddScoped<IAdminsRepository, AdminsRepository>();
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/DependencyInjection.cs:20:50
 	{
 		var connectionString = config.GetConnectionString("Database");
 
-		services.AddDbContext<ClubDbContext>(opts => { opts.UseNpgsql(connectionString); });
+		services.AddDbContext<ClubDbContext>(opts => { ; });
 
 		services.AddScoped<IAdminsRepository, AdminsRepository>();

[Killed] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/DependencyInjection.cs:22:3
 
 		services.AddDbContext<ClubDbContext>(opts => { opts.UseNpgsql(connectionString); });
 
-		services.AddScoped<IAdminsRepository, AdminsRepository>();
+		;
 		services.AddScoped<IClubsRepository, ClubsRepository>();
 		services.AddScoped<ISubscriptionsRepository, SubscriptionsRepository>();
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[Killed] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/DependencyInjection.cs:23:3
 		services.AddDbContext<ClubDbContext>(opts => { opts.UseNpgsql(connectionString); });
 
 		services.AddScoped<IAdminsRepository, AdminsRepository>();
-		services.AddScoped<IClubsRepository, ClubsRepository>();
+		;
 		services.AddScoped<ISubscriptionsRepository, SubscriptionsRepository>();
 
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned

[Killed] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/DependencyInjection.cs:24:3
 
 		services.AddScoped<IAdminsRepository, AdminsRepository>();
 		services.AddScoped<IClubsRepository, ClubsRepository>();
-		services.AddScoped<ISubscriptionsRepository, SubscriptionsRepository>();
+		;
 
 		return services;
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned
