[Survived] Statement mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:15:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("login",
-					async (LoginRequest request, ISender sender, CancellationToken cancellationToken) =>
-					{
-						LoginQuery query = new(request.Email, request.Password);
-						Result<AuthenticationResult> authResult = await sender.Send(query, cancellationToken);
-
-						if (authResult.IsFailure && authResult.Error == AuthenticationErrors.InvalidCredentials)
-						{
-							return Results.Unauthorized();
-						}
-
-						IResult response =
-							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "", "", "")),
-											p => ProblemDetailsMapper.Problem([p.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Authentication)
-			.WithSummary("Login")
-			.WithDescription("Login")
-			.Produces<ProfileResponse>(StatusCodes.Status201Created);
+		;
 	}
 }

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:15:15
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("login",
+		app.MapPost("",
 					async (LoginRequest request, ISender sender, CancellationToken cancellationToken) =>
 					{

[Survived] Equality mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:21:35
 						LoginQuery query = new(request.Email, request.Password);
 						Result<AuthenticationResult> authResult = await sender.Send(query, cancellationToken);
 
-						if (authResult.IsFailure && authResult.Error == AuthenticationErrors.InvalidCredentials)
+						if (authResult.IsFailure && authResult.Error != AuthenticationErrors.InvalidCredentials)
 						{
 							return Results.Unauthorized();

[Survived] Negate expression
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:21:11
 						LoginQuery query = new(request.Email, request.Password);
 						Result<AuthenticationResult> authResult = await sender.Send(query, cancellationToken);
 
-						if (authResult.IsFailure && authResult.Error == AuthenticationErrors.InvalidCredentials)
+						if (!(authResult.IsFailure && authResult.Error == AuthenticationErrors.InvalidCredentials))
 						{
 							return Results.Unauthorized();

[Survived] Block removal mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:22:7
 						Result<AuthenticationResult> authResult = await sender.Send(query, cancellationToken);
 
 						if (authResult.IsFailure && authResult.Error == AuthenticationErrors.InvalidCredentials)
-						{
-							return Results.Unauthorized();
-						}
+						{}
 
 						IResult response =

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:27:91
 						}
 
 						IResult response =
-							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "", "", "")),
+							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "", "", "Stryker was here!")),
 											p => ProblemDetailsMapper.Problem([p.Error]));
 

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Login.cs:34:21
 					})
 			.WithTags(Tags.Authentication)
 			.WithSummary("Login")
-			.WithDescription("Login")
+			.WithDescription("")
 			.Produces<ProfileResponse>(StatusCodes.Status201Created);
 	}
