[Survived] Statement mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Register.cs:16:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("register",
-					async (RegisterRequest request, ISender sender, CancellationToken cancellationToken) =>
-					{
-						RegisterCommand command =
-							new(request.FirstName, request.LastName, request.Email, request.Password);
-
-						Result<AuthenticationResult> authResult = await sender.Send(command, cancellationToken);
-
-						IResult response =
-							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "", "", "")),
-											p => ProblemDetailsMapper.Problem([p.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Authentication)
-			.WithSummary("Register")
-			.WithDescription("Register")
-			.Produces<ProfileResponse>(StatusCodes.Status201Created);
+		;
 	}
 }

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Authentication/Register.cs:25:83
 						Result<AuthenticationResult> authResult = await sender.Send(command, cancellationToken);
 
 						IResult response =
-							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "", "", "")),
+							authResult.Match(p => Results.Ok(new AuthenticationResponse(p.User.Id, "", "Stryker was here!", "", "")),
 											p => ProblemDetailsMapper.Problem([p.Error]));
 
