[NoCoverage] Statement mutation
ClubAdministrationService.Infrastructure/IntegrationEvents/OutboxWriter/OutboxWriterEventHandler.cs:20:3
 														  notification.Club.Id,
 														  notification.Court.MaxDailySessions);
 
-		await AddOutboxIntegrationEventAsync(integrationEvent);
+		;
 	}
 

[NoCoverage] Statement mutation
ClubAdministrationService.Infrastructure/IntegrationEvents/OutboxWriter/OutboxWriterEventHandler.cs:26:3
 	public async ValueTask Handle(CourtRemovedFromClubEvent notification, CancellationToken cancellationToken)
 	{
 		CourtRemovedIntegrationEvent integrationEvent = new(notification.CourtId);
-		await AddOutboxIntegrationEventAsync(integrationEvent);
+		;
 	}
 

[NoCoverage] Statement mutation
ClubAdministrationService.Infrastructure/IntegrationEvents/OutboxWriter/OutboxWriterEventHandler.cs:33:3
 	{
 		OutboxIntegrationEvent outboxIntegrationEvent = new(EventName: integrationEvent.GetType().Name,
 															EventContent: JsonSerializer.Serialize(integrationEvent));
-		await clubDbContext.OutboxIntegrationEvents.AddAsync(outboxIntegrationEvent);
+		;
 
 		await clubDbContext.SaveChangesAsync();

[NoCoverage] Statement mutation
ClubAdministrationService.Infrastructure/IntegrationEvents/OutboxWriter/OutboxWriterEventHandler.cs:35:3
 															EventContent: JsonSerializer.Serialize(integrationEvent));
 		await clubDbContext.OutboxIntegrationEvents.AddAsync(outboxIntegrationEvent);
 
-		await clubDbContext.SaveChangesAsync();
+		;
 	}
 }
