[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:16:3
 	public async Task InvokeAsync(HttpContext context, IPublisher publisher, ClubDbContext dbContext)
 	{
 		IDbContextTransaction transaction = await dbContext.Database.BeginTransactionAsync(context.RequestAborted);
-		context.Response.OnCompleted(async () =>
-		{
-			try
-			{
-				if (context.Items.TryGetValue(DomainEventsKey, out var value) &&
-					value is Queue<IDomainEvent> domainEvents)
-				{
-					while (domainEvents.TryDequeue(out IDomainEvent? nextEvent))
-					{
-						await publisher.Publish(nextEvent, context.RequestAborted);
-					}
-				}
-
-				await transaction.CommitAsync(context.RequestAborted);
-			}
-			catch (EventualConsistencyException)
-			{
-				// handle eventual consistency exception
-			}
-			finally
-			{
-				await transaction.DisposeAsync();
-			}
-		});
+		;
 
 		await next(context);

[NoCoverage] Negate expression
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:23:13
 				if (context.Items.TryGetValue(DomainEventsKey, out var value) &&
 					value is Queue<IDomainEvent> domainEvents)
 				{
-					while (domainEvents.TryDequeue(out IDomainEvent? nextEvent))
+					while (!(domainEvents.TryDequeue(out IDomainEvent? nextEvent)))
 					{
 						await publisher.Publish(nextEvent, context.RequestAborted);

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:25:7
 				{
 					while (domainEvents.TryDequeue(out IDomainEvent? nextEvent))
 					{
-						await publisher.Publish(nextEvent, context.RequestAborted);
+						;
 					}
 				}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:29:5
 					}
 				}
 
-				await transaction.CommitAsync(context.RequestAborted);
+				;
 			}
 			catch (EventualConsistencyException)

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:37:5
 			}
 			finally
 			{
-				await transaction.DisposeAsync();
+				;
 			}
 		});

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Middleware/EventualConsistencyMiddleware.cs:41:3
 			}
 		});
 
-		await next(context);
+		;
 	}
 }
