[Survived] Equality mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:13:28
 	{
 		ServiceDescriptor[] serviceDescriptors = assembly
 												.DefinedTypes
-												.Where(type => type is { IsAbstract: false, IsInterface: false } &&
+												.Where(type => type is not { IsAbstract: false, IsInterface: false } &&
 																type.IsAssignableTo(typeof(IEndpoint)))
 												.Select(type => ServiceDescriptor.Transient(typeof(IEndpoint), type))

[Survived] Logical mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:13:28
 	{
 		ServiceDescriptor[] serviceDescriptors = assembly
 												.DefinedTypes
-												.Where(type => type is { IsAbstract: false, IsInterface: false } &&
-																type.IsAssignableTo(typeof(IEndpoint)))
+												.Where(type => type is { IsAbstract: false, IsInterface: false } ||
+																type.IsAssignableTo(typeof(IEndpoint)))
 												.Select(type => ServiceDescriptor.Transient(typeof(IEndpoint), type))
 												.ToArray();

[Survived] Statement mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:18:3
 												.Select(type => ServiceDescriptor.Transient(typeof(IEndpoint), type))
 												.ToArray();
 
-		services.TryAddEnumerable(serviceDescriptors);
+		;
 
 		return services;

[Survived] Equality mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:29:35
 	{
 		IEnumerable<IEndpoint> endpoints = app.Services.GetRequiredService<IEnumerable<IEndpoint>>();
 
-		IEndpointRouteBuilder builder = routeGroupBuilder is null ? app : routeGroupBuilder;
+		IEndpointRouteBuilder builder = routeGroupBuilder is not null ? app : routeGroupBuilder;
 
 		foreach (IEndpoint endpoint in endpoints)

[Survived] Conditional (false) mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:29:35
 	{
 		IEnumerable<IEndpoint> endpoints = app.Services.GetRequiredService<IEnumerable<IEndpoint>>();
 
-		IEndpointRouteBuilder builder = routeGroupBuilder is null ? app : routeGroupBuilder;
+		IEndpointRouteBuilder builder = (false?app :routeGroupBuilder);
 
 		foreach (IEndpoint endpoint in endpoints)

[Survived] Statement mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:33:4
 
 		foreach (IEndpoint endpoint in endpoints)
 		{
-			endpoint.MapEndpoint(builder);
+			;
 		}
 	}

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Extensions/EndpointExtensions.cs:38:2
 	}
 
 	public static RouteHandlerBuilder HasPermission(this RouteHandlerBuilder app, string permission)
-	{
-		return app.RequireAuthorization(permission);
-	}
+	{}
 }
 
