[Survived] Equality mutation
src/UserAdministrationService.Application/Login/LoginQueryHandler.cs:18:7
 	public async ValueTask<Result<AuthenticationResult>> Handle(LoginQuery query, CancellationToken cancellationToken)
 	{
 		User? user = await usersRepository.GetByEmailAsync(query.Email, cancellationToken);
-		if (user is null)
+		if (user is not null)
 		{
 			return Result.Failure<AuthenticationResult>(AuthenticationErrors.InvalidCredentials);

[Survived] Block removal mutation
src/UserAdministrationService.Application/Login/LoginQueryHandler.cs:19:3
 	{
 		User? user = await usersRepository.GetByEmailAsync(query.Email, cancellationToken);
 		if (user is null)
-		{
-			return Result.Failure<AuthenticationResult>(AuthenticationErrors.InvalidCredentials);
-		}
+		{}
 
 		var hasValidPassword = user.IsValidPasswordHash(query.Password, passwordHasher);

[Survived] Negate expression
src/UserAdministrationService.Application/Login/LoginQueryHandler.cs:24:7
 		}
 
 		var hasValidPassword = user.IsValidPasswordHash(query.Password, passwordHasher);
-		if (hasValidPassword)
+		if (!(hasValidPassword))
 		{
 			return Result.Failure<AuthenticationResult>(AuthenticationErrors.InvalidCredentials);

[Survived] Block removal mutation
src/UserAdministrationService.Application/Login/LoginQueryHandler.cs:25:3
 
 		var hasValidPassword = user.IsValidPasswordHash(query.Password, passwordHasher);
 		if (hasValidPassword)
-		{
-			return Result.Failure<AuthenticationResult>(AuthenticationErrors.InvalidCredentials);
-		}
+		{}
 
 		return new AuthenticationResult(user, jwtTokenGenerator.GenerateToken(user));
