[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:18:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.CreateTable(
-                name: "Admins",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Admins", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:22:69
                 name: "Admins",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
+                    Id = table.Column<Guid>(type: "uuid", nullable: true),
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: true)
                 },

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:23:81
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: true)
+                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:27:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Admins", x => x.Id);
+                    ;
                 });
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:30:13
                     table.PrimaryKey("PK_Admins", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Clubs",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: false),
-                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
-                    CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
-                    InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
-                    MaxCourtCapacity = table.Column<int>(type: "integer", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Clubs", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:31:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "Clubs",
+                name: "",
                 columns: table => new
                 {

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:35:73
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: false),
+                    Name = table.Column<string>(type: "text", nullable: true),
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
                     CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:36:81
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
-                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
+                    SubscriptionId = table.Column<Guid>(type: "uuid", nullable: true),
                     CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
                     InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:37:83
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
-                    CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
+                    CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: true),
                     InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
                     MaxCourtCapacity = table.Column<int>(type: "integer", nullable: false)

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:38:88
                     Name = table.Column<string>(type: "text", nullable: false),
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
                     CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
-                    InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
+                    InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: true),
                     MaxCourtCapacity = table.Column<int>(type: "integer", nullable: false)
                 },

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:39:85
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
                     CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
                     InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
-                    MaxCourtCapacity = table.Column<int>(type: "integer", nullable: false)
+                    MaxCourtCapacity = table.Column<int>(type: "integer", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:39:64
                     SubscriptionId = table.Column<Guid>(type: "uuid", nullable: false),
                     CourtIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
                     InstructorIds = table.Column<List<Guid>>(type: "uuid[]", nullable: false),
-                    MaxCourtCapacity = table.Column<int>(type: "integer", nullable: false)
+                    MaxCourtCapacity = table.Column<int>(type: "", nullable: false)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:43:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Clubs", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:43:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Clubs", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:46:13
                     table.PrimaryKey("PK_Clubs", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "OutboxIntegrationEvent",
-                columns: table => new
-                {
-                    Id = table.Column<int>(type: "integer", nullable: false)
-                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
-                    EventName = table.Column<string>(type: "text", nullable: false),
-                    EventContent = table.Column<string>(type: "text", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_OutboxIntegrationEvent", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:50:71
                 name: "OutboxIntegrationEvent",
                 columns: table => new
                 {
-                    Id = table.Column<int>(type: "integer", nullable: false)
+                    Id = table.Column<int>(type: "integer", nullable: true)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     EventName = table.Column<string>(type: "text", nullable: false),

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:52:78
                 {
                     Id = table.Column<int>(type: "integer", nullable: false)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
-                    EventName = table.Column<string>(type: "text", nullable: false),
+                    EventName = table.Column<string>(type: "text", nullable: true),
                     EventContent = table.Column<string>(type: "text", nullable: false)
                 },

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:53:81
                     Id = table.Column<int>(type: "integer", nullable: false)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     EventName = table.Column<string>(type: "text", nullable: false),
-                    EventContent = table.Column<string>(type: "text", nullable: false)
+                    EventContent = table.Column<string>(type: "text", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:57:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_OutboxIntegrationEvent", x => x.Id);
+                    ;
                 });
 

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:57:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_OutboxIntegrationEvent", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:60:13
                     table.PrimaryKey("PK_OutboxIntegrationEvent", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Subscriptions",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    SubscriptionType = table.Column<int>(type: "integer", nullable: false),
-                    ClubIds = table.Column<string>(type: "text", nullable: false),
-                    MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Subscriptions", x => x.Id);
-                });
+            ;
         }
 

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:65:85
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    SubscriptionType = table.Column<int>(type: "integer", nullable: false),
+                    SubscriptionType = table.Column<int>(type: "integer", nullable: true),
                     ClubIds = table.Column<string>(type: "text", nullable: false),
                     MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: false)

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:66:76
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     SubscriptionType = table.Column<int>(type: "integer", nullable: false),
-                    ClubIds = table.Column<string>(type: "text", nullable: false),
+                    ClubIds = table.Column<string>(type: "text", nullable: true),
                     MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: false)
                 },

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:66:58
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     SubscriptionType = table.Column<int>(type: "integer", nullable: false),
-                    ClubIds = table.Column<string>(type: "text", nullable: false),
+                    ClubIds = table.Column<string>(type: "", nullable: false),
                     MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: false)
                 },

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:67:85
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     SubscriptionType = table.Column<int>(type: "integer", nullable: false),
                     ClubIds = table.Column<string>(type: "text", nullable: false),
-                    MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: false)
+                    MaxCourtsAllowed = table.Column<int>(type: "integer", nullable: true)
                 },
                 constraints: table =>

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:71:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Subscriptions", x => x.Id);
+                    ;
                 });
         }

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:71:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Subscriptions", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
         }

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:78:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "Admins");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:79:23
         protected override void Down(MigrationBuilder migrationBuilder)
         {
             migrationBuilder.DropTable(
-                name: "Admins");
+                name: "");
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:81:13
             migrationBuilder.DropTable(
                 name: "Admins");
 
-            migrationBuilder.DropTable(
-                name: "Clubs");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:84:13
             migrationBuilder.DropTable(
                 name: "Clubs");
 
-            migrationBuilder.DropTable(
-                name: "OutboxIntegrationEvent");
+            ;
 
             migrationBuilder.DropTable(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260701224812_InitialCreate.cs:87:13
             migrationBuilder.DropTable(
                 name: "OutboxIntegrationEvent");
 
-            migrationBuilder.DropTable(
-                name: "Subscriptions");
+            ;
         }
     }
