[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:17:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AlterColumn<string>(
-                name: "InstructorIds",
-                table: "Clubs",
-                type: "text",
-                nullable: false,
-                oldClrType: typeof(List<Guid>),
-                oldType: "uuid[]");
+            ;
 
             migrationBuilder.AlterColumn<string>(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:18:23
         protected override void Up(MigrationBuilder migrationBuilder)
         {
             migrationBuilder.AlterColumn<string>(
-                name: "InstructorIds",
+                name: "",
                 table: "Clubs",
                 type: "text",

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:21:27
                 name: "InstructorIds",
                 table: "Clubs",
                 type: "text",
-                nullable: false,
+                nullable: true,
                 oldClrType: typeof(List<Guid>),
                 oldType: "uuid[]");

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:23:26
                 type: "text",
                 nullable: false,
                 oldClrType: typeof(List<Guid>),
-                oldType: "uuid[]");
+                oldType: "");
 
             migrationBuilder.AlterColumn<string>(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:25:13
                 oldClrType: typeof(List<Guid>),
                 oldType: "uuid[]");
 
-            migrationBuilder.AlterColumn<string>(
-                name: "CourtIds",
-                table: "Clubs",
-                type: "text",
-                nullable: false,
-                oldClrType: typeof(List<Guid>),
-                oldType: "uuid[]");
+            ;
         }
 

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:27:24
 
             migrationBuilder.AlterColumn<string>(
                 name: "CourtIds",
-                table: "Clubs",
+                table: "",
                 type: "text",
                 nullable: false,

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:28:23
             migrationBuilder.AlterColumn<string>(
                 name: "CourtIds",
                 table: "Clubs",
-                type: "text",
+                type: "",
                 nullable: false,
                 oldClrType: typeof(List<Guid>),

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:37:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.AlterColumn<List<Guid>>(
-                name: "InstructorIds",
-                table: "Clubs",
-                type: "uuid[]",
-                nullable: false,
-                oldClrType: typeof(string),
-                oldType: "text");
+            ;
 
             migrationBuilder.AlterColumn<List<Guid>>(

[NoCoverage] Boolean mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:41:27
                 name: "InstructorIds",
                 table: "Clubs",
                 type: "uuid[]",
-                nullable: false,
+                nullable: true,
                 oldClrType: typeof(string),
                 oldType: "text");

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:45:13
                 oldClrType: typeof(string),
                 oldType: "text");
 
-            migrationBuilder.AlterColumn<List<Guid>>(
-                name: "CourtIds",
-                table: "Clubs",
-                type: "uuid[]",
-                nullable: false,
-                oldClrType: typeof(string),
-                oldType: "text");
+            ;
         }
     }

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260727072931_AddListOfIdsToClubEntity.cs:48:23
             migrationBuilder.AlterColumn<List<Guid>>(
                 name: "CourtIds",
                 table: "Clubs",
-                type: "uuid[]",
+                type: "",
                 nullable: false,
                 oldClrType: typeof(string),
