[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:15:13
         /// <inheritdoc />
         protected override void Up(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropPrimaryKey(
-                name: "PK_OutboxIntegrationEvent",
-                table: "OutboxIntegrationEvent");
+            ;
 
             migrationBuilder.RenameTable(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:19:13
                 name: "PK_OutboxIntegrationEvent",
                 table: "OutboxIntegrationEvent");
 
-            migrationBuilder.RenameTable(
-                name: "OutboxIntegrationEvent",
-                newName: "OutboxIntegrationEvents");
+            ;
 
             migrationBuilder.AddPrimaryKey(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:20:23
                 table: "OutboxIntegrationEvent");
 
             migrationBuilder.RenameTable(
-                name: "OutboxIntegrationEvent",
+                name: "",
                 newName: "OutboxIntegrationEvents");
 

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:21:26
 
             migrationBuilder.RenameTable(
                 name: "OutboxIntegrationEvent",
-                newName: "OutboxIntegrationEvents");
+                newName: "");
 
             migrationBuilder.AddPrimaryKey(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:23:13
                 name: "OutboxIntegrationEvent",
                 newName: "OutboxIntegrationEvents");
 
-            migrationBuilder.AddPrimaryKey(
-                name: "PK_OutboxIntegrationEvents",
-                table: "OutboxIntegrationEvents",
-                column: "Id");
+            ;
         }
 

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:25:24
 
             migrationBuilder.AddPrimaryKey(
                 name: "PK_OutboxIntegrationEvents",
-                table: "OutboxIntegrationEvents",
+                table: "",
                 column: "Id");
         }

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:32:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropPrimaryKey(
-                name: "PK_OutboxIntegrationEvents",
-                table: "OutboxIntegrationEvents");
+            ;
 
             migrationBuilder.RenameTable(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:34:24
         {
             migrationBuilder.DropPrimaryKey(
                 name: "PK_OutboxIntegrationEvents",
-                table: "OutboxIntegrationEvents");
+                table: "");
 
             migrationBuilder.RenameTable(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:36:13
                 name: "PK_OutboxIntegrationEvents",
                 table: "OutboxIntegrationEvents");
 
-            migrationBuilder.RenameTable(
-                name: "OutboxIntegrationEvents",
-                newName: "OutboxIntegrationEvent");
+            ;
 
             migrationBuilder.AddPrimaryKey(

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:38:26
 
             migrationBuilder.RenameTable(
                 name: "OutboxIntegrationEvents",
-                newName: "OutboxIntegrationEvent");
+                newName: "");
 
             migrationBuilder.AddPrimaryKey(

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:40:13
                 name: "OutboxIntegrationEvents",
                 newName: "OutboxIntegrationEvent");
 
-            migrationBuilder.AddPrimaryKey(
-                name: "PK_OutboxIntegrationEvent",
-                table: "OutboxIntegrationEvent",
-                column: "Id");
+            ;
         }
     }

[NoCoverage] String mutation
src/ClubAdministrationService.Infrastructure/Migrations/20260803172224_AddOutboxIntegrationEvents.cs:41:23
                 newName: "OutboxIntegrationEvent");
 
             migrationBuilder.AddPrimaryKey(
-                name: "PK_OutboxIntegrationEvent",
+                name: "",
                 table: "OutboxIntegrationEvent",
                 column: "Id");
