[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/AdminsRepository.cs:11:3
 {
 	public async Task AddAdminAsync(Admin player, CancellationToken cancellationToken)
 	{
-		await clubDbContext.Admins.AddAsync(player, cancellationToken);
+		;
 		await clubDbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/AdminsRepository.cs:12:3
 	public async Task AddAdminAsync(Admin player, CancellationToken cancellationToken)
 	{
 		await clubDbContext.Admins.AddAsync(player, cancellationToken);
-		await clubDbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/AdminsRepository.cs:17:56
 
 	public Task<Admin?> GetByIdAsync(Guid adminId, CancellationToken cancellationToken)
 	{
-		return clubDbContext.Admins.FirstOrDefaultAsync(a => a.Id == adminId, cancellationToken);
+		return clubDbContext.Admins.FirstOrDefaultAsync(a => a.Id != adminId, cancellationToken);
 	}
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/AdminsRepository.cs:22:3
 
 	public async Task UpdateAsync(Admin admin, CancellationToken cancellationToken)
 	{
-		clubDbContext.Update(admin);
+		;
 		await clubDbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/AdminsRepository.cs:23:3
 	public async Task UpdateAsync(Admin admin, CancellationToken cancellationToken)
 	{
 		clubDbContext.Update(admin);
-		await clubDbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 }
