[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:11:3
 {
 	public async Task AddClubAsync(Club club, CancellationToken cancellationToken)
 	{
-		await dbContext.Clubs.AddAsync(club, cancellationToken);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:12:3
 	public async Task AddClubAsync(Club club, CancellationToken cancellationToken)
 	{
 		await dbContext.Clubs.AddAsync(club, cancellationToken);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:17:61
 
 	public async Task<bool> ExistsAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await dbContext.Clubs.AsNoTracking().AnyAsync(c => c.Id == id, cancellationToken);
+		return await dbContext.Clubs.AsNoTracking().AnyAsync(c => c.Id != id, cancellationToken);
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:22:57
 
 	public async Task<Club?> GetByIdAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await dbContext.Clubs.FirstOrDefaultAsync(c => c.Id == id, cancellationToken);
+		return await dbContext.Clubs.FirstOrDefaultAsync(c => c.Id != id, cancellationToken);
 	}
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:27:3
 
 	public async Task UpdateAsync(Club club, CancellationToken cancellationToken)
 	{
-		dbContext.Update(club);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:28:3
 	public async Task UpdateAsync(Club club, CancellationToken cancellationToken)
 	{
 		dbContext.Update(club);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/ClubsRepository.cs:34:20
 	public async Task<List<Club>> ListSubscriptionClubs(Guid subscriptionId, CancellationToken cancellationToken)
 	{
 		return await dbContext.Clubs
-							.Where(c => c.SubscriptionId == subscriptionId)
+							.Where(c => c.SubscriptionId != subscriptionId)
 							.ToListAsync(cancellationToken);
 	}
