[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:11:3
 {
 	public async Task AddSubscriptionAsync(Subscription subscription, CancellationToken cancellationToken)
 	{
-		await clubDbContext.Subscriptions.AddAsync(subscription, cancellationToken);
+		;
 		await clubDbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:12:3
 	public async Task AddSubscriptionAsync(Subscription subscription, CancellationToken cancellationToken)
 	{
 		await clubDbContext.Subscriptions.AddAsync(subscription, cancellationToken);
-		await clubDbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:19:24
 	{
 		return await clubDbContext.Subscriptions
 								.AsNoTracking()
-								.AnyAsync(s => s.Id == id, cancellationToken);
+								.AnyAsync(s => s.Id != id, cancellationToken);
 	}
 

[NoCoverage] Equality mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:24:69
 
 	public async Task<Subscription?> GetByIdAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await clubDbContext.Subscriptions.FirstOrDefaultAsync(s => s.Id == id, cancellationToken);
+		return await clubDbContext.Subscriptions.FirstOrDefaultAsync(s => s.Id != id, cancellationToken);
 	}
 

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:28:2
 	}
 
 	public async Task<List<Subscription>> ListAsync(CancellationToken cancellationToken)
-	{
-		return await clubDbContext.Subscriptions.ToListAsync(cancellationToken);
-	}
+	{}
 
 	public async Task UpdateAsync(Subscription subscription, CancellationToken cancellationToken)

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:34:3
 
 	public async Task UpdateAsync(Subscription subscription, CancellationToken cancellationToken)
 	{
-		clubDbContext.Update(subscription);
+		;
 		await clubDbContext.SaveChangesAsync(cancellationToken);
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Infrastructure/Repositories/SubscriptionsRepository.cs:35:3
 	public async Task UpdateAsync(Subscription subscription, CancellationToken cancellationToken)
 	{
 		clubDbContext.Update(subscription);
-		await clubDbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 }
