[NoCoverage] Statement mutation
ClubAdministrationService/src/ClubAdministrationService.Infrastructure/RequestPipeline.cs:10:3
 {
 	public static IApplicationBuilder AddInfrastructureMiddleware(this IApplicationBuilder app)
 	{
-		app.UseMiddleware<EventualConsistencyMiddleware>();
+		;
 		return app;
 	}
