[Killed] Negate expression
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:12:7
 {
 	internal Result<bool> AddCourt(Court court)
 	{
-		if (_courtIds.Contains(court.Id))
+		if (!(_courtIds.Contains(court.Id)))
 		{
 			return Result.Failure<bool>(ClubErrors.CourtAlreadyExistsInClub);
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail

[Killed] Block removal mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:13:3
 	internal Result<bool> AddCourt(Court court)
 	{
 		if (_courtIds.Contains(court.Id))
-		{
-			return Result.Failure<bool>(ClubErrors.CourtAlreadyExistsInClub);
-		}
+		{}
 
 		if (_maxCourtCapacity <= _courtIds.Count)
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail

[Killed] Equality mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:17:7
 			return Result.Failure<bool>(ClubErrors.CourtAlreadyExistsInClub);
 		}
 
-		if (_maxCourtCapacity <= _courtIds.Count)
+		if (_maxCourtCapacity < _courtIds.Count)
 		{
 			return Result.Failure<bool>(ClubErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Negate expression
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:17:7
 			return Result.Failure<bool>(ClubErrors.CourtAlreadyExistsInClub);
 		}
 
-		if (_maxCourtCapacity <= _courtIds.Count)
+		if (!(_maxCourtCapacity <= _courtIds.Count))
 		{
 			return Result.Failure<bool>(ClubErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail

[Killed] Block removal mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:18:3
 		}
 
 		if (_maxCourtCapacity <= _courtIds.Count)
-		{
-			return Result.Failure<bool>(ClubErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
-		}
+		{}
 
 		_courtIds.Add(court.Id);
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Statement mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:22:3
 			return Result.Failure<bool>(ClubErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
 		}
 
-		_courtIds.Add(court.Id);
+		;
 
 		DomainEvents.Add(new CourtAddedToClubEvent(this, court));
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail

[Survived] Statement mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:24:3
 
 		_courtIds.Add(court.Id);
 
-		DomainEvents.Add(new CourtAddedToClubEvent(this, court));
+		;
 
 		return Result.Success(true);

[Survived] Boolean mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:26:25
 
 		DomainEvents.Add(new CourtAddedToClubEvent(this, court));
 
-		return Result.Success(true);
+		return Result.Success(false);
 	}
 

[NoCoverage] Negate expression
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:31:7
 
 	internal Result<bool> AddInstructor(Guid instructorId)
 	{
-		if (_instructorIds.Contains(instructorId))
+		if (!(_instructorIds.Contains(instructorId)))
 		{
 			return Result.Failure<bool>(Error.Conflict("", "Instructor already added to club"));

[NoCoverage] String mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:33:47
 	{
 		if (_instructorIds.Contains(instructorId))
 		{
-			return Result.Failure<bool>(Error.Conflict("", "Instructor already added to club"));
+			return Result.Failure<bool>(Error.Conflict("Stryker was here!", "Instructor already added to club"));
 		}
 

[NoCoverage] Statement mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:36:3
 			return Result.Failure<bool>(Error.Conflict("", "Instructor already added to club"));
 		}
 
-		_instructorIds.Add(instructorId);
+		;
 
 		return Result.Success(true);

[NoCoverage] Statement mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:43:3
 
 	internal void RemoveCourt(Guid courtId)
 	{
-		_courtIds.Remove(courtId);
+		;
 		DomainEvents.Add(new CourtRemovedFromClubEvent(this, courtId));
 	}

[NoCoverage] Statement mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:44:3
 	internal void RemoveCourt(Guid courtId)
 	{
 		_courtIds.Remove(courtId);
-		DomainEvents.Add(new CourtRemovedFromClubEvent(this, courtId));
+		;
 	}
 

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:48:2
 	}
 
 	internal bool HasInstructor(Guid instructorId)
-	{
-		return _instructorIds.Contains(instructorId);
-	}
+	{}
 
 	internal bool HasCourt(Guid courtId)

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Behavior.cs:53:2
 	}
 
 	internal bool HasCourt(Guid courtId)
-	{
-		return _courtIds.Contains(courtId);
-	}
+	{}
 }
 
