[Survived] Null coalescing mutation (remove left)
src/ClubAdministrationService.Domain/ClubAggregate/Club.Data.cs:13:29
 	internal Club(string name,
 				int maxCourtCapacity,
 				Guid subscriptionId,
-				Guid? id = null) : base(id ?? Guid.CreateVersion7())
+				Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		Name = name;

[Killed] Block removal mutation
src/ClubAdministrationService.Domain/ClubAggregate/Club.Data.cs:14:2
 				int maxCourtCapacity,
 				Guid subscriptionId,
 				Guid? id = null) : base(id ?? Guid.CreateVersion7())
-	{
-		Name = name;
-		SubscriptionId = subscriptionId;
-		_maxCourtCapacity = maxCourtCapacity;
-	}
+	{}
 
 	private Club()
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail
