[Survived] Null coalescing mutation (remove left)
src/ClubAdministrationService.Domain/CourtAggregate/Court.cs:10:30
 	internal Court(string name,
 					Guid clubId,
 					int maxDailySessions,
-					Guid? id = null) : base(id ?? Guid.NewGuid())
+					Guid? id = null) : base(Guid.NewGuid())
 	{
 		Name = name;

[Survived] Block removal mutation
src/ClubAdministrationService.Domain/CourtAggregate/Court.cs:11:2
 					Guid clubId,
 					int maxDailySessions,
 					Guid? id = null) : base(id ?? Guid.NewGuid())
-	{
-		Name = name;
-		ClubId = clubId;
-		MaxDailySessions = maxDailySessions;
-	}
+	{}
 
 	public string Name { get; } = null!;
