[Killed] Negate expression
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:12:7
 {
 	internal Result<bool> AddClub(Club club)
 	{
-		if (_clubIds.Contains(club.Id))
+		if (!(_clubIds.Contains(club.Id)))
 		{
 			return Result.Failure<bool>(Error.Failure("", "Club already exists"));
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail

[NoCoverage] String mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:14:46
 	{
 		if (_clubIds.Contains(club.Id))
 		{
-			return Result.Failure<bool>(Error.Failure("", "Club already exists"));
+			return Result.Failure<bool>(Error.Failure("Stryker was here!", "Club already exists"));
 		}
 

[Killed] Negate expression
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:17:7
 			return Result.Failure<bool>(Error.Failure("", "Club already exists"));
 		}
 
-		if (_maxCourtsAllowed <= _clubIds.Count)
+		if (!(_maxCourtsAllowed <= _clubIds.Count))
 		{
 			return Result.Failure<bool>(SubscriptionErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Equality mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:17:7
 			return Result.Failure<bool>(Error.Failure("", "Club already exists"));
 		}
 
-		if (_maxCourtsAllowed <= _clubIds.Count)
+		if (_maxCourtsAllowed < _clubIds.Count)
 		{
 			return Result.Failure<bool>(SubscriptionErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Block removal mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:18:3
 		}
 
 		if (_maxCourtsAllowed <= _clubIds.Count)
-		{
-			return Result.Failure<bool>(SubscriptionErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
-		}
+		{}
 
 		_clubIds.Add(club.Id);
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Statement mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:22:3
 			return Result.Failure<bool>(SubscriptionErrors.NumberOfCourtsCannotExceedSubscriptionLimit);
 		}
 
-		_clubIds.Add(club.Id);
+		;
 
 		DomainEvents.Add(new ClubAddedToSubscriptionEvent(this,
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail

[Survived] Statement mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:24:3
 
 		_clubIds.Add(club.Id);
 
-		DomainEvents.Add(new ClubAddedToSubscriptionEvent(this,
-														club)); // consider usingsome fake puslisher or something - such that you can use that for your integation test setup and assert that an integartion event was raised
+		; // consider usingsome fake puslisher or something - such that you can use that for your integation test setup and assert that an integartion event was raised
 		return Result.Success(true);
 	}

[Survived] Boolean mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:26:25
 
 		DomainEvents.Add(new ClubAddedToSubscriptionEvent(this,
 														club)); // consider usingsome fake puslisher or something - such that you can use that for your integation test setup and assert that an integartion event was raised
-		return Result.Success(true);
+		return Result.Success(false);
 	}
 

[Survived] Block removal mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:30:2
 	}
 
 	internal int GetMaxCourtsAllowed()
-	{
-		return SubscriptionType.Name switch
-		{
-			nameof(SubscriptionType.Free) => 1,
-			nameof(SubscriptionType.Starter) => 3,
-			nameof(SubscriptionType.Pro) => int.MaxValue,
-			_ => throw new InvalidOperationException()
-		};
-	}
+	{}
 
 	public int GetMaxDailySessionsAllowed()

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:41:2
 	}
 
 	public int GetMaxDailySessionsAllowed()
-	{
-		return SubscriptionType.Name switch
-		{
-			nameof(SubscriptionType.Free) => 4,
-			nameof(SubscriptionType.Starter) => int.MaxValue,
-			nameof(SubscriptionType.Pro) => int.MaxValue,
-			_ => throw new InvalidOperationException()
-		};
-	}
+	{}
 
 	public bool HasClub(Guid clubId)

[NoCoverage] Block removal mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Behavior.cs:52:2
 	}
 
 	public bool HasClub(Guid clubId)
-	{
-		return _clubIds.Contains(clubId);
-	}
+	{}
 }
 
