[Survived] Null coalescing mutation (remove left)
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Data.cs:9:31
 	private readonly int _maxCourtsAllowed;
 
 	internal Subscription(SubscriptionType subscriptionType,
-						Guid? id = null) : base(id ?? Guid.CreateVersion7())
+						Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		SubscriptionType = subscriptionType;

[Killed] Block removal mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/Subscription.Data.cs:10:2
 
 	internal Subscription(SubscriptionType subscriptionType,
 						Guid? id = null) : base(id ?? Guid.CreateVersion7())
-	{
-		SubscriptionType = subscriptionType;
-		_maxCourtsAllowed = GetMaxCourtsAllowed();
-	}
+	{}
 
 	private Subscription()
killedBy: ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail
