[Killed] String mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/SubscriptionErrors.cs:8:17
 internal static class SubscriptionErrors
 {
 	internal static readonly Error NumberOfCourtsCannotExceedSubscriptionLimit =
-		Error.Failure("Subscription.NumberOfCourtsCannotExceedSubscriptionLimit",
+		Error.Failure("",
 					"A subscription cannot have more courts than the subscription allows");
 }
killedBy: ClubAdministrationService.Tests.Integration.Clubs.GetClubTests.Success; ClubAdministrationService.Tests.Integration.Clubs.GetClubTests.When_ClubIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.GetClubTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned

[Killed] String mutation
src/ClubAdministrationService.Domain/SubscriptionAggregate/SubscriptionErrors.cs:9:6
 {
 	internal static readonly Error NumberOfCourtsCannotExceedSubscriptionLimit =
 		Error.Failure("Subscription.NumberOfCourtsCannotExceedSubscriptionLimit",
-					"A subscription cannot have more courts than the subscription allows");
+					"");
 }
 
killedBy: ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_SubscriptionIdIsInvalid_Then_ErrorIsReturned; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.Success; ClubAdministrationService.Tests.Integration.Clubs.ListClubsTests.When_NoClubsExistForSubscription_Then_EmptyResponseIsReturned
