[Killed] Logical mutation
serve-sync/SharedKernel/Results/Result.cs:11:30
 {
 	protected Result(bool isSuccess, Error error)
 	{
-		var hasInvalidErrorState = isSuccess && error != Error.None || !isSuccess && error == Error.None;
+		var hasInvalidErrorState = isSuccess || error != Error.None || !isSuccess && error == Error.None;
 
 		if (hasInvalidErrorState)
killedBy: ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenMoreThanSubscriptionAllows_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.ClubAggregate.ClubTests.AddCourt_WhenSameCourtIsAddedTwice_ShouldFail; ClubAdministrationService.Tests.Unit.Domain.SubscriptionAggregate.SubscriptionTests.AddClub_WhenMoreThanSubscriptionAllows_ShouldFail
