[NoCoverage] Statement mutation
ClubAdministrationService.Application/Admins/IntegrationEvents/AdminProfileCreatedEventHandler.cs:15:3
 	{
 		Admin admin = new(notification.UserId, id: notification.AdminId);
 
-		await adminsRepository.AddAdminAsync(admin, cancellationToken);
+		;
 	}
 }
