[NoCoverage] Equality mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:19:7
 		Subscription? subscription =
 			await subscriptionsRepository.GetByIdAsync(command.SubscriptionId, cancellationToken);
 
-		if (subscription is null)
+		if (subscription is not null)
 		{
 			return Result.Failure(Error.NotFound("SubscriptionNotFound", "Subscription not found"));

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:24:7
 			return Result.Failure(Error.NotFound("SubscriptionNotFound", "Subscription not found"));
 		}
 
-		if (!subscription.HasClub(command.ClubId))
+		if (subscription.HasClub(command.ClubId))
 		{
 			return Result.Failure(Error.NotFound("ClubNotFound", "Club not found"));

[NoCoverage] Equality mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:31:7
 
 		Club? club = await clubsRepository.GetByIdAsync(command.ClubId, cancellationToken);
 
-		if (club is null)
+		if (club is not null)
 		{
 			return Result.Failure(Error.NotFound("ClubNotFound", "Club not found"));

[NoCoverage] String mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:33:41
 
 		if (club is null)
 		{
-			return Result.Failure(Error.NotFound("ClubNotFound", "Club not found"));
+			return Result.Failure(Error.NotFound("", "Club not found"));
 		}
 

[NoCoverage] String mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:33:57
 
 		if (club is null)
 		{
-			return Result.Failure(Error.NotFound("ClubNotFound", "Club not found"));
+			return Result.Failure(Error.NotFound("ClubNotFound", ""));
 		}
 

[NoCoverage] Negate expression
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:38:7
 
 		Result<bool> addInstructorResult = club.AddInstructor(command.InstructorId);
 
-		if (addInstructorResult.IsFailure)
+		if (!(addInstructorResult.IsFailure))
 		{
 			return Result.Failure(addInstructorResult.Error);

[NoCoverage] Block removal mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:39:3
 		Result<bool> addInstructorResult = club.AddInstructor(command.InstructorId);
 
 		if (addInstructorResult.IsFailure)
-		{
-			return Result.Failure(addInstructorResult.Error);
-		}
+		{}
 
 		await clubsRepository.UpdateAsync(club, cancellationToken);

[NoCoverage] Statement mutation
Clubs/Commands/AddInstructor/AddInstructorCommandHandler.cs:43:3
 			return Result.Failure(addInstructorResult.Error);
 		}
 
-		await clubsRepository.UpdateAsync(club, cancellationToken);
+		;
 
 		return Result.Success(true);
