[NoCoverage] Negate expression
Clubs/Commands/CreateClub/CreateClubCommandHandler.cs:30:7
 
 		Result<bool> addClubResult = subscription.AddClub(club);
 
-		if (addClubResult.IsFailure)
+		if (!(addClubResult.IsFailure))
 		{
 			return Result.Failure<Club>(addClubResult.Error);

[NoCoverage] Block removal mutation
Clubs/Commands/CreateClub/CreateClubCommandHandler.cs:31:3
 		Result<bool> addClubResult = subscription.AddClub(club);
 
 		if (addClubResult.IsFailure)
-		{
-			return Result.Failure<Club>(addClubResult.Error);
-		}
+		{}
 
 #pragma warning disable CA1848

[NoCoverage] Statement mutation
Clubs/Commands/CreateClub/CreateClubCommandHandler.cs:36:3
 		}
 
 #pragma warning disable CA1848
-		logger.LogInformation("Club created: {Name}", club.Name);
+		;
 #pragma warning restore CA1848
 

[NoCoverage] Statement mutation
Clubs/Commands/CreateClub/CreateClubCommandHandler.cs:39:3
 		logger.LogInformation("Club created: {Name}", club.Name);
 #pragma warning restore CA1848
 
-		await subscriptionsRepository.UpdateAsync(subscription, cancellationToken);
+		;
 
 		return Result.Success<Club>(club);
