[NoCoverage] Statement mutation
ClubAdministrationService.Application/Clubs/Events/ClubAddedToSubscriptionEventHandler.cs:12:3
 {
 	public async ValueTask Handle(ClubAddedToSubscriptionEvent notification, CancellationToken cancellationToken)
 	{
-		await clubsRepository.AddClubAsync(notification.Club, cancellationToken);
+		;
 	}
 }
