[NoCoverage] Statement mutation
ClubAdministrationService.Application/Clubs/IntegrationEvents/SessionScheduledEventHandler.cs:17:4
 
 		if (club is null)
 		{
-			throw new InvalidOperationException($"No club found with id {notification.CourtId}");
+			;
 		}
 

[NoCoverage] Statement mutation
ClubAdministrationService.Application/Clubs/IntegrationEvents/SessionScheduledEventHandler.cs:20:3
 			throw new InvalidOperationException($"No club found with id {notification.CourtId}");
 		}
 
-		club.AddInstructor(notification.InstructorId);
+		;
 	}
 }
