[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Clubs/Queries/GetClub/GetClubQueryHandler.cs:15:7
 	public async ValueTask<Result<Club>> Handle(GetClubQuery request, CancellationToken cancellationToken)
 	{
 		var subscriptionExist = await subscriptionsRepository.ExistsAsync(request.SubscriptionId, cancellationToken);
-		if (!subscriptionExist)
+		if (subscriptionExist)
 		{
 			return Result.Failure<Club>(Error.NotFound(code: "SubscriptionNotFound",

[NoCoverage] String mutation
Clubs/Queries/GetClub/GetClubQueryHandler.cs:17:53
 		var subscriptionExist = await subscriptionsRepository.ExistsAsync(request.SubscriptionId, cancellationToken);
 		if (!subscriptionExist)
 		{
-			return Result.Failure<Club>(Error.NotFound(code: "SubscriptionNotFound",
+			return Result.Failure<Club>(Error.NotFound(code: "",
 													   description: "Subscription not found"));
 		}

[NoCoverage] String mutation
Clubs/Queries/GetClub/GetClubQueryHandler.cs:18:30
 		if (!subscriptionExist)
 		{
 			return Result.Failure<Club>(Error.NotFound(code: "SubscriptionNotFound",
-													   description: "Subscription not found"));
+													   description: ""));
 		}
 

[NoCoverage] Equality mutation
Clubs/Queries/GetClub/GetClubQueryHandler.cs:22:7
 		}
 
 		Club? club = await clubsRepository.GetByIdAsync(request.ClubId, cancellationToken);
-		if (club is null)
+		if (club is not null)
 		{
 			return Result.Failure<Club>(Error.NotFound(code: "ClubNotFound", description: "Club not found"));
