[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Clubs/Queries/ListClubs/ListClubsQueryHandler.cs:16:7
 	{
 		var subscriptionExists = await subscriptionsRepository.ExistsAsync(query.SubscriptionId, cancellationToken);
 
-		if (!subscriptionExists)
+		if (subscriptionExists)
 		{
 			return Result.Failure<List<Club>>(Error.NotFound("SubscriptionNotFound", "Subscription not found"));

[NoCoverage] String mutation
Clubs/Queries/ListClubs/ListClubsQueryHandler.cs:18:53
 
 		if (!subscriptionExists)
 		{
-			return Result.Failure<List<Club>>(Error.NotFound("SubscriptionNotFound", "Subscription not found"));
+			return Result.Failure<List<Club>>(Error.NotFound("", "Subscription not found"));
 		}
 
