[NoCoverage] String mutation
Courts/Commands/CreateCourt/CreateCourtCommandHandler.cs:32:48
 
 		if (subscription is null)
 		{
-			return Result.Failure<Court>(Error.NotFound("SubscriptionNotFound",
+			return Result.Failure<Court>(Error.NotFound("",
 														"Subscription not found"));
 		}

[NoCoverage] Negate expression
Courts/Commands/CreateCourt/CreateCourtCommandHandler.cs:42:7
 
 		Result<bool> addCourtResult = club.AddCourt(court);
 
-		if (addCourtResult.IsFailure)
+		if (!(addCourtResult.IsFailure))
 		{
 			return Result.Failure<Court>(addCourtResult.Error);

[NoCoverage] Block removal mutation
Courts/Commands/CreateCourt/CreateCourtCommandHandler.cs:43:3
 		Result<bool> addCourtResult = club.AddCourt(court);
 
 		if (addCourtResult.IsFailure)
-		{
-			return Result.Failure<Court>(addCourtResult.Error);
-		}
+		{}
 
 		await clubsRepository.UpdateAsync(club, cancellationToken);
