[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
Courts/Commands/DeleteCourt/DeleteCourtCommandHandler.cs:20:7
 			return Result.Failure(Error.NotFound("ClubNotFound", "Club not found"));
 		}
 
-		if (!club.HasCourt(command.CourtId))
+		if (club.HasCourt(command.CourtId))
 		{
 			return Result.Failure(Error.NotFound("CourtNotFound", "Court not found"));

[NoCoverage] String mutation
Courts/Commands/DeleteCourt/DeleteCourtCommandHandler.cs:22:41
 
 		if (!club.HasCourt(command.CourtId))
 		{
-			return Result.Failure(Error.NotFound("CourtNotFound", "Court not found"));
+			return Result.Failure(Error.NotFound("", "Court not found"));
 		}
 

[NoCoverage] Statement mutation
Courts/Commands/DeleteCourt/DeleteCourtCommandHandler.cs:25:3
 			return Result.Failure(Error.NotFound("CourtNotFound", "Court not found"));
 		}
 
-		club.RemoveCourt(command.CourtId);
+		;
 
 		await clubsRepository.UpdateAsync(club, cancellationToken);
