[NoCoverage] Equality mutation
Subscriptions/Commands/CreateSubscription/CreateSubscriptionCommandHandler.cs:18:7
 	{
 		Admin? admin = await adminsRepository.GetByIdAsync(command.AdminId, cancellationToken);
 
-		if (admin is null)
+		if (admin is not null)
 		{
 			return Result.Failure<Subscription>(Error.NotFound("AdminNotFound", "Admin not found"));

[NoCoverage] Equality mutation
Subscriptions/Commands/CreateSubscription/CreateSubscriptionCommandHandler.cs:23:7
 			return Result.Failure<Subscription>(Error.NotFound("AdminNotFound", "Admin not found"));
 		}
 
-		if (admin.SubscriptionId is not null)
+		if (admin.SubscriptionId is null)
 		{
 			return Result.Failure<Subscription>(Error.Conflict("AdminAlreadyHasActiveSubscription",

[NoCoverage] Statement mutation
Subscriptions/Commands/CreateSubscription/CreateSubscriptionCommandHandler.cs:30:3
 		}
 
 		Subscription subscription = new(command.SubscriptionType, command.AdminId);
-		admin.SetSubscription(subscription);
+		;
 
 		await adminsRepository.UpdateAsync(admin, cancellationToken);

[NoCoverage] Statement mutation
Subscriptions/Commands/CreateSubscription/CreateSubscriptionCommandHandler.cs:32:3
 		Subscription subscription = new(command.SubscriptionType, command.AdminId);
 		admin.SetSubscription(subscription);
 
-		await adminsRepository.UpdateAsync(admin, cancellationToken);
+		;
 
 		return subscription;
