[NoCoverage] Statement mutation
ClubAdministrationService.Application/Subscriptions/Events/SubscriptionSetEventHandler.cs:12:3
 {
 	public async ValueTask Handle(SubscriptionSetEvent notification, CancellationToken cancellationToken)
 	{
-		await subscriptionsRepository.AddSubscriptionAsync(notification.Subscription, cancellationToken);
+		;
 	}
 }
