[NoCoverage] Block removal mutation
Subscriptions/Queries/ListSubscriptions/ListSubscriptionsQueryHandler.cs:13:2
 {
 	public async ValueTask<Result<List<Subscription>>> Handle(ListSubscriptionsQuery request,
 															CancellationToken cancellationToken)
-	{
-		return await subscriptionsRepository.ListAsync(cancellationToken);
-	}
+	{}
 }
 
