[Survived] Negate expression
SessionBookingService.WebApi/Endpoints/Clubs/ListSessions.cs:28:11
 						Result<List<SessionCategory>> categoriesToDomainResult =
 							SessionCategoryUtils.ToDomain(categories);
 
-						if (categoriesToDomainResult.IsFailure)
+						if (!(categoriesToDomainResult.IsFailure))
 						{
 							IResult problem = ProblemDetailsMapper.Problem([categoriesToDomainResult.Error]);

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Clubs/ListSessions.cs:29:7
 							SessionCategoryUtils.ToDomain(categories);
 
 						if (categoriesToDomainResult.IsFailure)
-						{
-							IResult problem = ProblemDetailsMapper.Problem([categoriesToDomainResult.Error]);
-							return problem;
-						}
+						{}
 
 						ListSessionsQuery query =

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Clubs/ListSessions.cs:65:21
 					})
 			.WithTags(Tags.Clubs)
 			.WithSummary("List sessions for a club")
-			.WithDescription("List sessions for a club")
+			.WithDescription("")
 			.Produces<SessionResponse>();
 	}
