[Survived] Statement mutation
SessionBookingService.WebApi/Endpoints/Courts/GetCourt.cs:14:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("clubs/{clubId:Guid}/courts/{courtId:Guid}",
-					async (Guid clubId,
-							Guid courtId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						GetCourtQuery query = new(clubId, courtId);
-
-						Result<Court> getRoomResult = await sender.Send(query, cancellationToken);
-
-						IResult response = getRoomResult.Match(c => Results.Ok(new CourtResponse(c.Id, c.Name)),
-																e => ProblemDetailsMapper.Problem([e.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Courts)
-			.WithName("GetCourt")
-			.WithSummary("Get court")
-			.WithDescription("Get court for specific clubId")
-			.Produces<CourtResponse>();
+		;
 	}
 }

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Courts/GetCourt.cs:19:6
 							Guid courtId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						GetCourtQuery query = new(clubId, courtId);
-
-						Result<Court> getRoomResult = await sender.Send(query, cancellationToken);
-
-						IResult response = getRoomResult.Match(c => Results.Ok(new CourtResponse(c.Id, c.Name)),
-																e => ProblemDetailsMapper.Problem([e.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Courts)
 			.WithName("GetCourt")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Courts/GetCourt.cs:32:21
 			.WithTags(Tags.Courts)
 			.WithName("GetCourt")
 			.WithSummary("Get court")
-			.WithDescription("Get court for specific clubId")
+			.WithDescription("")
 			.Produces<CourtResponse>();
 	}
