[Survived] Statement mutation
SessionBookingService.WebApi/Endpoints/Courts/ListCourts.cs:14:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("clubs/{clubId:Guid}/courts",
-					async (Guid clubId, ISender sender, CancellationToken cancellationToken) =>
-					{
-						ListCourtsQuery query = new(clubId);
-
-						Result<List<Court>> listCourtsResult = await sender.Send(query, cancellationToken);
-
-						IResult response =
-							listCourtsResult.Match(c =>
-														Results.Ok(c.ConvertAll(cc => new CourtResponse(cc.Id,
-																										cc.Name))),
-													f => ProblemDetailsMapper.Problem([f.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Courts)
-			.WithName("List Courts")
-			.WithSummary("Lists court for a given club")
-			.WithDescription("List court for a specified club id")
-			.Produces<CourtResponse>();
+		;
 	}
 }

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Courts/ListCourts.cs:16:6
 	{
 		app.MapGet("clubs/{clubId:Guid}/courts",
 					async (Guid clubId, ISender sender, CancellationToken cancellationToken) =>
-					{
-						ListCourtsQuery query = new(clubId);
-
-						Result<List<Court>> listCourtsResult = await sender.Send(query, cancellationToken);
-
-						IResult response =
-							listCourtsResult.Match(c =>
-														Results.Ok(c.ConvertAll(cc => new CourtResponse(cc.Id,
-																										cc.Name))),
-													f => ProblemDetailsMapper.Problem([f.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Courts)
 			.WithName("List Courts")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Courts/ListCourts.cs:30:14
 						return response;
 					})
 			.WithTags(Tags.Courts)
-			.WithName("List Courts")
+			.WithName("")
 			.WithSummary("Lists court for a given club")
 			.WithDescription("List court for a specified club id")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Courts/ListCourts.cs:31:17
 					})
 			.WithTags(Tags.Courts)
 			.WithName("List Courts")
-			.WithSummary("Lists court for a given club")
+			.WithSummary("")
 			.WithDescription("List court for a specified club id")
 			.Produces<CourtResponse>();
