[Survived] Statement mutation
SessionBookingService.WebApi/Endpoints/Players/CancelBooking.cs:12:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapDelete("{playerId:guid}/sessions/{sessionId:guid}/booking",
-					async (Guid playerId,
-							Guid sessionId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						CancelBookingCommand command = new(playerId, sessionId);
-
-						Result cancelBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = cancelBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Players)
-			.WithSummary("Cancel booking")
-			.WithDescription("Cancel booking for a session for a player");
+		;
 	}
 }

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Players/CancelBooking.cs:12:17
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapDelete("{playerId:guid}/sessions/{sessionId:guid}/booking",
+		app.MapDelete("",
 					async (Guid playerId,
 							Guid sessionId,

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Players/CancelBooking.cs:17:6
 							Guid sessionId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						CancelBookingCommand command = new(playerId, sessionId);
-
-						Result cancelBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = cancelBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Players)
 			.WithSummary("Cancel booking")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Players/CancelBooking.cs:29:21
 					})
 			.WithTags(Tags.Players)
 			.WithSummary("Cancel booking")
-			.WithDescription("Cancel booking for a session for a player");
+			.WithDescription("");
 	}
 }
