[Survived] Statement mutation
SessionBookingService.WebApi/Endpoints/Players/CreateBooking.cs:12:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapPost("{playerId:guid}/sessions/{sessionId:guid}/booking",
-					async (Guid playerId,
-							Guid sessionId,
-							ISender sender,
-							CancellationToken cancellationToken) =>
-					{
-						CreateBookingCommand command = new(sessionId, playerId);
-
-						Result<Guid> createBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = createBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
-			.WithTags(Tags.Players)
-			.WithSummary("Create booking")
-			.WithDescription("Create booking for a player");
+		;
 	}
 }

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Players/CreateBooking.cs:17:6
 							Guid sessionId,
 							ISender sender,
 							CancellationToken cancellationToken) =>
-					{
-						CreateBookingCommand command = new(sessionId, playerId);
-
-						Result<Guid> createBookingResult = await sender.Send(command, cancellationToken);
-
-						IResult response = createBookingResult.Match(Results.NoContent,
-																	err => ProblemDetailsMapper.Problem([err.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Players)
 			.WithSummary("Create booking")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Players/CreateBooking.cs:28:17
 						return response;
 					})
 			.WithTags(Tags.Players)
-			.WithSummary("Create booking")
+			.WithSummary("")
 			.WithDescription("Create booking for a player");
 	}

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Players/CreateBooking.cs:29:21
 					})
 			.WithTags(Tags.Players)
 			.WithSummary("Create booking")
-			.WithDescription("Create booking for a player");
+			.WithDescription("");
 	}
 }
