[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Players/ListPlayers.cs:55:21
 					})
 			.WithTags(Tags.Players)
 			.WithSummary("List players for a session")
-			.WithDescription("List players for a session")
+			.WithDescription("")
 			.Produces<SessionResponse>();
 	}
