[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Sessions/GetSession.cs:14:14
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("courts/{courtId:guid}/sessions/{sessionId:guid}",
+		app.MapGet("",
 					async (Guid courtId, Guid sessionId, ISender sender, CancellationToken cancellationToken) =>
 					{

[Survived] Block removal mutation
SessionBookingService.WebApi/Endpoints/Sessions/GetSession.cs:16:6
 	{
 		app.MapGet("courts/{courtId:guid}/sessions/{sessionId:guid}",
 					async (Guid courtId, Guid sessionId, ISender sender, CancellationToken cancellationToken) =>
-					{
-						GetSessionQuery query = new(courtId, sessionId);
-
-						Result<Session> getSessionResult = await sender.Send(query, cancellationToken);
-
-						IResult response = getSessionResult.Match(s => Results.Ok(new SessionResponse(s.Id,
-																									s.Name,
-																									s.Description,
-																									s.NumPlayers,
-																									s.MaxPlayerCapacity,
-																									s.Date
-																									.ToDateTime(s.Time
-																												.Start),
-																									s.Date
-																									.ToDateTime(s.Time
-																												.End),
-																									s.Categories
-																									.Select(category =>
-																												category
-																													.Name)
-																									.ToList())),
-																e => ProblemDetailsMapper.Problem([e.Error]));
-
-						return response;
-					})
+					{})
 			.WithTags(Tags.Sessions)
 			.WithName("GetSession")

[Survived] String mutation
SessionBookingService.WebApi/Endpoints/Sessions/GetSession.cs:43:17
 					})
 			.WithTags(Tags.Sessions)
 			.WithName("GetSession")
-			.WithSummary("Get session for court")
+			.WithSummary("")
 			.WithDescription("Get session for courtId")
 			.Produces<SessionResponse>();
