[Survived] Statement mutation
src/SessionBookingService.WebApi/Extensions/MediatorExtensions.cs:11:3
 {
 	internal static IServiceCollection AddMediatorServices(this IServiceCollection services)
 	{
-		services.AddMediator(opts =>
-		{
-			opts.ServiceLifetime = ServiceLifetime.Scoped;
-			opts.GenerateTypesAsInternal = true;
-			opts.NotificationPublisherType = typeof(ForeachAwaitPublisher);
-			opts.CachingMode = CachingMode.Eager;
-			opts.Assemblies =
-			[
-				typeof(CourtAddedEventHandler).Assembly
-			];
-		});
+		;
 
 		return services;

[Survived] Boolean mutation
src/SessionBookingService.WebApi/Extensions/MediatorExtensions.cs:14:35
 		services.AddMediator(opts =>
 		{
 			opts.ServiceLifetime = ServiceLifetime.Scoped;
-			opts.GenerateTypesAsInternal = true;
+			opts.GenerateTypesAsInternal = false;
 			opts.NotificationPublisherType = typeof(ForeachAwaitPublisher);
 			opts.CachingMode = CachingMode.Eager;
