[Survived] String mutation
src/SessionBookingService.WebApi/Infrastructure/ProblemDetailsMapper.cs:84:26
 		{
 			ErrorType.Validation => "https://tools.ietf.org/html/rfc7231#section-6.5.1",
 			ErrorType.Problem => "https://tools.ietf.org/html/rfc7231#section-6.5.1",
-			ErrorType.NotFound => "https://tools.ietf.org/html/rfc7231#section-6.5.4",
+			ErrorType.NotFound => "",
 			ErrorType.Conflict => "https://tools.ietf.org/html/rfc7231#section-6.5.8",
 			_ => "https://tools.ietf.org/html/rfc7231#section-6.6.1"
