[Survived] String mutation
SessionBookingService/src/SessionBookingService.WebApi/Program.cs:38:43
 			opts.ReportApiVersions = true;
 			opts.AssumeDefaultVersionWhenUnspecified = true;
 			opts.ApiVersionReader = ApiVersionReader.Combine(new UrlSegmentApiVersionReader(),
-															new HeaderApiVersionReader("X-Api-Version"));
+															new HeaderApiVersionReader(""));
 		})
 		.AddApiExplorer(opts =>

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.WebApi/Program.cs:77:2
 {
 	using IServiceScope scope = app.Services.CreateScope();
 	SessionBookingDbContext dbContext = scope.ServiceProvider.GetRequiredService<SessionBookingDbContext>();
-	await dbContext.Database.MigrateAsync();
+	;
 }
 
