[Survived] Equality mutation
src/SessionBookingService.WebApi/Utils/SessionCategoryUtils.cs:10:7
 {
 	public static Result<List<SessionCategory>> ToDomain(ICollection<string>? categories)
 	{
-		if (categories is null)
+		if (categories is not null)
 		{
 			return new List<SessionCategory>();

[Survived] Block removal mutation
src/SessionBookingService.WebApi/Utils/SessionCategoryUtils.cs:11:3
 	public static Result<List<SessionCategory>> ToDomain(ICollection<string>? categories)
 	{
 		if (categories is null)
-		{
-			return new List<SessionCategory>();
-		}
+		{}
 
 		List<SessionCategory> parsedCategories = categories

[Survived] Equality mutation
src/SessionBookingService.WebApi/Utils/SessionCategoryUtils.cs:21:32
 															out SessionCategory? parsedCategory)
 															? parsedCategory
 															: null)
-												.Where(category => category is not null)
+												.Where(category => category is null)
 												.ToList()!;
 
