[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:15:3
 	{
 		builder.HasKey(r => r.Id);
 
-		builder.Property(r => r.Id).ValueGeneratedNever();
+		;
 
 		builder.Property("_maxDailySessions").HasColumnName("MaxDailySessions");

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:17:3
 
 		builder.Property(r => r.Id).ValueGeneratedNever();
 
-		builder.Property("_maxDailySessions").HasColumnName("MaxDailySessions");
+		;
 
 		builder.Property<List<Guid>>("_sessionIds").HasColumnName("SessionIds").HasListOfIdsConverter();

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:17:20
 
 		builder.Property(r => r.Id).ValueGeneratedNever();
 
-		builder.Property("_maxDailySessions").HasColumnName("MaxDailySessions");
+		builder.Property("").HasColumnName("MaxDailySessions");
 
 		builder.Property<List<Guid>>("_sessionIds").HasColumnName("SessionIds").HasListOfIdsConverter();

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:19:3
 
 		builder.Property("_maxDailySessions").HasColumnName("MaxDailySessions");
 
-		builder.Property<List<Guid>>("_sessionIds").HasColumnName("SessionIds").HasListOfIdsConverter();
+		;
 
 		builder.OwnsOne<Schedule>("_schedule",

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:19:32
 
 		builder.Property("_maxDailySessions").HasColumnName("MaxDailySessions");
 
-		builder.Property<List<Guid>>("_sessionIds").HasColumnName("SessionIds").HasListOfIdsConverter();
+		builder.Property<List<Guid>>("").HasColumnName("SessionIds").HasListOfIdsConverter();
 
 		builder.OwnsOne<Schedule>("_schedule",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:21:3
 
 		builder.Property<List<Guid>>("_sessionIds").HasColumnName("SessionIds").HasListOfIdsConverter();
 
-		builder.OwnsOne<Schedule>("_schedule",
-								sb =>
-								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalendar")
-									.HasValueJsonConverter();
-
-									sb.Property(s => s.Id).HasColumnName("ScheduleId");
-								});
+		;
 
 		builder.Property(r => r.Name);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:24:10
 		builder.OwnsOne<Schedule>("_schedule",
 								sb =>
 								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalendar")
-									.HasValueJsonConverter();
+									;
 
 									sb.Property(s => s.Id).HasColumnName("ScheduleId");

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:24:60
 		builder.OwnsOne<Schedule>("_schedule",
 								sb =>
 								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
+									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("")
 									.HasColumnName("ScheduleCalendar")
 									.HasValueJsonConverter();

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:28:10
 									.HasColumnName("ScheduleCalendar")
 									.HasValueJsonConverter();
 
-									sb.Property(s => s.Id).HasColumnName("ScheduleId");
+									;
 								});
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:31:3
 									sb.Property(s => s.Id).HasColumnName("ScheduleId");
 								});
 
-		builder.Property(r => r.Name);
+		;
 		builder.Property(r => r.ClubId);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/CourtConfiguration.cs:32:3
 								});
 
 		builder.Property(r => r.Name);
-		builder.Property(r => r.ClubId);
+		;
 	}
 }
