[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:13:3
 {
 	public void Configure(EntityTypeBuilder<Instructor> builder)
 	{
-		builder.HasKey(t => t.Id);
+		;
 
 		builder.Property(t => t.Id)

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:15:3
 	{
 		builder.HasKey(t => t.Id);
 
-		builder.Property(t => t.Id)
-				.ValueGeneratedNever();
+		;
 
 		builder.Property<List<Guid>>("_sessionIds")

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:18:3
 		builder.Property(t => t.Id)
 				.ValueGeneratedNever();
 
-		builder.Property<List<Guid>>("_sessionIds")
-				.HasListOfIdsConverter()
-				.HasColumnName("SessionIds");
+		;
 
 		builder.Property(t => t.UserId);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:22:3
 				.HasListOfIdsConverter()
 				.HasColumnName("SessionIds");
 
-		builder.Property(t => t.UserId);
+		;
 
 		builder.OwnsOne<Schedule>("_schedule",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:24:3
 
 		builder.Property(t => t.UserId);
 
-		builder.OwnsOne<Schedule>("_schedule",
-								sb =>
-								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalendar")
-									.HasValueJsonConverter();
-
-									sb.Property(s => s.Id)
-									.HasColumnName("ScheduleId");
-								});
+		;
 	}
 }

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:28:25
 								sb =>
 								{
 									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalendar")
+									.HasColumnName("")
 									.HasValueJsonConverter();
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/InstructorConfiguration.cs:31:10
 									.HasColumnName("ScheduleCalendar")
 									.HasValueJsonConverter();
 
-									sb.Property(s => s.Id)
-									.HasColumnName("ScheduleId");
+									;
 								});
 	}
