[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:15:3
 	{
 		builder.HasKey(g => g.Id);
 
-		builder.Property(g => g.Id)
-				.ValueGeneratedNever();
+		;
 
 		builder.OwnsOne<Schedule>("_schedule",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:18:3
 		builder.Property(g => g.Id)
 				.ValueGeneratedNever();
 
-		builder.OwnsOne<Schedule>("_schedule",
-								sb =>
-								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalender")
-									.HasValueJsonConverter();
-
-									sb.Property(s => s.Id).HasColumnName("ScheduleId");
-								});
+		;
 
 		builder.Property<List<Guid>>("_sessionIds")

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:21:10
 		builder.OwnsOne<Schedule>("_schedule",
 								sb =>
 								{
-									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalender")
-									.HasValueJsonConverter();
+									;
 
 									sb.Property(s => s.Id).HasColumnName("ScheduleId");

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:22:25
 								sb =>
 								{
 									sb.Property<Dictionary<DateOnly, List<TimeSlot>>>("_calendar")
-									.HasColumnName("ScheduleCalender")
+									.HasColumnName("")
 									.HasValueJsonConverter();
 

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:25:47
 									.HasColumnName("ScheduleCalender")
 									.HasValueJsonConverter();
 
-									sb.Property(s => s.Id).HasColumnName("ScheduleId");
+									sb.Property(s => s.Id).HasColumnName("");
 								});
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:28:3
 									sb.Property(s => s.Id).HasColumnName("ScheduleId");
 								});
 
-		builder.Property<List<Guid>>("_sessionIds")
-				.HasColumnName("SessionIds")
-				.HasListOfIdsConverter();
+		;
 
 		builder.Property(g => g.UserId);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/PlayerConfiguration.cs:32:3
 				.HasColumnName("SessionIds")
 				.HasListOfIdsConverter();
 
-		builder.Property(g => g.UserId);
+		;
 	}
 }
