[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:16:3
 		builder.Property(g => g.Id)
 				.ValueGeneratedNever();
 
-		builder.Property(s => s.InstructorId);
+		;
 
 		builder.OwnsMany<Booking>("_bookings",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:18:3
 
 		builder.Property(s => s.InstructorId);
 
-		builder.OwnsMany<Booking>("_bookings",
-								b =>
-								{
-									b.ToTable("SessionBookings");
-
-									b.HasKey(r => r.Id);
-
-									b.Property(r => r.Id).ValueGeneratedNever();
-
-									b.WithOwner().HasForeignKey("SessionId");
-
-									b.Property(r => r.PlayerId);
-								});
+		;
 
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:21:10
 		builder.OwnsMany<Booking>("_bookings",
 								b =>
 								{
-									b.ToTable("SessionBookings");
+									;
 
 									b.HasKey(r => r.Id);

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:21:20
 		builder.OwnsMany<Booking>("_bookings",
 								b =>
 								{
-									b.ToTable("SessionBookings");
+									b.ToTable("");
 
 									b.HasKey(r => r.Id);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:23:10
 								{
 									b.ToTable("SessionBookings");
 
-									b.HasKey(r => r.Id);
+									;
 
 									b.Property(r => r.Id).ValueGeneratedNever();

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:25:10
 
 									b.HasKey(r => r.Id);
 
-									b.Property(r => r.Id).ValueGeneratedNever();
+									;
 
 									b.WithOwner().HasForeignKey("SessionId");

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:27:10
 
 									b.Property(r => r.Id).ValueGeneratedNever();
 
-									b.WithOwner().HasForeignKey("SessionId");
+									;
 
 									b.Property(r => r.PlayerId);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:29:10
 
 									b.WithOwner().HasForeignKey("SessionId");
 
-									b.Property(r => r.PlayerId);
+									;
 								});
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:33:3
 								});
 
 
-		builder.OwnsMany(s => s.Categories,
-						cb =>
-						{
-							cb.ToTable("SessionCategories");
-
-							cb.WithOwner().HasForeignKey("SessionId");
-							cb.HasKey("Id");
-
-							cb.Property(c => c.Name);
-							cb.Property(c => c.Value);
-						})
-				.Metadata
-				.SetPropertyAccessMode(PropertyAccessMode.Field);
+		;
 
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:36:8
 		builder.OwnsMany(s => s.Categories,
 						cb =>
 						{
-							cb.ToTable("SessionCategories");
+							;
 
 							cb.WithOwner().HasForeignKey("SessionId");

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:38:8
 						{
 							cb.ToTable("SessionCategories");
 
-							cb.WithOwner().HasForeignKey("SessionId");
+							;
 							cb.HasKey("Id");
 

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:38:37
 						{
 							cb.ToTable("SessionCategories");
 
-							cb.WithOwner().HasForeignKey("SessionId");
+							cb.WithOwner().HasForeignKey("");
 							cb.HasKey("Id");
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:39:8
 							cb.ToTable("SessionCategories");
 
 							cb.WithOwner().HasForeignKey("SessionId");
-							cb.HasKey("Id");
+							;
 
 							cb.Property(c => c.Name);

[Survived] String mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:39:18
 							cb.ToTable("SessionCategories");
 
 							cb.WithOwner().HasForeignKey("SessionId");
-							cb.HasKey("Id");
+							cb.HasKey("");
 
 							cb.Property(c => c.Name);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:41:8
 							cb.WithOwner().HasForeignKey("SessionId");
 							cb.HasKey("Id");
 
-							cb.Property(c => c.Name);
+							;
 							cb.Property(c => c.Value);
 						})

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:42:8
 							cb.HasKey("Id");
 
 							cb.Property(c => c.Name);
-							cb.Property(c => c.Value);
+							;
 						})
 				.Metadata

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:48:3
 				.SetPropertyAccessMode(PropertyAccessMode.Field);
 
 
-		builder.Property(s => s.MaxPlayerCapacity);
+		;
 
 		builder.Property(s => s.Date);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:50:3
 
 		builder.Property(s => s.MaxPlayerCapacity);
 
-		builder.Property(s => s.Date);
+		;
 
 		builder.OwnsOne(s => s.Time);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:52:3
 
 		builder.Property(s => s.Date);
 
-		builder.OwnsOne(s => s.Time);
+		;
 
 		builder.Property(s => s.Name);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:54:3
 
 		builder.OwnsOne(s => s.Time);
 
-		builder.Property(s => s.Name);
+		;
 		builder.Property(s => s.Description);
 		builder.Property(s => s.CourtId);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:55:3
 		builder.OwnsOne(s => s.Time);
 
 		builder.Property(s => s.Name);
-		builder.Property(s => s.Description);
+		;
 		builder.Property(s => s.CourtId);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Configurations/SessionConfiguration.cs:56:3
 
 		builder.Property(s => s.Name);
 		builder.Property(s => s.Description);
-		builder.Property(s => s.CourtId);
+		;
 	}
 }
