[Survived] Block removal mutation
src/SessionBookingService.Infrastructure/Converters/FluentApiExtensions.cs:9:2
 {
 	// Look into calling .ToJson() on the owned instances instead, if Postgress offers support for JSON columns
 	public static PropertyBuilder<T> HasValueJsonConverter<T>(this PropertyBuilder<T> propertyBuilder)
-	{
-		return propertyBuilder.HasConversion(new ValueJsonConverter<T>(),
-											new ValueJsonComparer<T>());
-	}
+	{}
 
 	public static PropertyBuilder<T> HasListOfIdsConverter<T>(this PropertyBuilder<T> propertyBuilder)
