[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Converters/ValueJsonComparer.cs:7:18
 namespace SessionBookingService.Infrastructure.Converters;
 
 internal sealed class ValueJsonComparer<T>() : ValueComparer<T>((l, r) =>
-																	JsonSerializer.Serialize(l,
-																							JsonSerializerOptions
-																								.Default) ==
-																	JsonSerializer.Serialize(r,
-																							JsonSerializerOptions
-																								.Default),
+																	JsonSerializer.Serialize(l,
+																							JsonSerializerOptions
+																								.Default) !=
+																	JsonSerializer.Serialize(r,
+																							JsonSerializerOptions
+																								.Default),
 																v => object.Equals(v, default(T))
 																	? 0

[Survived] Conditional (false) mutation
src/SessionBookingService.Infrastructure/Converters/ValueJsonComparer.cs:13:22
 																	JsonSerializer.Serialize(r,
 																							JsonSerializerOptions
 																								.Default),
-																v => object.Equals(v, default(T))
-																	? 0
-																	: StringComparer.Ordinal.GetHashCode(JsonSerializer
-																											.Serialize(
-																												v,
-																												JsonSerializerOptions
-																													.Default)),
+																v => (false?0
+:StringComparer.Ordinal.GetHashCode(JsonSerializer
+																											.Serialize(
+																												v,
+																												JsonSerializerOptions
+																													.Default))),
 																v => JsonSerializer.Deserialize<T>(JsonSerializer
 																										.Serialize(v,

[Survived] Conditional (true) mutation
src/SessionBookingService.Infrastructure/Converters/ValueJsonComparer.cs:13:22
 																	JsonSerializer.Serialize(r,
 																							JsonSerializerOptions
 																								.Default),
-																v => object.Equals(v, default(T))
-																	? 0
-																	: StringComparer.Ordinal.GetHashCode(JsonSerializer
-																											.Serialize(
-																												v,
-																												JsonSerializerOptions
-																													.Default)),
+																v => (true?0
+:StringComparer.Ordinal.GetHashCode(JsonSerializer
+																											.Serialize(
+																												v,
+																												JsonSerializerOptions
+																													.Default))),
 																v => JsonSerializer.Deserialize<T>(JsonSerializer
 																										.Serialize(v,
