[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:13:3
 {
 	internal static IServiceCollection AddInfrastructure(this IServiceCollection services, IConfiguration config)
 	{
-		services
-			.AddPersistence(config);
+		;
 
 		return services;

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:24:3
 	{
 		var connectionString = config.GetConnectionString("Database");
 
-		services.AddDbContext<SessionBookingDbContext>(opts => opts.UseNpgsql(connectionString));
+		;
 
 		services.AddScoped<IInstructorsRepository, InstructorsRepository>();

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:26:3
 
 		services.AddDbContext<SessionBookingDbContext>(opts => opts.UseNpgsql(connectionString));
 
-		services.AddScoped<IInstructorsRepository, InstructorsRepository>();
+		;
 		services.AddScoped<ICourtsRepository, CourtsRepository>();
 		services.AddScoped<ISessionsRepository, SessionsRepository>();

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:27:3
 		services.AddDbContext<SessionBookingDbContext>(opts => opts.UseNpgsql(connectionString));
 
 		services.AddScoped<IInstructorsRepository, InstructorsRepository>();
-		services.AddScoped<ICourtsRepository, CourtsRepository>();
+		;
 		services.AddScoped<ISessionsRepository, SessionsRepository>();
 		services.AddScoped<IPlayersRepository, PlayersRepository>();

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:28:3
 
 		services.AddScoped<IInstructorsRepository, InstructorsRepository>();
 		services.AddScoped<ICourtsRepository, CourtsRepository>();
-		services.AddScoped<ISessionsRepository, SessionsRepository>();
+		;
 		services.AddScoped<IPlayersRepository, PlayersRepository>();
 

[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/DependencyInjection.cs:29:3
 		services.AddScoped<IInstructorsRepository, InstructorsRepository>();
 		services.AddScoped<ICourtsRepository, CourtsRepository>();
 		services.AddScoped<ISessionsRepository, SessionsRepository>();
-		services.AddScoped<IPlayersRepository, PlayersRepository>();
+		;
 
 
