[Survived] Statement mutation
SessionBookingService.Infrastructure/Infrastructure/IntegrationEvents/IntegrationEventsPublisher.cs:29:3
 		IConnection connection = connectionFactory.CreateConnection();
 
 		_channel = connection.CreateModel();
-		_channel.ExchangeDeclare(
-			_messageBrokerSettings.ExchangeName,
-			ExchangeType.Fanout,
-			durable: true);
+		;
 	}
 

[Survived] Boolean mutation
SessionBookingService.Infrastructure/Infrastructure/IntegrationEvents/IntegrationEventsPublisher.cs:32:13
 		_channel.ExchangeDeclare(
 			_messageBrokerSettings.ExchangeName,
 			ExchangeType.Fanout,
-			durable: true);
+			durable: false);
 	}
 

[Survived] Statement mutation
SessionBookingService.Infrastructure/Infrastructure/IntegrationEvents/IntegrationEventsPublisher.cs:41:3
 
 		var body = Encoding.UTF8.GetBytes(serializedIntegrationEvent);
 
-		_channel.BasicPublish(
-			exchange: _messageBrokerSettings.ExchangeName,
-			routingKey: string.Empty,
-			body: body);
+		;
 	}
 }

[Survived] String mutation
SessionBookingService.Infrastructure/Infrastructure/IntegrationEvents/IntegrationEventsPublisher.cs:43:16
 
 		_channel.BasicPublish(
 			exchange: _messageBrokerSettings.ExchangeName,
-			routingKey: string.Empty,
+			routingKey: "Stryker was here!",
 			body: body);
 	}
