[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:19:13
         protected override void Up(MigrationBuilder migrationBuilder)
 #pragma warning restore MA0051
         {
-            migrationBuilder.CreateTable(
-                name: "Courts",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: false),
-                    ClubId = table.Column<Guid>(type: "uuid", nullable: false),
-                    MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
-                    ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Courts", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:23:51
                 name: "Courts",
                 columns: table => new
                 {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
+                    Id = table.Column<Guid>(type: "", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     ClubId = table.Column<Guid>(type: "uuid", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:25:73
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
-                    ClubId = table.Column<Guid>(type: "uuid", nullable: false),
+                    ClubId = table.Column<Guid>(type: "uuid", nullable: true),
                     MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:26:85
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     ClubId = table.Column<Guid>(type: "uuid", nullable: false),
-                    MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
+                    MaxDailySessions = table.Column<int>(type: "integer", nullable: true),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:26:64
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     ClubId = table.Column<Guid>(type: "uuid", nullable: false),
-                    MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
+                    MaxDailySessions = table.Column<int>(type: "", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:27:79
                     Name = table.Column<string>(type: "text", nullable: false),
                     ClubId = table.Column<Guid>(type: "uuid", nullable: false),
                     MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
+                    SessionIds = table.Column<string>(type: "text", nullable: true),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
                     ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:28:85
                     ClubId = table.Column<Guid>(type: "uuid", nullable: false),
                     MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
-                    ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
+                    ScheduleCalendar = table.Column<string>(type: "text", nullable: false),
                     ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
                 },

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:29:77
                     MaxDailySessions = table.Column<int>(type: "integer", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
+                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: false)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:33:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Courts", x => x.Id);
+                    ;
                 });
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:36:13
                     table.PrimaryKey("PK_Courts", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Instructors",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    UserId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
-                    ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Instructors", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:41:73
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    UserId = table.Column<Guid>(type: "uuid", nullable: false),
+                    UserId = table.Column<Guid>(type: "uuid", nullable: true),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:42:79
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
+                    SessionIds = table.Column<string>(type: "text", nullable: true),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
                     ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:42:61
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
+                    SessionIds = table.Column<string>(type: "", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
                     ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:44:59
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalendar = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
+                    ScheduleId = table.Column<Guid>(type: "", nullable: true)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:48:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Instructors", x => x.Id);
+                    ;
                 });
 

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:48:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Instructors", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:51:13
                     table.PrimaryKey("PK_Instructors", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Players",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    UserId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionIds = table.Column<string>(type: "text", nullable: false),
-                    ScheduleCalender = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Players", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:58:85
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
-                    ScheduleCalender = table.Column<string>(type: "text", nullable: true),
+                    ScheduleCalender = table.Column<string>(type: "text", nullable: false),
                     ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
                 },

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:59:77
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalender = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
+                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: false)
                 },
                 constraints: table =>

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:59:59
                     UserId = table.Column<Guid>(type: "uuid", nullable: false),
                     SessionIds = table.Column<string>(type: "text", nullable: false),
                     ScheduleCalender = table.Column<string>(type: "text", nullable: true),
-                    ScheduleId = table.Column<Guid>(type: "uuid", nullable: true)
+                    ScheduleId = table.Column<Guid>(type: "", nullable: true)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:63:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Players", x => x.Id);
+                    ;
                 });
 

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:63:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Players", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                 });
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:66:13
                     table.PrimaryKey("PK_Players", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "Sessions",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
-                    MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
-                    Date = table.Column<DateOnly>(type: "date", nullable: false),
-                    Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
-                    Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: false),
-                    Description = table.Column<string>(type: "text", nullable: false),
-                    CourtId = table.Column<Guid>(type: "uuid", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_Sessions", x => x.Id);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:67:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "Sessions",
+                name: "",
                 columns: table => new
                 {

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:71:79
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
+                    InstructorId = table.Column<Guid>(type: "uuid", nullable: true),
                     MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
                     Date = table.Column<DateOnly>(type: "date", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:72:86
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
-                    MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
+                    MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: true),
                     Date = table.Column<DateOnly>(type: "date", nullable: false),
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:73:75
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
                     MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
-                    Date = table.Column<DateOnly>(type: "date", nullable: false),
+                    Date = table.Column<DateOnly>(type: "date", nullable: true),
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:74:99
                     InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
                     MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
                     Date = table.Column<DateOnly>(type: "date", nullable: false),
-                    Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
+                    Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: true),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:74:63
                     InstructorId = table.Column<Guid>(type: "uuid", nullable: false),
                     MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
                     Date = table.Column<DateOnly>(type: "date", nullable: false),
-                    Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
+                    Time_Start = table.Column<TimeOnly>(type: "", nullable: false),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:75:97
                     MaxPlayerCapacity = table.Column<int>(type: "integer", nullable: false),
                     Date = table.Column<DateOnly>(type: "date", nullable: false),
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
-                    Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
+                    Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: true),
                     Name = table.Column<string>(type: "text", nullable: false),
                     Description = table.Column<string>(type: "text", nullable: false),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:76:73
                     Date = table.Column<DateOnly>(type: "date", nullable: false),
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: false),
+                    Name = table.Column<string>(type: "text", nullable: true),
                     Description = table.Column<string>(type: "text", nullable: false),
                     CourtId = table.Column<Guid>(type: "uuid", nullable: false)

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:77:80
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
-                    Description = table.Column<string>(type: "text", nullable: false),
+                    Description = table.Column<string>(type: "text", nullable: true),
                     CourtId = table.Column<Guid>(type: "uuid", nullable: false)
                 },

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:77:62
                     Time_Start = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
-                    Description = table.Column<string>(type: "text", nullable: false),
+                    Description = table.Column<string>(type: "", nullable: false),
                     CourtId = table.Column<Guid>(type: "uuid", nullable: false)
                 },

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:78:74
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     Description = table.Column<string>(type: "text", nullable: false),
-                    CourtId = table.Column<Guid>(type: "uuid", nullable: false)
+                    CourtId = table.Column<Guid>(type: "uuid", nullable: true)
                 },
                 constraints: table =>

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:78:56
                     Time_End = table.Column<TimeOnly>(type: "time without time zone", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: false),
                     Description = table.Column<string>(type: "text", nullable: false),
-                    CourtId = table.Column<Guid>(type: "uuid", nullable: false)
+                    CourtId = table.Column<Guid>(type: "", nullable: false)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:82:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_Sessions", x => x.Id);
+                    ;
                 });
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:85:13
                     table.PrimaryKey("PK_Sessions", x => x.Id);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "SessionBookings",
-                columns: table => new
-                {
-                    Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    PlayerId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionId = table.Column<Guid>(type: "uuid", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_SessionBookings", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_SessionBookings_Sessions_SessionId",
-                        column: x => x.SessionId,
-                        principalTable: "Sessions",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateTable(

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:90:75
                 columns: table => new
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
-                    PlayerId = table.Column<Guid>(type: "uuid", nullable: false),
+                    PlayerId = table.Column<Guid>(type: "uuid", nullable: true),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false)
                 },

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:91:76
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     PlayerId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionId = table.Column<Guid>(type: "uuid", nullable: false)
+                    SessionId = table.Column<Guid>(type: "uuid", nullable: true)
                 },
                 constraints: table =>

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:91:58
                 {
                     Id = table.Column<Guid>(type: "uuid", nullable: false),
                     PlayerId = table.Column<Guid>(type: "uuid", nullable: false),
-                    SessionId = table.Column<Guid>(type: "uuid", nullable: false)
+                    SessionId = table.Column<Guid>(type: "", nullable: false)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:95:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_SessionBookings", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_SessionBookings_Sessions_SessionId",

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:95:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_SessionBookings", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                     table.ForeignKey(
                         name: "FK_SessionBookings_Sessions_SessionId",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:96:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_SessionBookings", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_SessionBookings_Sessions_SessionId",
-                        column: x => x.SessionId,
-                        principalTable: "Sessions",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:104:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateTable(
-                name: "SessionCategories",
-                columns: table => new
-                {
-                    Id = table.Column<int>(type: "integer", nullable: false)
-                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
-                    SessionId = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: true),
-                    Value = table.Column<int>(type: "integer", nullable: false)
-                },
-                constraints: table =>
-                {
-                    table.PrimaryKey("PK_SessionCategories", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_SessionCategories_Sessions_SessionId",
-                        column: x => x.SessionId,
-                        principalTable: "Sessions",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
-                });
+            ;
 
             migrationBuilder.CreateIndex(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:105:23
                 });
 
             migrationBuilder.CreateTable(
-                name: "SessionCategories",
+                name: "",
                 columns: table => new
                 {
