[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:109:37
                 columns: table => new
                 {
                     Id = table.Column<int>(type: "integer", nullable: false)
-                        .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
+                        .Annotation("", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: true),

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:110:76
                 {
                     Id = table.Column<int>(type: "integer", nullable: false)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
-                    SessionId = table.Column<Guid>(type: "uuid", nullable: false),
+                    SessionId = table.Column<Guid>(type: "uuid", nullable: true),
                     Name = table.Column<string>(type: "text", nullable: true),
                     Value = table.Column<int>(type: "integer", nullable: false)

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:111:73
                     Id = table.Column<int>(type: "integer", nullable: false)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: true),
+                    Name = table.Column<string>(type: "text", nullable: false),
                     Value = table.Column<int>(type: "integer", nullable: false)
                 },

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:111:55
                     Id = table.Column<int>(type: "integer", nullable: false)
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false),
-                    Name = table.Column<string>(type: "text", nullable: true),
+                    Name = table.Column<string>(type: "", nullable: true),
                     Value = table.Column<int>(type: "integer", nullable: false)
                 },

[Survived] Boolean mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:112:74
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: true),
-                    Value = table.Column<int>(type: "integer", nullable: false)
+                    Value = table.Column<int>(type: "integer", nullable: true)
                 },
                 constraints: table =>

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:112:53
                         .Annotation("Npgsql:ValueGenerationStrategy", NpgsqlValueGenerationStrategy.IdentityByDefaultColumn),
                     SessionId = table.Column<Guid>(type: "uuid", nullable: false),
                     Name = table.Column<string>(type: "text", nullable: true),
-                    Value = table.Column<int>(type: "integer", nullable: false)
+                    Value = table.Column<int>(type: "", nullable: false)
                 },
                 constraints: table =>

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:116:21
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_SessionCategories", x => x.Id);
+                    ;
                     table.ForeignKey(
                         name: "FK_SessionCategories_Sessions_SessionId",

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:116:38
                 },
                 constraints: table =>
                 {
-                    table.PrimaryKey("PK_SessionCategories", x => x.Id);
+                    table.PrimaryKey("", x => x.Id);
                     table.ForeignKey(
                         name: "FK_SessionCategories_Sessions_SessionId",

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:117:21
                 constraints: table =>
                 {
                     table.PrimaryKey("PK_SessionCategories", x => x.Id);
-                    table.ForeignKey(
-                        name: "FK_SessionCategories_Sessions_SessionId",
-                        column: x => x.SessionId,
-                        principalTable: "Sessions",
-                        principalColumn: "Id",
-                        onDelete: ReferentialAction.Cascade);
+                    ;
                 });
 

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:118:31
                 {
                     table.PrimaryKey("PK_SessionCategories", x => x.Id);
                     table.ForeignKey(
-                        name: "FK_SessionCategories_Sessions_SessionId",
+                        name: "",
                         column: x => x.SessionId,
                         principalTable: "Sessions",

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:120:41
                     table.ForeignKey(
                         name: "FK_SessionCategories_Sessions_SessionId",
                         column: x => x.SessionId,
-                        principalTable: "Sessions",
+                        principalTable: "",
                         principalColumn: "Id",
                         onDelete: ReferentialAction.Cascade);

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:125:13
                         onDelete: ReferentialAction.Cascade);
                 });
 
-            migrationBuilder.CreateIndex(
-                name: "IX_SessionBookings_SessionId",
-                table: "SessionBookings",
-                column: "SessionId");
+            ;
 
             migrationBuilder.CreateIndex(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:128:25
             migrationBuilder.CreateIndex(
                 name: "IX_SessionBookings_SessionId",
                 table: "SessionBookings",
-                column: "SessionId");
+                column: "");
 
             migrationBuilder.CreateIndex(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:130:13
                 table: "SessionBookings",
                 column: "SessionId");
 
-            migrationBuilder.CreateIndex(
-                name: "IX_SessionCategories_SessionId",
-                table: "SessionCategories",
-                column: "SessionId");
+            ;
         }
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:139:13
         /// <inheritdoc />
         protected override void Down(MigrationBuilder migrationBuilder)
         {
-            migrationBuilder.DropTable(
-                name: "Courts");
+            ;
 
             migrationBuilder.DropTable(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:142:13
             migrationBuilder.DropTable(
                 name: "Courts");
 
-            migrationBuilder.DropTable(
-                name: "Instructors");
+            ;
 
             migrationBuilder.DropTable(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:143:23
                 name: "Courts");
 
             migrationBuilder.DropTable(
-                name: "Instructors");
+                name: "");
 
             migrationBuilder.DropTable(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:145:13
             migrationBuilder.DropTable(
                 name: "Instructors");
 
-            migrationBuilder.DropTable(
-                name: "Players");
+            ;
 
             migrationBuilder.DropTable(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:148:13
             migrationBuilder.DropTable(
                 name: "Players");
 
-            migrationBuilder.DropTable(
-                name: "SessionBookings");
+            ;
 
             migrationBuilder.DropTable(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:151:13
             migrationBuilder.DropTable(
                 name: "SessionBookings");
 
-            migrationBuilder.DropTable(
-                name: "SessionCategories");
+            ;
 
             migrationBuilder.DropTable(

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:152:23
                 name: "SessionBookings");
 
             migrationBuilder.DropTable(
-                name: "SessionCategories");
+                name: "");
 
             migrationBuilder.DropTable(

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:154:13
             migrationBuilder.DropTable(
                 name: "SessionCategories");
 
-            migrationBuilder.DropTable(
-                name: "Sessions");
+            ;
         }
     }

[Survived] String mutation
src/SessionBookingService.Infrastructure/Migrations/20260622151508_AddInitialDataModel.cs:155:23
                 name: "SessionCategories");
 
             migrationBuilder.DropTable(
-                name: "Sessions");
+                name: "");
         }
     }
