[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:11:3
 {
 	public async Task AddCourtAsync(Court court, CancellationToken cancellationToken)
 	{
-		await dbContext.Courts.AddAsync(court, cancellationToken);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:12:3
 	public async Task AddCourtAsync(Court court, CancellationToken cancellationToken)
 	{
 		await dbContext.Courts.AddAsync(court, cancellationToken);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:17:58
 
 	public async Task<Court?> GetByIdAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await dbContext.Courts.FirstOrDefaultAsync(c => c.Id == id, cancellationToken);
+		return await dbContext.Courts.FirstOrDefaultAsync(c => c.Id != id, cancellationToken);
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:22:3
 
 	public async Task UpdateAsync(Court court, CancellationToken cancellationToken)
 	{
-		dbContext.Courts.Update(court);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:23:3
 	public async Task UpdateAsync(Court court, CancellationToken cancellationToken)
 	{
 		dbContext.Courts.Update(court);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:28:3
 
 	public async Task DeleteAsync(Court court, CancellationToken cancellationToken)
 	{
-		dbContext.Courts.Remove(court);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:29:3
 	public async Task DeleteAsync(Court court, CancellationToken cancellationToken)
 	{
 		dbContext.Courts.Remove(court);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/CourtsRepository.cs:36:20
 	{
 		return await dbContext.Courts
 							.AsNoTracking()
-							.Where(c => c.ClubId == clubId)
+							.Where(c => c.ClubId != clubId)
 							.ToListAsync();
 	}
