[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/InstructorsRepository.cs:11:3
 {
 	public async Task AddInstructorAsync(Instructor instructor, CancellationToken cancellationToken)
 	{
-		await dbContext.Instructors.AddAsync(instructor, cancellationToken);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/InstructorsRepository.cs:12:3
 	public async Task AddInstructorAsync(Instructor instructor, CancellationToken cancellationToken)
 	{
 		await dbContext.Instructors.AddAsync(instructor, cancellationToken);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/InstructorsRepository.cs:17:72
 
 	public async Task<Instructor?> GetByIdAsync(Guid instructorId, CancellationToken cancellationToken)
 	{
-		return await dbContext.Instructors.FirstOrDefaultAsync(instructor => instructor.Id == instructorId,
+		return await dbContext.Instructors.FirstOrDefaultAsync(instructor => instructor.Id != instructorId,
 																cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/InstructorsRepository.cs:23:3
 
 	public async Task UpdateAsync(Instructor instructor, CancellationToken cancellationToken)
 	{
-		dbContext.Instructors.Update(instructor);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/InstructorsRepository.cs:24:3
 	public async Task UpdateAsync(Instructor instructor, CancellationToken cancellationToken)
 	{
 		dbContext.Instructors.Update(instructor);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 }
