[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:11:59
 {
 	public async Task<Player?> GetByIdAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await dbContext.Players.FirstOrDefaultAsync(p => p.Id == id, cancellationToken);
+		return await dbContext.Players.FirstOrDefaultAsync(p => p.Id != id, cancellationToken);
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:16:3
 
 	public async Task AddPlayerAsync(Player player, CancellationToken cancellationToken)
 	{
-		await dbContext.Players.AddAsync(player, cancellationToken);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:17:3
 	public async Task AddPlayerAsync(Player player, CancellationToken cancellationToken)
 	{
 		await dbContext.Players.AddAsync(player, cancellationToken);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:22:3
 
 	public async Task UpdateAsync(Player player, CancellationToken cancellationToken)
 	{
-		dbContext.Update(player);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:23:3
 	public async Task UpdateAsync(Player player, CancellationToken cancellationToken)
 	{
 		dbContext.Update(player);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:28:3
 
 	public async Task UpdateRangeAsync(ICollection<Player> players, CancellationToken cancellationToken)
 	{
-		dbContext.UpdateRange(players);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/PlayersRepository.cs:29:3
 	public async Task UpdateRangeAsync(ICollection<Player> players, CancellationToken cancellationToken)
 	{
 		dbContext.UpdateRange(players);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 }
