[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:12:3
 {
 	public async Task AddSessionAsync(Session session, CancellationToken cancellationToken)
 	{
-		await dbContext.Sessions.AddAsync(session, cancellationToken);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:13:3
 	public async Task AddSessionAsync(Session session, CancellationToken cancellationToken)
 	{
 		await dbContext.Sessions.AddAsync(session, cancellationToken);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:18:60
 
 	public async Task<Session?> GetByIdAsync(Guid id, CancellationToken cancellationToken)
 	{
-		return await dbContext.Sessions.FirstOrDefaultAsync(s => s.Id == id, cancellationToken);
+		return await dbContext.Sessions.FirstOrDefaultAsync(s => s.Id != id, cancellationToken);
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:23:3
 
 	public async Task UpdateAsync(Session session, CancellationToken cancellationToken)
 	{
-		dbContext.Update(session);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:24:3
 	public async Task UpdateAsync(Session session, CancellationToken cancellationToken)
 	{
 		dbContext.Update(session);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:29:3
 
 	public async Task Remove(Session session, CancellationToken cancellationToken)
 	{
-		dbContext.Sessions.Remove(session);
+		;
 		await dbContext.SaveChangesAsync(cancellationToken);
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:30:3
 	public async Task Remove(Session session, CancellationToken cancellationToken)
 	{
 		dbContext.Sessions.Remove(session);
-		await dbContext.SaveChangesAsync(cancellationToken);
+		;
 	}
 

[Survived] Block removal mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:38:2
 		DateTime? startDateTime = null,
 		DateTime? endDateTime = null,
 		List<SessionCategory>? categories = null)
-	{
-		return await dbContext.Sessions
-							.AsNoTracking()
-							.Where(session => sessionIds.Contains(session.Id))
-							.WhereBetweenDateAndTimes(startDateTime, endDateTime)
-							.ToListAsync();
-	}
+	{}
 
 	public async Task<List<Session>> ListByClubIdAsync(Guid clubId,

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:53:27
 	{
 		List<Court> courts = await dbContext.Courts
 											.AsNoTracking()
-											.Where(room => room.ClubId == clubId)
+											.Where(room => room.ClubId != clubId)
 											.ToListAsync();
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:64:26
 	public async Task<List<Session>> ListByCourtId(Guid courtId)
 	{
 		return await dbContext.Sessions
-							.Where(session => session.CourtId == courtId)
+							.Where(session => session.CourtId != courtId)
 							.ToListAsync();
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:70:3
 
 	public async Task RemoveRangeAsync(List<Session> sessions)
 	{
-		dbContext.RemoveRange(sessions);
+		;
 		await dbContext.SaveChangesAsync();
 	}

[Survived] Statement mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:71:3
 	public async Task RemoveRangeAsync(List<Session> sessions)
 	{
 		dbContext.RemoveRange(sessions);
-		await dbContext.SaveChangesAsync();
+		;
 	}
 }

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:80:7
 	public static IQueryable<Session> WhereBetweenDateAndTimes(this IQueryable<Session> query, DateTime? start,
 																DateTime? end)
 	{
-		if (start is null && end is null)
+		if (start is not null && end is null)
 		{
 			return query;

[Survived] Negate expression
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:80:7
 	public static IQueryable<Session> WhereBetweenDateAndTimes(this IQueryable<Session> query, DateTime? start,
 																DateTime? end)
 	{
-		if (start is null && end is null)
+		if (!(start is null && end is null))
 		{
 			return query;

[Survived] Block removal mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:81:3
 																DateTime? end)
 	{
 		if (start is null && end is null)
-		{
-			return query;
-		}
+		{}
 
 		start ??= DateTime.MinValue;

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:85:3
 			return query;
 		}
 
-		start ??= DateTime.MinValue;
+		start = DateTime.MinValue;
 		end ??= DateTime.MaxValue;
 

[Survived] CoalesceAssignmentExpression to SimpleAssignmentExpression mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:86:3
 		}
 
 		start ??= DateTime.MinValue;
-		end ??= DateTime.MaxValue;
+		end = DateTime.MaxValue;
 
 		IQueryable<Session> result = query

[Survived] Logical mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:90:28
 
 		IQueryable<Session> result = query
 									.AsNoTracking()
-									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
-													session.Date <= DateOnly.FromDateTime(end.Value))
+									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) ||
+													session.Date <= DateOnly.FromDateTime(end.Value))
 									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:90:28
 
 		IQueryable<Session> result = query
 									.AsNoTracking()
-									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
+									.Where(session => session.Date < DateOnly.FromDateTime(start.Value) &&
 													session.Date <= DateOnly.FromDateTime(end.Value))
 									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:91:14
 		IQueryable<Session> result = query
 									.AsNoTracking()
 									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
-													session.Date <= DateOnly.FromDateTime(end.Value))
+													session.Date < DateOnly.FromDateTime(end.Value))
 									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:91:14
 		IQueryable<Session> result = query
 									.AsNoTracking()
 									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
-													session.Date <= DateOnly.FromDateTime(end.Value))
+													session.Date > DateOnly.FromDateTime(end.Value))
 									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));
 

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:92:28
 									.AsNoTracking()
 									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
 													session.Date <= DateOnly.FromDateTime(end.Value))
-									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));
+									.Where(session => session.Time.Start < TimeOnly.FromDateTime(start.Value));
 
 		return result;

[Survived] Equality mutation
src/SessionBookingService.Infrastructure/Repositories/SessionsRepository.cs:92:28
 									.AsNoTracking()
 									.Where(session => session.Date >= DateOnly.FromDateTime(start.Value) &&
 													session.Date <= DateOnly.FromDateTime(end.Value))
-									.Where(session => session.Time.Start >= TimeOnly.FromDateTime(start.Value));
+									.Where(session => session.Time.Start > TimeOnly.FromDateTime(start.Value));
 
 		return result;
