[Survived] Statement mutation
SessionBookingService/src/SessionBookingService.Infrastructure/SessionBookingDbContext.cs:43:3
 			return await base.SaveChangesAsync(cancellationToken);
 		}
 
-		await PublishDomainEvents(domainEvents);
+		;
 		return await base.SaveChangesAsync(cancellationToken);
 	}
