[Survived] Equality mutation
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:17:7
 	{
 		Session? session = await sessionsRepository.GetByIdAsync(command.SessionId, cancellationToken);
 
-		if (session is null)
+		if (session is not null)
 		{
 			return Result.Failure<Guid>(Error.NotFound("SessionNotFound", "Session not found"));

[Survived] Negate expression
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:22:7
 			return Result.Failure<Guid>(Error.NotFound("SessionNotFound", "Session not found"));
 		}
 
-		if (session.HasBookingForPlayer(command.PlayerId))
+		if (!(session.HasBookingForPlayer(command.PlayerId)))
 		{
 			return Result.Failure<Guid>(Error.Conflict("PlayerAlreadyHasBooking",

[Survived] String mutation
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:24:47
 
 		if (session.HasBookingForPlayer(command.PlayerId))
 		{
-			return Result.Failure<Guid>(Error.Conflict("PlayerAlreadyHasBooking",
+			return Result.Failure<Guid>(Error.Conflict("",
 														"Player already has booking"));
 		}

[Survived] Equality mutation
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:30:7
 
 		Player? player = await playersRepository.GetByIdAsync(command.PlayerId, cancellationToken);
 
-		if (player is null)
+		if (player is not null)
 		{
 			return Result.Failure<Guid>(Error.NotFound("PlayerNotFound", "Player not found"));

[Survived] Negate expression
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:35:7
 			return Result.Failure<Guid>(Error.NotFound("PlayerNotFound", "Player not found"));
 		}
 
-		if (player.HasBookingForSession(session.Id))
+		if (!(player.HasBookingForSession(session.Id)))
 		{
 			return Result.Failure<Guid>(Error.Unexpected("PlayerNotExpectedToHaveReservationToSession",

[Survived] Negate expression
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:43:7
 
 		Result<bool> bookSpotResult = session.BookSpot(player);
 
-		if (bookSpotResult.IsFailure)
+		if (!(bookSpotResult.IsFailure))
 		{
 			return Result.Failure<Guid>(bookSpotResult.Error);

[Survived] Block removal mutation
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:44:3
 		Result<bool> bookSpotResult = session.BookSpot(player);
 
 		if (bookSpotResult.IsFailure)
-		{
-			return Result.Failure<Guid>(bookSpotResult.Error);
-		}
+		{}
 
 		await sessionsRepository.UpdateAsync(session, cancellationToken);

[Survived] Statement mutation
Bookings/Commands/CreateBooking/CreateBookingCommandHandler.cs:48:3
 			return Result.Failure<Guid>(bookSpotResult.Error);
 		}
 
-		await sessionsRepository.UpdateAsync(session, cancellationToken);
+		;
 
 		Result res = Result.Success();
