[Survived] Equality mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:19:7
 	{
 		Court? court = await courtsRepository.GetByIdAsync(command.CourtId, cancellationToken);
 
-		if (court is null)
+		if (court is not null)
 		{
 			return Result.Failure<Session>(Error.NotFound("CourtNotFound", "Court not found"));

[Survived] Equality mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:26:7
 
 		Instructor? instructor = await instructorsRepository.GetByIdAsync(command.InstructorId, cancellationToken);
 
-		if (instructor is null)
+		if (instructor is not null)
 		{
 			return Result.Failure<Session>(Error.NotFound("InstructorNotFound", "Instructor not found"));

[Survived] Equality mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:35:7
 																		command.EndDateTime);
 
 		// change returned error type to Error.Validation
-		if (createTimeSlotResult is { IsFailure: true, Error.Type: ErrorType.Failure })
+		if (createTimeSlotResult is not { IsFailure: true, Error.Type: ErrorType.Failure })
 		{
 			return Result.Failure<Session>(Error.NotFound("InvalidDateAndTime", "Invalid date and time"));

[Survived] Boolean mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:35:44
 																		command.EndDateTime);
 
 		// change returned error type to Error.Validation
-		if (createTimeSlotResult is { IsFailure: true, Error.Type: ErrorType.Failure })
+		if (createTimeSlotResult is { IsFailure: false, Error.Type: ErrorType.Failure })
 		{
 			return Result.Failure<Session>(Error.NotFound("InvalidDateAndTime", "Invalid date and time"));

[Survived] String mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:37:50
 		// change returned error type to Error.Validation
 		if (createTimeSlotResult is { IsFailure: true, Error.Type: ErrorType.Failure })
 		{
-			return Result.Failure<Session>(Error.NotFound("InvalidDateAndTime", "Invalid date and time"));
+			return Result.Failure<Session>(Error.NotFound("", "Invalid date and time"));
 		}
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:40:7
 			return Result.Failure<Session>(Error.NotFound("InvalidDateAndTime", "Invalid date and time"));
 		}
 
-		if (!instructor.IsTimeSlotFree(DateOnly.FromDateTime(command.StartDateTime), createTimeSlotResult.Value))
+		if (instructor.IsTimeSlotFree(DateOnly.FromDateTime(command.StartDateTime), createTimeSlotResult.Value))
 		{
 			return Result.Failure<Session>(Error.Conflict("InstructorsCalenderIsNotFreeForTheEntireDuration",

[Survived] String mutation
Bookings/Commands/CreateSession/CreateSessionCommandHandler.cs:43:15
 		if (!instructor.IsTimeSlotFree(DateOnly.FromDateTime(command.StartDateTime), createTimeSlotResult.Value))
 		{
 			return Result.Failure<Session>(Error.Conflict("InstructorsCalenderIsNotFreeForTheEntireDuration",
-														"Instructor's calendar is not free for the entire session duration"));
+														""));
 		}
 
