[Survived] Block removal mutation
Clubs/Queries/ListSessions/ListSessionsQueryHandler.cs:12:2
 	IRequestHandler<ListSessionsQuery, Result<List<Session>>>
 {
 	public async ValueTask<Result<List<Session>>> Handle(ListSessionsQuery query, CancellationToken cancellationToken)
-	{
-		return await sessionsRepository.ListByClubIdAsync(query.ClubId,
-														query.StartDateTime,
-														query.EndDateTime,
-														query.Categories);
-	}
+	{}
 }
 
