[Survived] Statement mutation
SessionBookingService.Application/Courts/IntegrationEvents/CourtAddedEventHandler.cs:18:3
 						notification.ClubId,
 						id: notification.CourtId);
 
-		await courtsRepository.AddCourtAsync(court, cancellationToken);
+		;
 	}
 }
