[Survived] Equality mutation
SessionBookingService.Application/Courts/IntegrationEvents/CourtRemovedEventHandler.cs:15:7
 	{
 		Court? court = await courtsRepository.GetByIdAsync(notification.CourtId, cancellationToken);
 
-		if (court is not null)
+		if (court is null)
 		{
 			await courtsRepository.DeleteAsync(court, cancellationToken);

[Survived] Statement mutation
SessionBookingService.Application/Courts/IntegrationEvents/CourtRemovedEventHandler.cs:17:4
 
 		if (court is not null)
 		{
-			await courtsRepository.DeleteAsync(court, cancellationToken);
+			;
 		}
 	}
