[Survived] String mutation
Courts/Queries/GetCourt/GetCourtQueryHandler.cs:17:54
 
 		if (court is null)
 		{
-			return Result.Failure<Court>(Error.NotFound(code: "", description: "Court not found"));
+			return Result.Failure<Court>(Error.NotFound(code: "Stryker was here!", description: "Court not found"));
 		}
 
