[Survived] Block removal mutation
Courts/Queries/ListCourts/ListCourtsQueryHandler.cs:12:2
 	IRequestHandler<ListCourtsQuery, Result<List<Court>>>
 {
 	public async ValueTask<Result<List<Court>>> Handle(ListCourtsQuery request, CancellationToken cancellationToken)
-	{
-		Result<List<Court>> courts = await courtsRepository.ListByClubIdAsync(request.ClubId);
-		return courts;
-	}
+	{}
 }
 
