[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:24:7
 			return Result.Failure<Result>(Error.NotFound(description: "Session not found", code: "SessionNotFound"));
 		}
 
-		if (!session.HasBookingForPlayer(command.PlayerId))
+		if (session.HasBookingForPlayer(command.PlayerId))
 		{
 			return Result.Failure<Result>(Error.NotFound(description:

[Survived] String mutation
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:27:15
 		if (!session.HasBookingForPlayer(command.PlayerId))
 		{
 			return Result.Failure<Result>(Error.NotFound(description:
-														"User does not have a reservation for the given session",
+														"",
 														code: "BLablbla"));
 		}

[Survived] String mutation
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:35:62
 
 		if (player is null)
 		{
-			return Result.Failure<Result>(Error.NotFound(description: "Participant not found", code: "BLablbla"));
+			return Result.Failure<Result>(Error.NotFound(description: "", code: "BLablbla"));
 		}
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:38:7
 			return Result.Failure<Result>(Error.NotFound(description: "Participant not found", code: "BLablbla"));
 		}
 
-		if (!player.HasBookingForSession(session.Id))
+		if (player.HasBookingForSession(session.Id))
 		{
 			return Result.Failure<Result>(Error.Unexpected(description:

[Survived] Negate expression
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:47:7
 
 		Result<bool> cancelReservationResult = session.CancelBooking(command.PlayerId, dateTimeProvider);
 
-		if (cancelReservationResult.IsFailure)
+		if (!(cancelReservationResult.IsFailure))
 		{
 			return cancelReservationResult;

[Survived] Block removal mutation
Players/Commands/CancelBooking/CancelBookingCommandHandler.cs:48:3
 		Result<bool> cancelReservationResult = session.CancelBooking(command.PlayerId, dateTimeProvider);
 
 		if (cancelReservationResult.IsFailure)
-		{
-			return cancelReservationResult;
-		}
+		{}
 
 		await sessionsRepository.UpdateAsync(session, cancellationToken);
