[Survived] Equality mutation
Players/Queries/ListPlayerSessions/ListPlayersSessionsQueryHandler.cs:18:7
 	{
 		Player? participant = await playersRepository.GetByIdAsync(query.PlayerId, cancellationToken);
 
-		if (participant is null)
+		if (participant is not null)
 		{
 			return Result.Failure<List<Session>>(Error.NotFound("PlayerNotFound", "Player not found"));
