[Survived] Statement mutation
SessionBookingService.Application/Sessions/IntegrationEvents/CourtRemovedEventHandler.cs:15:3
 	{
 		List<Session> sessions = await sessionsRepository.ListByCourtId(notification.CourtId);
 
-		sessions.ForEach(s => s.Cancel());
+		;
 
 		await sessionsRepository.RemoveRangeAsync(sessions);

[Survived] Statement mutation
SessionBookingService.Application/Sessions/IntegrationEvents/CourtRemovedEventHandler.cs:17:3
 
 		sessions.ForEach(s => s.Cancel());
 
-		await sessionsRepository.RemoveRangeAsync(sessions);
+		;
 	}
 }
