[Survived] Negate expression
SessionBookingService.Application/Sessions/IntegrationEvents/SessionCanceledEventHandler.cs:21:7
 
 		Result<bool> removeFromScheduleResult = trainer.RemoveFromSchedule(notification.Session);
 
-		if (removeFromScheduleResult.IsFailure)
+		if (!(removeFromScheduleResult.IsFailure))
 		{
 			// throw something in here

[Survived] Statement mutation
SessionBookingService.Application/Sessions/IntegrationEvents/SessionCanceledEventHandler.cs:26:3
 			// throw something in here
 		}
 
-		await instructorsRepository.UpdateAsync(trainer, cancellationToken);
+		;
 	}
 }
