[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
Sessions/Queries/GetSession/GetSessionQueryHandler.cs:23:7
 		}
 
 		var hasSession = court.HasSession(query.SessionId);
-		if (!hasSession)
+		if (hasSession)
 		{
 			return Result.Failure<Session>(Error.Failure("SessionNotFound", "Session not found"));

[Survived] Equality mutation
Sessions/Queries/GetSession/GetSessionQueryHandler.cs:29:7
 		}
 
 		Session? session = await sessionsRepository.GetByIdAsync(query.SessionId, cancellationToken);
-		if (session is null)
+		if (session is not null)
 		{
 			return Result.Failure<Session>(Error.NotFound("SessionNotFound", "Session not found"));

[Survived] String mutation
Sessions/Queries/GetSession/GetSessionQueryHandler.cs:31:69
 		Session? session = await sessionsRepository.GetByIdAsync(query.SessionId, cancellationToken);
 		if (session is null)
 		{
-			return Result.Failure<Session>(Error.NotFound("SessionNotFound", "Session not found"));
+			return Result.Failure<Session>(Error.NotFound("SessionNotFound", ""));
 		}
 
