[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/Common/Schedule.cs:16:27
 		Dictionary<DateOnly, List<TimeSlot>>? calendar = null,
 #pragma warning restore S3427
 #pragma warning restore MA0016
-		Guid? id = null) : base(id ?? Guid.CreateVersion7())
+		Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		_calendar = calendar ?? new Dictionary<DateOnly, List<TimeSlot>>();

[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/Common/Schedule.cs:18:15
 #pragma warning restore MA0016
 		Guid? id = null) : base(id ?? Guid.CreateVersion7())
 	{
-		_calendar = calendar ?? new Dictionary<DateOnly, List<TimeSlot>>();
+		_calendar = new Dictionary<DateOnly, List<TimeSlot>>();
 	}
 

[Killed] Block removal mutation
src/SessionBookingService.Domain/Common/Schedule.cs:26:2
 	} // For EF / serialization
 
 	public static Schedule Empty()
-	{
-		return new Schedule(null, Guid.CreateVersion7());
-	}
+	{}
 
 	internal bool CanBookTimeSlot(DateOnly date, TimeSlot time)
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/Common/Schedule.cs:32:7
 
 	internal bool CanBookTimeSlot(DateOnly date, TimeSlot time)
 	{
-		if (!_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots))
+		if (_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots))
 		{
 			return true;

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/Common/Schedule.cs:37:10
 			return true;
 		}
 
-		return !timeSlots.Exists(ts => ts.IsOverlappingWith(time));
+		return timeSlots.Exists(ts => ts.IsOverlappingWith(time));
 	}
 

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/Common/Schedule.cs:44:7
 	{
 		var entryExists = _calendar.TryGetValue(date, out List<TimeSlot>? timeSlots);
 
-		if (!entryExists)
+		if (entryExists)
 		{
 			_calendar[date] = [time];
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Survived] Boolean mutation
src/SessionBookingService.Domain/Common/Schedule.cs:47:26
 		if (!entryExists)
 		{
 			_calendar[date] = [time];
-			return Result.Success(true);
+			return Result.Success(false);
 		}
 

[Killed] Equality mutation
src/SessionBookingService.Domain/Common/Schedule.cs:50:7
 			return Result.Success(true);
 		}
 
-		if (timeSlots is not null && timeSlots.Exists(ts => ts.IsOverlappingWith(time)))
+		if (timeSlots is null && timeSlots.Exists(ts => ts.IsOverlappingWith(time)))
 		{
 			return Result.Failure<bool>(Error.Conflict(code: "no good", description: "dunno"));
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Negate expression
src/SessionBookingService.Domain/Common/Schedule.cs:50:7
 			return Result.Success(true);
 		}
 
-		if (timeSlots is not null && timeSlots.Exists(ts => ts.IsOverlappingWith(time)))
+		if (!(timeSlots is not null && timeSlots.Exists(ts => ts.IsOverlappingWith(time))))
 		{
 			return Result.Failure<bool>(Error.Conflict(code: "no good", description: "dunno"));
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Survived] String mutation
src/SessionBookingService.Domain/Common/Schedule.cs:52:77
 
 		if (timeSlots is not null && timeSlots.Exists(ts => ts.IsOverlappingWith(time)))
 		{
-			return Result.Failure<bool>(Error.Conflict(code: "no good", description: "dunno"));
+			return Result.Failure<bool>(Error.Conflict(code: "no good", description: ""));
 		}
 

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/Common/Schedule.cs:55:3
 			return Result.Failure<bool>(Error.Conflict(code: "no good", description: "dunno"));
 		}
 
-		timeSlots!.Add(time);
+		;
 
 		return Result.Success(true);

[NoCoverage] Negate expression
src/SessionBookingService.Domain/Common/Schedule.cs:62:7
 
 	public Result<bool> RemoveBooking(DateOnly date, TimeSlot time)
 	{
-		if (!_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots) || !timeSlots.Contains(time))
+		if (!(!_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots) || !timeSlots.Contains(time)))
 		{
 			return Result.Failure<bool>(Error.NotFound("", ""));

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/Common/Schedule.cs:62:7
 
 	public Result<bool> RemoveBooking(DateOnly date, TimeSlot time)
 	{
-		if (!_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots) || !timeSlots.Contains(time))
+		if (_calendar.TryGetValue(date, out List<TimeSlot>? timeSlots) || !timeSlots.Contains(time))
 		{
 			return Result.Failure<bool>(Error.NotFound("", ""));
