[NoCoverage] Equality mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:13:33
 
 	public static Result<TimeSlot> FromDateTimes(DateTime start, DateTime end)
 	{
-		if (start.Date != end.Date || start >= end)
+		if (start.Date != end.Date || start < end)
 		{
 			// Add Validation Err type and return that instead

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:13:33
 
 	public static Result<TimeSlot> FromDateTimes(DateTime start, DateTime end)
 	{
-		if (start.Date != end.Date || start >= end)
+		if (start.Date != end.Date || start > end)
 		{
 			// Add Validation Err type and return that instead

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:25:3
 
 	public override IEnumerable<object?> GetEqualityComponents()
 	{
-		yield return Start;
+		;
 		yield return End;
 	}

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:26:3
 	public override IEnumerable<object?> GetEqualityComponents()
 	{
 		yield return Start;
-		yield return End;
+		;
 	}
 

[Killed] Negate expression
src/SessionBookingService.Domain/Common/TimeSlot.cs:31:7
 
 	public bool IsOverlappingWith(TimeSlot other)
 	{
-		if (Start >= other.End)
+		if (!(Start >= other.End))
 		{
 			return false;
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Equality mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:31:7
 
 	public bool IsOverlappingWith(TimeSlot other)
 	{
-		if (Start >= other.End)
+		if (Start < other.End)
 		{
 			return false;
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Negate expression
src/SessionBookingService.Domain/Common/TimeSlot.cs:36:7
 			return false;
 		}
 
-		if (other.Start >= End)
+		if (!(other.Start >= End))
 		{
 			return false;
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Equality mutation
src/SessionBookingService.Domain/Common/TimeSlot.cs:36:7
 			return false;
 		}
 
-		if (other.Start >= End)
+		if (other.Start < End)
 		{
 			return false;
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail
