[Killed] Equality mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:11:31
 {
 	internal Result<bool> ScheduleSession(Session session)
 	{
-		if (_sessionIds.Exists(x => x == session.Id))
+		if (_sessionIds.Exists(x => x != session.Id))
 		{
 			return Result.Failure<bool>(Error.Failure("yo", "Session already exists in court"));
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Negate expression
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:11:7
 {
 	internal Result<bool> ScheduleSession(Session session)
 	{
-		if (_sessionIds.Exists(x => x == session.Id))
+		if (!(_sessionIds.Exists(x => x == session.Id)))
 		{
 			return Result.Failure<bool>(Error.Failure("yo", "Session already exists in court"));
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[NoCoverage] String mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:13:52
 	{
 		if (_sessionIds.Exists(x => x == session.Id))
 		{
-			return Result.Failure<bool>(Error.Failure("yo", "Session already exists in court"));
+			return Result.Failure<bool>(Error.Failure("yo", ""));
 		}
 

[Killed] Equality mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:16:7
 			return Result.Failure<bool>(Error.Failure("yo", "Session already exists in court"));
 		}
 
-		if (_sessionIds.Count >= _maxDailySessions)
+		if (_sessionIds.Count > _maxDailySessions)
 		{
 			return Result.Failure<bool>(CourtErrors.NumberOfSessionsCannotExceedSubscriptionLimit);
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Negate expression
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:16:7
 			return Result.Failure<bool>(Error.Failure("yo", "Session already exists in court"));
 		}
 
-		if (_sessionIds.Count >= _maxDailySessions)
+		if (!(_sessionIds.Count >= _maxDailySessions))
 		{
 			return Result.Failure<bool>(CourtErrors.NumberOfSessionsCannotExceedSubscriptionLimit);
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Block removal mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:17:3
 		}
 
 		if (_sessionIds.Count >= _maxDailySessions)
-		{
-			return Result.Failure<bool>(CourtErrors.NumberOfSessionsCannotExceedSubscriptionLimit);
-		}
+		{}
 
 		Result bookingResult = _schedule.BookTimeSlot(session.Date, session.Time);
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenMoreThanSubscriptionAllows_ShouldFail

[Killed] Negate expression
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:22:7
 		}
 
 		Result bookingResult = _schedule.BookTimeSlot(session.Date, session.Time);
-		if (bookingResult.IsFailure)
+		if (!(bookingResult.IsFailure))
 		{
 			return Result.Failure<bool>(CourtErrors.SessionsCannotOverlap);
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Block removal mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:23:3
 
 		Result bookingResult = _schedule.BookTimeSlot(session.Date, session.Time);
 		if (bookingResult.IsFailure)
-		{
-			return Result.Failure<bool>(CourtErrors.SessionsCannotOverlap);
-		}
+		{}
 
 		_sessionIds.Add(session.Id);
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Statement mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:27:3
 			return Result.Failure<bool>(CourtErrors.SessionsCannotOverlap);
 		}
 
-		_sessionIds.Add(session.Id);
+		;
 		// some event will be needed here
 
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenMoreThanSubscriptionAllows_ShouldFail

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/CourtsAggregate/Court.Behavior.cs:34:2
 	}
 
 	public bool HasSession(Guid sessionId)
-	{
-		return _sessionIds.Contains(sessionId);
-	}
+	{}
 }
 
