[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/CourtsAggregate/Court.Data.cs:16:27
 		int maxDailySessions,
 		Guid clubId,
 		Schedule? schedule = null,
-		Guid? id = null) : base(id ?? Guid.CreateVersion7())
+		Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		Name = name;

[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/CourtsAggregate/Court.Data.cs:21:15
 		Name = name;
 		_maxDailySessions = maxDailySessions;
 		ClubId = clubId;
-		_schedule = schedule ?? Schedule.Empty();
+		_schedule = Schedule.Empty();
 	}
 
