[Survived] String mutation
src/SessionBookingService.Domain/CourtsAggregate/CourtErrors.cs:8:17
 internal static class CourtErrors
 {
 	internal static readonly Error NumberOfSessionsCannotExceedSubscriptionLimit =
-		Error.Failure("Court.NumberOfSessionsCannotExceedSubscriptionLimit",
+		Error.Failure("",
 					"A court cannot have more scheduled sessions than the subscription allows");
 

[Survived] String mutation
src/SessionBookingService.Domain/CourtsAggregate/CourtErrors.cs:11:71
 		Error.Failure("Court.NumberOfSessionsCannotExceedSubscriptionLimit",
 					"A court cannot have more scheduled sessions than the subscription allows");
 
-	internal static readonly Error SessionsCannotOverlap = Error.Failure("Court.SessionsCannotOverlap",
+	internal static readonly Error SessionsCannotOverlap = Error.Failure("",
 																		"A court cannot have two or more overlapping sessions");
 }
