[Survived] String mutation
SessionBookingService.Domain/CourtsAggregate/Events/SessionCanceledForCourtEvent.cs:14:10
 {
 	public static readonly Result InstructorNotFound =
 		EventualConsistencyError.From("SessionCanceledEvent.InstructorNotFound",
-									"Instructor not found");
+									"");
 }
 
