[Killed] Negate expression
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:11:7
 {
 	internal Result<bool> AddSessionToSchedule(Session session)
 	{
-		if (_sessionIds.Contains(session.Id))
+		if (!(_sessionIds.Contains(session.Id)))
 		{
 			return Result.Failure<bool>(Error.Conflict("",
killedBy: SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[NoCoverage] String mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:14:15
 		if (_sessionIds.Contains(session.Id))
 		{
 			return Result.Failure<bool>(Error.Conflict("",
-														"Session already exists in the schedule of the Instructor"));
+														""));
 		}
 

[Killed] Negate expression
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:19:7
 
 		Result bookingTimeSlotResult = _schedule.BookTimeSlot(session.Date, session.Time);
 
-		if (bookingTimeSlotResult.IsFailure)
+		if (!(bookingTimeSlotResult.IsFailure))
 		{
 			return Result.Failure<bool>(InstructorErrors.SessionCannotOverlap);
killedBy: SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Block removal mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:20:3
 		Result bookingTimeSlotResult = _schedule.BookTimeSlot(session.Date, session.Time);
 
 		if (bookingTimeSlotResult.IsFailure)
-		{
-			return Result.Failure<bool>(InstructorErrors.SessionCannotOverlap);
-		}
+		{}
 
 		_sessionIds.Add(session.Id);
killedBy: SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.InstructorAggregate.InstructorTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Survived] Boolean mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:25:25
 		}
 
 		_sessionIds.Add(session.Id);
-		return Result.Success(true);
+		return Result.Success(false);
 	}
 

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:29:2
 	}
 
 	public bool IsTimeSlotFree(DateOnly date, TimeSlot time)
-	{
-		return _schedule.CanBookTimeSlot(date, time);
-	}
+	{}
 
 	public Result<bool> RemoveFromSchedule(Session session)

[NoCoverage] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:35:7
 
 	public Result<bool> RemoveFromSchedule(Session session)
 	{
-		if (!_sessionIds.Contains(session.Id))
+		if (_sessionIds.Contains(session.Id))
 		{
 			return Result.Failure<bool>(Error.NotFound("", "Session not found in instructors's schedule"));

[NoCoverage] Negate expression
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:42:7
 
 		Result<bool> removeBookingResult = _schedule.RemoveBooking(session.Date, session.Time);
 
-		if (removeBookingResult.IsFailure)
+		if (!(removeBookingResult.IsFailure))
 		{
 			return Result.Failure<bool>(removeBookingResult.Error);

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:43:3
 		Result<bool> removeBookingResult = _schedule.RemoveBooking(session.Date, session.Time);
 
 		if (removeBookingResult.IsFailure)
-		{
-			return Result.Failure<bool>(removeBookingResult.Error);
-		}
+		{}
 
 		_sessionIds.Remove(session.Id);

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:47:3
 			return Result.Failure<bool>(removeBookingResult.Error);
 		}
 
-		_sessionIds.Remove(session.Id);
+		;
 		return Result.Success(true);
 	}

[NoCoverage] Boolean mutation
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Behavior.cs:48:25
 		}
 
 		_sessionIds.Remove(session.Id);
-		return Result.Success(true);
+		return Result.Success(false);
 	}
 }
