[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Data.cs:13:31
 
 	internal Instructor(Guid userId,
 						Schedule? sch = null,
-						Guid? id = null) : base(id ?? Guid.CreateVersion7())
+						Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		UserId = userId;

[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/InstructorAggregate/Instructor.Data.cs:16:15
 						Guid? id = null) : base(id ?? Guid.CreateVersion7())
 	{
 		UserId = userId;
-		_schedule = sch ?? _schedule;
+		_schedule = _schedule;
 	}
 
