[Survived] String mutation
src/SessionBookingService.Domain/InstructorAggregate/InstructorErrors.cs:8:17
 internal static class InstructorErrors
 {
 	internal static readonly Error SessionCannotOverlap =
-		Error.Failure("Instructor.CannotHaveMultipleOverlappingSessions",
+		Error.Failure("",
 					"An instructor cannot have two or more overlapping sessions");
 }

[Survived] String mutation
src/SessionBookingService.Domain/InstructorAggregate/InstructorErrors.cs:9:6
 {
 	internal static readonly Error SessionCannotOverlap =
 		Error.Failure("Instructor.CannotHaveMultipleOverlappingSessions",
-					"An instructor cannot have two or more overlapping sessions");
+					"");
 }
 
