[NoCoverage] String mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:13:47
 	{
 		if (_sessionIds.Contains(session.Id))
 		{
-			return Result.Failure<bool>(Error.Conflict("", "Session already exists in player's schedule"));
+			return Result.Failure<bool>(Error.Conflict("Stryker was here!", "Session already exists in player's schedule"));
 		}
 

[Killed] Negate expression
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:18:7
 
 		Result bookTimeSlotResult = _schedule.BookTimeSlot(session.Date, session.Time);
 
-		if (bookTimeSlotResult.IsFailure)
+		if (!(bookTimeSlotResult.IsFailure))
 		{
 			if (bookTimeSlotResult.Error.Type == ErrorType.Conflict)
killedBy: SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Equality mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:20:8
 
 		if (bookTimeSlotResult.IsFailure)
 		{
-			if (bookTimeSlotResult.Error.Type == ErrorType.Conflict)
+			if (bookTimeSlotResult.Error.Type != ErrorType.Conflict)
 			{
 				Result<bool> failure = Result.Failure<bool>(PlayerErrors.CannotHaveTwoOrMoreOverlappingSessions);
killedBy: SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[Killed] Block removal mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:21:4
 		if (bookTimeSlotResult.IsFailure)
 		{
 			if (bookTimeSlotResult.Error.Type == ErrorType.Conflict)
-			{
-				Result<bool> failure = Result.Failure<bool>(PlayerErrors.CannotHaveTwoOrMoreOverlappingSessions);
-				return failure;
-			}
+			{}
 			else
 			{
killedBy: SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.PlayerAggregate.PlayerTests.AddSessionToSchedule_WhenSessionOverlapsWithAnotherSession_ShouldFail

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:26:4
 				return failure;
 			}
 			else
-			{
-				Result<bool> failure = Result.Failure<bool>(bookTimeSlotResult.Error);
-				return failure;
-			}
+			{}
 		}
 

[Survived] Boolean mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:33:32
 		}
 
 		_sessionIds.Add(session.Id);
-		return Result.Success(value: true);
+		return Result.Success(value: false);
 	}
 

[NoCoverage] String mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:40:47
 	{
 		if (!_sessionIds.Contains(session.Id))
 		{
-			return Result.Failure<bool>(Error.NotFound("", "Session not found in player's schedule"));
+			return Result.Failure<bool>(Error.NotFound("Stryker was here!", "Session not found in player's schedule"));
 		}
 

[NoCoverage] Negate expression
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:44:7
 		}
 
 		Result<bool> removeBookingResult = _schedule.RemoveBooking(session.Date, session.Time);
-		if (removeBookingResult.IsFailure)
+		if (!(removeBookingResult.IsFailure))
 		{
 			return Result.Failure<bool>(removeBookingResult.Error);

[NoCoverage] Boolean mutation
src/SessionBookingService.Domain/PlayerAggregate/Player.Behavior.cs:50:32
 		}
 
 		_sessionIds.Remove(session.Id);
-		return Result.Success(value: true);
+		return Result.Success(value: false);
 	}
 
