[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/PlayerAggregate/Player.Data.cs:15:15
 				Guid? id = null) : base(id ?? Guid.CreateVersion7())
 	{
 		UserId = userId;
-		_schedule = schedule ?? Schedule.Empty();
+		_schedule = Schedule.Empty();
 	}
 
