[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/SessionAggregate/Booking.cs:8:10
 internal sealed class Booking : Entity
 {
 	internal Booking(Guid playerId, Guid? id = null)
-		: base(id ?? Guid.CreateVersion7())
+		: base(Guid.CreateVersion7())
 	{
 		PlayerId = playerId;

[Killed] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Booking.cs:9:2
 {
 	internal Booking(Guid playerId, Guid? id = null)
 		: base(id ?? Guid.CreateVersion7())
-	{
-		PlayerId = playerId;
-	}
+	{}
 
 	private Booking()
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation
