[Killed] Negate expression
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:12:7
 {
 	public Result<bool> BookSpot(Player player)
 	{
-		if (_bookings.Count >= MaxPlayerCapacity)
+		if (!(_bookings.Count >= MaxPlayerCapacity))
 		{
 			return Result.Failure<bool>(SessionErrors.CannotHaveMoreBookingsThanPlayers);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation; SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.BookSpot_WhenNoMoreRoom_ShouldFailReservation

[Killed] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:12:7
 {
 	public Result<bool> BookSpot(Player player)
 	{
-		if (_bookings.Count >= MaxPlayerCapacity)
+		if (_bookings.Count > MaxPlayerCapacity)
 		{
 			return Result.Failure<bool>(SessionErrors.CannotHaveMoreBookingsThanPlayers);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.BookSpot_WhenNoMoreRoom_ShouldFailReservation

[Killed] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:13:3
 	public Result<bool> BookSpot(Player player)
 	{
 		if (_bookings.Count >= MaxPlayerCapacity)
-		{
-			return Result.Failure<bool>(SessionErrors.CannotHaveMoreBookingsThanPlayers);
-		}
+		{}
 
 		Booking booking = new(player.Id);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.BookSpot_WhenNoMoreRoom_ShouldFailReservation

[Killed] Negate expression
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:19:7
 
 		Booking booking = new(player.Id);
 
-		if (_bookings.Exists(b => b.PlayerId == booking.PlayerId))
+		if (!(_bookings.Exists(b => b.PlayerId == booking.PlayerId)))
 		{
 			return Result.Failure<bool>(SessionErrors.PlayerCannotReserveTwice);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation; SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.BookSpot_WhenNoMoreRoom_ShouldFailReservation

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:19:29
 
 		Booking booking = new(player.Id);
 
-		if (_bookings.Exists(b => b.PlayerId == booking.PlayerId))
+		if (_bookings.Exists(b => b.PlayerId != booking.PlayerId))
 		{
 			return Result.Failure<bool>(SessionErrors.PlayerCannotReserveTwice);

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:20:3
 		Booking booking = new(player.Id);
 
 		if (_bookings.Exists(b => b.PlayerId == booking.PlayerId))
-		{
-			return Result.Failure<bool>(SessionErrors.PlayerCannotReserveTwice);
-		}
+		{}
 
 		_bookings.Add(booking);

[Killed] Statement mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:24:3
 			return Result.Failure<bool>(SessionErrors.PlayerCannotReserveTwice);
 		}
 
-		_bookings.Add(booking);
+		;
 		DomainEvents.Add(new SessionSpotBookedEvent(this, booking));
 
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation; SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.BookSpot_WhenNoMoreRoom_ShouldFailReservation

[Survived] Statement mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:25:3
 		}
 
 		_bookings.Add(booking);
-		DomainEvents.Add(new SessionSpotBookedEvent(this, booking));
+		;
 
 		return Result.Success(true);

[Killed] LogicalNotExpression to un-LogicalNotExpression mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:32:7
 
 	internal Result<bool> CancelBooking(Guid playerId, IDateTimeProvider provider)
 	{
-		if (!_bookings.Exists(reservation => reservation.PlayerId == playerId))
+		if (_bookings.Exists(reservation => reservation.PlayerId == playerId))
 		{
 			return Result.Failure<bool>(SessionErrors.BookingNotFound);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation

[Killed] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:32:40
 
 	internal Result<bool> CancelBooking(Guid playerId, IDateTimeProvider provider)
 	{
-		if (!_bookings.Exists(reservation => reservation.PlayerId == playerId))
+		if (!_bookings.Exists(reservation => reservation.PlayerId != playerId))
 		{
 			return Result.Failure<bool>(SessionErrors.BookingNotFound);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:33:3
 	internal Result<bool> CancelBooking(Guid playerId, IDateTimeProvider provider)
 	{
 		if (!_bookings.Exists(reservation => reservation.PlayerId == playerId))
-		{
-			return Result.Failure<bool>(SessionErrors.BookingNotFound);
-		}
+		{}
 
 		if (IsTooCloseToSession(provider.UtcNow))

[Killed] Negate expression
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:37:7
 			return Result.Failure<bool>(SessionErrors.BookingNotFound);
 		}
 
-		if (IsTooCloseToSession(provider.UtcNow))
+		if (!(IsTooCloseToSession(provider.UtcNow)))
 		{
 			return Result.Failure<bool>(SessionErrors.CannotCancelBookingTooCloseToSession);
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation

[Killed] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:38:3
 		}
 
 		if (IsTooCloseToSession(provider.UtcNow))
-		{
-			return Result.Failure<bool>(SessionErrors.CannotCancelBookingTooCloseToSession);
-		}
+		{}
 
 		if (IsPastSession(provider.UtcNow))
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation

[NoCoverage] Negate expression
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:42:7
 			return Result.Failure<bool>(SessionErrors.CannotCancelBookingTooCloseToSession);
 		}
 
-		if (IsPastSession(provider.UtcNow))
+		if (!(IsPastSession(provider.UtcNow)))
 		{
 			return Result.Failure<bool>(SessionErrors.CannotCancelPastSession);

[NoCoverage] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:43:3
 		}
 
 		if (IsPastSession(provider.UtcNow))
-		{
-			return Result.Failure<bool>(SessionErrors.CannotCancelPastSession);
-		}
+		{}
 
 		Booking booking = _bookings.First(b => b.PlayerId == playerId);

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:47:42
 			return Result.Failure<bool>(SessionErrors.CannotCancelPastSession);
 		}
 
-		Booking booking = _bookings.First(b => b.PlayerId == playerId);
+		Booking booking = _bookings.First(b => b.PlayerId != playerId);
 
 		_bookings.Remove(booking);

[NoCoverage] Linq method mutation (First() to FirstOrDefault())
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:47:21
 			return Result.Failure<bool>(SessionErrors.CannotCancelPastSession);
 		}
 
-		Booking booking = _bookings.First(b => b.PlayerId == playerId);
+		Booking booking = _bookings.FirstOrDefault(b => b.PlayerId == playerId);
 
 		_bookings.Remove(booking);

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:49:3
 
 		Booking booking = _bookings.First(b => b.PlayerId == playerId);
 
-		_bookings.Remove(booking);
+		;
 		DomainEvents.Add(new BookingCanceledEvent(this, booking));
 

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:50:3
 		Booking booking = _bookings.First(b => b.PlayerId == playerId);
 
 		_bookings.Remove(booking);
-		DomainEvents.Add(new BookingCanceledEvent(this, booking));
+		;
 
 		return Result.Success(true);

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:57:10
 
 	private bool IsPastSession(DateTime utcNow)
 	{
-		return (Date.ToDateTime(Time.End) - utcNow).TotalHours < 0;
+		return (Date.ToDateTime(Time.End) - utcNow).TotalHours > 0;
 	}
 

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:57:10
 
 	private bool IsPastSession(DateTime utcNow)
 	{
-		return (Date.ToDateTime(Time.End) - utcNow).TotalHours < 0;
+		return (Date.ToDateTime(Time.End) - utcNow).TotalHours <= 0;
 	}
 

[Killed] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:66:22
 
 		var timeDifference = (Date.ToDateTime(Time.Start) - utcNow).TotalHours;
 
-		var exceedsLimit = timeDifference < MinHours;
+		var exceedsLimit = timeDifference > MinHours;
 
 		return exceedsLimit;
killedBy: SessionBookingService.Tests.Unit.Domain.SessionAggregate.SessionTests.CancelBooking_WhenCancellationTimeTooCloseToSession_ShouldFailCancellation

[Survived] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:66:22
 
 		var timeDifference = (Date.ToDateTime(Time.Start) - utcNow).TotalHours;
 
-		var exceedsLimit = timeDifference < MinHours;
+		var exceedsLimit = timeDifference <= MinHours;
 
 		return exceedsLimit;

[NoCoverage] Equality mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:73:32
 
 	public bool HasBookingForPlayer(Guid playerId)
 	{
-		return _bookings.Exists(b => b.PlayerId == playerId);
+		return _bookings.Exists(b => b.PlayerId != playerId);
 	}
 

[NoCoverage] Statement mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Behavior.cs:78:3
 
 	public void Cancel()
 	{
-		DomainEvents.Add(new SessionCanceledEvent(this));
+		;
 	}
 }
