[Survived] Null coalescing mutation (remove left)
src/SessionBookingService.Domain/SessionAggregate/Session.Data.cs:18:30
 					DateOnly date,
 					TimeSlot time,
 					List<SessionCategory> categories,
-					Guid? id = null) : base(id ?? Guid.CreateVersion7())
+					Guid? id = null) : base(Guid.CreateVersion7())
 	{
 		Name = name;

[Killed] Block removal mutation
src/SessionBookingService.Domain/SessionAggregate/Session.Data.cs:19:2
 					TimeSlot time,
 					List<SessionCategory> categories,
 					Guid? id = null) : base(id ?? Guid.CreateVersion7())
-	{
-		Name = name;
-		Description = description;
-		InstructorId = instructorId;
-		CourtId = courtId;
-		Date = date;
-		Time = time;
-		MaxPlayerCapacity = maxPlayerCapacity;
-		_categories = categories;
-	}
+	{}
 
 	// Getting some odd error here
killedBy: SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail; SessionBookingService.Tests.Unit.Domain.CourtAggregate.CourtTests.ScheduleSession_WhenSessionOverlapsWithAnotherSession_ShouldFail
