[Survived] String mutation
src/SessionBookingService.Domain/SessionAggregate/SessionErrors.cs:19:6
 
 	internal static readonly Error CannotCancelBookingTooCloseToSession =
 		Error.Failure("Session.CannotCancelBookingTooCloseToSession",
-					"Cannot cancel reservation too close to session start time");
+					"");
 
 	internal static readonly Error PlayerCannotReserveTwice = Error.Failure("Session.PlayerCannotReserveTwice",

[Survived] String mutation
src/SessionBookingService.Domain/SessionAggregate/SessionErrors.cs:21:74
 		Error.Failure("Session.CannotCancelBookingTooCloseToSession",
 					"Cannot cancel reservation too close to session start time");
 
-	internal static readonly Error PlayerCannotReserveTwice = Error.Failure("Session.PlayerCannotReserveTwice",
+	internal static readonly Error PlayerCannotReserveTwice = Error.Failure("",
 																			"A player cannot reserve twice to the same session");
 }

[Survived] String mutation
src/SessionBookingService.Domain/SessionAggregate/SessionErrors.cs:22:20
 					"Cannot cancel reservation too close to session start time");
 
 	internal static readonly Error PlayerCannotReserveTwice = Error.Failure("Session.PlayerCannotReserveTwice",
-																			"A player cannot reserve twice to the same session");
+																			"");
 }
 
