[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreateAdminProfile.cs:19:11
 					{
 						var requestUserIdClaim = user.FindFirstValue("id");
 
-						if (!Guid.TryParse(requestUserIdClaim, out Guid requestUserId))
+						if (Guid.TryParse(requestUserIdClaim, out Guid requestUserId))
 						{
 							// You should somehow parse "StatusCodes.Status401Unauthorized here"

[Survived] Equality mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreateAdminProfile.cs:29:11
 							]);
 						}
 
-						if (requestUserId != userId)
+						if (requestUserId == userId)
 						{
 							// You should somehow parse "StatusCodes.Status403Unauthorized here"

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreateAdminProfile.cs:54:17
 						return result;
 					})
 			.WithTags(Tags.Profile)
-			.WithSummary("Create admin profile")
+			.WithSummary("")
 			.WithDescription("Create admin profile")
 			.Produces<ProfileResponse>(StatusCodes.Status201Created);
