[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreateInstructorProfile.cs:33:19
 						{
 							// You should somehow parse "StatusCodes.Status403Unauthorized here"
 							return ProblemDetailsMapper.Problem([
-								new Error("UnauthorizedToCreateInstructorProfileForThisUser",
+								new Error("",
 										"You are not authorized to create an instructor profile for this user",
 										ErrorType.Problem)

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreateInstructorProfile.cs:34:11
 							// You should somehow parse "StatusCodes.Status403Unauthorized here"
 							return ProblemDetailsMapper.Problem([
 								new Error("UnauthorizedToCreateInstructorProfileForThisUser",
-										"You are not authorized to create an instructor profile for this user",
+										"",
 										ErrorType.Problem)
 							]);
