[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreatePlayerProfile.cs:17:52
 		app.MapPost("users/{userId:guid}/profiles/player",
 					async (Guid userId, ClaimsPrincipal user, ISender sender, CancellationToken cancellationToken) =>
 					{
-						var requestUserIdClaim = user.FindFirstValue("id");
+						var requestUserIdClaim = user.FindFirstValue("");
 
 						if (!Guid.TryParse(requestUserIdClaim, out Guid requestUserId))

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreatePlayerProfile.cs:24:11
 							// You should somehow parse "StatusCodes.Status401Unauthorized here"
 							return ProblemDetailsMapper.Problem([
 								new Error("UnauthorizedToCreatePlayerProfileForThisUser",
-										"You are not authorized to create an admin profile for this user",
+										"",
 										ErrorType.Problem)
 							]);

[Survived] String mutation
UserAdministrationService.WebApi/Endpoints/Profiles/CreatePlayerProfile.cs:33:19
 						{
 							// You should somehow parse "StatusCodes.Status403Unauthorized here"
 							return ProblemDetailsMapper.Problem([
-								new Error("UnauthorizedToCreatePlayerProfileForThisUser",
+								new Error("",
 										"You are not authorized to create an player profile for this user",
 										ErrorType.Problem)
