[Survived] Statement mutation
UserAdministrationService.WebApi/Endpoints/Profiles/ListProfiles.cs:13:3
 {
 	public void MapEndpoint(IEndpointRouteBuilder app)
 	{
-		app.MapGet("users/{userId:guid}/profiles",
-					async (Guid userId, ISender sender, CancellationToken cancellationToken) =>
-					{
-						ListProfilesQuery listProfilesQuery = new(userId);
-
-						Result<ListProfilesResult> listProfilesResult =
-							await sender.Send(listProfilesQuery, cancellationToken);
-
-						IResult result =
-							listProfilesResult.Match(profiles => Results.Ok(new ListProfilesResponse(profiles.AdminId,
-																									profiles.PlayerId,
-																									profiles
-																										.InstructorId)),
-													errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-						return result;
-					})
-			.WithTags(Tags.Profile)
-			.WithSummary("Get profiles for user")
-			.WithDescription("Get profiles for user")
-			.Produces<ListProfilesResponse>();
+		;
 	}
 }

[Survived] Block removal mutation
UserAdministrationService.WebApi/Endpoints/Profiles/ListProfiles.cs:15:6
 	{
 		app.MapGet("users/{userId:guid}/profiles",
 					async (Guid userId, ISender sender, CancellationToken cancellationToken) =>
-					{
-						ListProfilesQuery listProfilesQuery = new(userId);
-
-						Result<ListProfilesResult> listProfilesResult =
-							await sender.Send(listProfilesQuery, cancellationToken);
-
-						IResult result =
-							listProfilesResult.Match(profiles => Results.Ok(new ListProfilesResponse(profiles.AdminId,
-																									profiles.PlayerId,
-																									profiles
-																										.InstructorId)),
-													errors => ProblemDetailsMapper.Problem([errors.Error]));
-
-						return result;
-					})
+					{})
 			.WithTags(Tags.Profile)
 			.WithSummary("Get profiles for user")
