[Survived] Statement mutation
src/UserAdministrationService.WebApi/Extensions/MediatorExtensions.cs:10:3
 {
 	internal static IServiceCollection AddMediatorServices(this IServiceCollection services)
 	{
-		services.AddMediator(options =>
-		{
-			options.ServiceLifetime = ServiceLifetime.Singleton;
-			options.GenerateTypesAsInternal = true;
-			options.NotificationPublisherType = typeof(ForeachAwaitPublisher);
-			options.CachingMode = CachingMode.Eager;
-			options.Assemblies =
-			[
-				typeof(OutboxWriterEventHandler).Assembly
-			];
-		});
+		;
 
 		return services;

[Survived] Boolean mutation
src/UserAdministrationService.WebApi/Extensions/MediatorExtensions.cs:13:38
 		services.AddMediator(options =>
 		{
 			options.ServiceLifetime = ServiceLifetime.Singleton;
-			options.GenerateTypesAsInternal = true;
+			options.GenerateTypesAsInternal = false;
 			options.NotificationPublisherType = typeof(ForeachAwaitPublisher);
 			options.CachingMode = CachingMode.Eager;
