[Survived] Equality mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:10:7
 	// Assumes correct usage - do not supply it with something that is not an error
 	public static IResult Problem(List<Error> errors)
 	{
-		if (errors.Count is 0)
+		if (errors.Count is not 0)
 		{
 			return Results.Problem();

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:11:3
 	public static IResult Problem(List<Error> errors)
 	{
 		if (errors.Count is 0)
-		{
-			return Results.Problem();
-		}
+		{}
 
 		if (errors.TrueForAll(e => e.Type == ErrorType.Validation))

[Survived] Negate expression
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:15:7
 			return Results.Problem();
 		}
 
-		if (errors.TrueForAll(e => e.Type == ErrorType.Validation))
+		if (!(errors.TrueForAll(e => e.Type == ErrorType.Validation)))
 		{
 			return ValidationProblem(errors);

[Survived] Equality mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:15:30
 			return Results.Problem();
 		}
 
-		if (errors.TrueForAll(e => e.Type == ErrorType.Validation))
+		if (errors.TrueForAll(e => e.Type != ErrorType.Validation))
 		{
 			return ValidationProblem(errors);

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:16:3
 		}
 
 		if (errors.TrueForAll(e => e.Type == ErrorType.Validation))
-		{
-			return ValidationProblem(errors);
-		}
+		{}
 
 		return Problem(errors[0]);

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:29:16
 														.SelectMany(e =>
 														{
 															if (e is ValidationError validationError)
-															{
-																return validationError.Errors;
-															}
+															{}
 
 															return [e];

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:47:2
 	}
 
 	private static IResult Problem(Error error)
-	{
-		return Results.Problem(title: GetTitle(error),
-								detail: GetDetail(error),
-								type: GetType(error.Type),
-								statusCode: GetStatusCode(error.Type));
-	}
+	{}
 
 	private static string GetTitle(Error error)

[Survived] String mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:86:9
 			ErrorType.Problem => "https://tools.ietf.org/html/rfc7231#section-6.5.1",
 			ErrorType.NotFound => "https://tools.ietf.org/html/rfc7231#section-6.5.4",
 			ErrorType.Conflict => "https://tools.ietf.org/html/rfc7231#section-6.5.8",
-			_ => "https://tools.ietf.org/html/rfc7231#section-6.6.1"
+			_ => ""
 		};
 	}

[Survived] Block removal mutation
src/UserAdministrationService.WebApi/Infrastructure/ProblemDetailsMapper.cs:91:2
 	}
 
 	private static int GetStatusCode(ErrorType errorType)
-	{
-		return errorType switch
-		{
-			ErrorType.Validation or ErrorType.Problem => StatusCodes.Status400BadRequest,
-			ErrorType.NotFound => StatusCodes.Status404NotFound,
-			ErrorType.Conflict => StatusCodes.Status409Conflict,
-			_ => StatusCodes.Status500InternalServerError
-		};
-	}
+	{}
 }
 
