[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:12:59
 
 WebApplicationBuilder builder = WebApplication.CreateBuilder(args);
 
-builder.WebHost.UseKestrel(opts => opts.AddServerHeader = false);
+builder.WebHost.UseKestrel(opts => opts.AddServerHeader = true);
 builder.Host.UseDefaultServiceProvider((_, opts) =>
 {

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:12:1
 
 WebApplicationBuilder builder = WebApplication.CreateBuilder(args);
 
-builder.WebHost.UseKestrel(opts => opts.AddServerHeader = false);
+;
 builder.Host.UseDefaultServiceProvider((_, opts) =>
 {

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:13:1
 WebApplicationBuilder builder = WebApplication.CreateBuilder(args);
 
 builder.WebHost.UseKestrel(opts => opts.AddServerHeader = false);
-builder.Host.UseDefaultServiceProvider((_, opts) =>
-{
-	opts.ValidateScopes = true;
-	opts.ValidateOnBuild = true;
-});
+;
 
 builder.Services.AddControllers();

[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:15:24
 builder.WebHost.UseKestrel(opts => opts.AddServerHeader = false);
 builder.Host.UseDefaultServiceProvider((_, opts) =>
 {
-	opts.ValidateScopes = true;
+	opts.ValidateScopes = false;
 	opts.ValidateOnBuild = true;
 });

[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:16:25
 builder.Host.UseDefaultServiceProvider((_, opts) =>
 {
 	opts.ValidateScopes = true;
-	opts.ValidateOnBuild = true;
+	opts.ValidateOnBuild = false;
 });
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:19:1
 	opts.ValidateOnBuild = true;
 });
 
-builder.Services.AddControllers();
+;
 builder.Services.AddOpenApi();
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:20:1
 });
 
 builder.Services.AddControllers();
-builder.Services.AddOpenApi();
+;
 
 builder.Services.AddEndpointsApiExplorer();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:22:1
 builder.Services.AddControllers();
 builder.Services.AddOpenApi();
 
-builder.Services.AddEndpointsApiExplorer();
+;
 builder.Services.AddProblemDetails();
 builder.Services.AddHttpContextAccessor();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:23:1
 builder.Services.AddOpenApi();
 
 builder.Services.AddEndpointsApiExplorer();
-builder.Services.AddProblemDetails();
+;
 builder.Services.AddHttpContextAccessor();
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:24:1
 
 builder.Services.AddEndpointsApiExplorer();
 builder.Services.AddProblemDetails();
-builder.Services.AddHttpContextAccessor();
+;
 
 builder.Services

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:26:1
 builder.Services.AddProblemDetails();
 builder.Services.AddHttpContextAccessor();
 
-builder.Services
-		.AddMediatorServices()
-		.AddServices()
-		.AddInfrastructure(builder.Configuration);
+;
 
 builder.Services

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:31:1
 		.AddServices()
 		.AddInfrastructure(builder.Configuration);
 
-builder.Services
-		.AddApiVersioning(opts =>
-		{
-			opts.DefaultApiVersion = new ApiVersion(1);
-			opts.ReportApiVersions = true;
-			opts.AssumeDefaultVersionWhenUnspecified = true;
-			opts.ApiVersionReader = ApiVersionReader.Combine(new UrlSegmentApiVersionReader(),
-																new HeaderApiVersionReader("X-Api-Version"));
-		})
-		.AddApiExplorer(opts =>
-		{
-			opts.GroupNameFormat = "'v'V";
-			opts.SubstituteApiVersionInUrl = true;
-		});
+;
 
 builder.Services.AddEndpoints(typeof(Program).Assembly);

[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:35:29
 		.AddApiVersioning(opts =>
 		{
 			opts.DefaultApiVersion = new ApiVersion(1);
-			opts.ReportApiVersions = true;
+			opts.ReportApiVersions = false;
 			opts.AssumeDefaultVersionWhenUnspecified = true;
 			opts.ApiVersionReader = ApiVersionReader.Combine(new UrlSegmentApiVersionReader(),

[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:36:47
 		{
 			opts.DefaultApiVersion = new ApiVersion(1);
 			opts.ReportApiVersions = true;
-			opts.AssumeDefaultVersionWhenUnspecified = true;
+			opts.AssumeDefaultVersionWhenUnspecified = false;
 			opts.ApiVersionReader = ApiVersionReader.Combine(new UrlSegmentApiVersionReader(),
 																new HeaderApiVersionReader("X-Api-Version"));

[Survived] Boolean mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:43:37
 		.AddApiExplorer(opts =>
 		{
 			opts.GroupNameFormat = "'v'V";
-			opts.SubstituteApiVersionInUrl = true;
+			opts.SubstituteApiVersionInUrl = false;
 		});
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:46:1
 			opts.SubstituteApiVersionInUrl = true;
 		});
 
-builder.Services.AddEndpoints(typeof(Program).Assembly);
+;
 
 WebApplication app = builder.Build();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:60:1
 									.MapGroup("api/v{version:apiVersion}")
 									.WithApiVersionSet(apiVersionSet);
 
-app.MapEndpoints(versionedGroup);
+;
 
 //app.UseMiddleware<EventualConsistencyMiddleware>(); //I'll need this back some day

[Survived] Negate expression
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:64:5
 
 //app.UseMiddleware<EventualConsistencyMiddleware>(); //I'll need this back some day
 
-if (app.Environment.IsDevelopment())
+if (!(app.Environment.IsDevelopment()))
 {
 	app.MapOpenApi().AllowAnonymous();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:66:2
 
 if (app.Environment.IsDevelopment())
 {
-	app.MapOpenApi().AllowAnonymous();
+	;
 	app.MapScalarApiReference(opts =>
 		{

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:67:2
 if (app.Environment.IsDevelopment())
 {
 	app.MapOpenApi().AllowAnonymous();
-	app.MapScalarApiReference(opts =>
-		{
-			opts.Title = Assembly.GetExecutingAssembly().GetName().Name!;
-			opts.Theme = ScalarTheme.Kepler;
-		})
-		.AllowAnonymous();
+	;
 }
 

[Survived] Block removal mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:68:3
 {
 	app.MapOpenApi().AllowAnonymous();
 	app.MapScalarApiReference(opts =>
-		{
-			opts.Title = Assembly.GetExecutingAssembly().GetName().Name!;
-			opts.Theme = ScalarTheme.Kepler;
-		})
+		{})
 		.AllowAnonymous();
 }

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:76:5
 }
 
 
-if (!app.Environment.IsEnvironment("Testing"))
+if (app.Environment.IsEnvironment("Testing"))
 {
 	using IServiceScope scope = app.Services.CreateScope();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:80:2
 {
 	using IServiceScope scope = app.Services.CreateScope();
 	UserDbContext dbContext = scope.ServiceProvider.GetRequiredService<UserDbContext>();
-	await dbContext.Database.MigrateAsync();
+	;
 }
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:83:1
 	await dbContext.Database.MigrateAsync();
 }
 
-app.UseExceptionHandler();
+;
 app.AddInfrastructureMiddleware();
 await app.RunAsync();

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:84:1
 }
 
 app.UseExceptionHandler();
-app.AddInfrastructureMiddleware();
+;
 await app.RunAsync();
 

[Survived] Statement mutation
UserAdministrationService/src/UserAdministrationService.WebApi/Program.cs:85:1
 
 app.UseExceptionHandler();
 app.AddInfrastructureMiddleware();
-await app.RunAsync();
+;
 
