[Survived] Block removal mutation
serve-sync/SharedKernel/Common/Entity.cs:8:2
 #pragma warning restore MA0049
 {
 	protected Entity(Guid id)
-	{
-		Id = id;
-	}
+	{}
 
 	protected Entity()

[Survived] Equality mutation
serve-sync/SharedKernel/Common/Entity.cs:20:22
 
 	public override bool Equals(object? obj)
 	{
-		if (obj is null || obj.GetType() != GetType())
+		if (obj is null || obj.GetType() == GetType())
 		{
 			return false;

[Survived] Negate expression
serve-sync/SharedKernel/Common/Entity.cs:20:7
 
 	public override bool Equals(object? obj)
 	{
-		if (obj is null || obj.GetType() != GetType())
+		if (!(obj is null || obj.GetType() != GetType()))
 		{
 			return false;

[Survived] Equality mutation
serve-sync/SharedKernel/Common/Entity.cs:25:30
 			return false;
 		}
 
-		var representsSameEntity = Id == ((Entity)obj).Id;
+		var representsSameEntity = Id != ((Entity)obj).Id;
 
 		return representsSameEntity;

[Survived] Block removal mutation
serve-sync/SharedKernel/Common/Entity.cs:31:2
 	}
 
 	public override int GetHashCode()
-	{
-		return Id.GetHashCode();
-	}
+	{}
 }
 
