[Survived] Equality mutation
SharedKernel/Common/ValueObjects/ValueObject.cs:9:7
 
 	public override bool Equals(object? obj)
 	{
-		if (obj is null || obj.GetType() != GetType())
+		if (obj is not null || obj.GetType() != GetType())
 		{
 			return false;

[Survived] Null coalescing mutation (remove left)
SharedKernel/Common/ValueObjects/ValueObject.cs:22:18
 	public override int GetHashCode()
 	{
 		return GetEqualityComponents()
-				.Select(x => x?.GetHashCode() ?? 0)
+				.Select(x => 0)
 				.Aggregate((x, y) => x ^ y);
 	}
