[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Error.cs:19:2
 	public string? StackTrace { get; set; } = StackTrace;
 
 	public static Error Failure(string code, string description)
-	{
-		return new Error(code, description, ErrorType.Failure);
-	}
+	{}
 
 	public static Error NotFound(string code, string description)

[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Error.cs:24:2
 	}
 
 	public static Error NotFound(string code, string description)
-	{
-		return new Error(code, description, ErrorType.NotFound);
-	}
+	{}
 
 	public static Error Problem(string code, string description)

[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Error.cs:29:2
 	}
 
 	public static Error Problem(string code, string description)
-	{
-		return new Error(code, description, ErrorType.Problem);
-	}
+	{}
 
 	public static Error Conflict(string code, string description)

[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Error.cs:34:2
 	}
 
 	public static Error Conflict(string code, string description)
-	{
-		return new Error(code, description, ErrorType.Conflict);
-	}
+	{}
 
 	// Intended usage pattern:

[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Error.cs:49:2
 	//}
 	// or as handling in global handling/filter
 	public static Error Unexpected(string code, string description)
-	{
-		return new Error(code, description, ErrorType.Unexpected, Environment.StackTrace);
-	}
+	{}
 }
 
