[Survived] Logical mutation
serve-sync/SharedKernel/Results/Result.cs:11:30
 {
 	protected Result(bool isSuccess, Error error)
 	{
-		var hasInvalidErrorState = isSuccess && error != Error.None || !isSuccess && error == Error.None;
+		var hasInvalidErrorState = isSuccess && error != Error.None && !isSuccess && error == Error.None;
 
 		if (hasInvalidErrorState)

[Survived] Equality mutation
serve-sync/SharedKernel/Results/Result.cs:11:80
 {
 	protected Result(bool isSuccess, Error error)
 	{
-		var hasInvalidErrorState = isSuccess && error != Error.None || !isSuccess && error == Error.None;
+		var hasInvalidErrorState = isSuccess && error != Error.None || !isSuccess && error != Error.None;
 
 		if (hasInvalidErrorState)

[Survived] Negate expression
serve-sync/SharedKernel/Results/Result.cs:13:7
 	{
 		var hasInvalidErrorState = isSuccess && error != Error.None || !isSuccess && error == Error.None;
 
-		if (hasInvalidErrorState)
+		if (!(hasInvalidErrorState))
 		{
 			throw new ArgumentException("Invalid error", nameof(error));

[Survived] Statement mutation
serve-sync/SharedKernel/Results/Result.cs:15:4
 
 		if (hasInvalidErrorState)
 		{
-			throw new ArgumentException("Invalid error", nameof(error));
+			;
 		}
 

[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
serve-sync/SharedKernel/Results/Result.cs:25:27
 	public bool IsSuccess { get; }
 	public Error Error { get; }
 
-	public bool IsFailure => !IsSuccess;
+	public bool IsFailure => IsSuccess;
 
 	public static Result Success()

[Survived] Boolean mutation
serve-sync/SharedKernel/Results/Result.cs:29:21
 
 	public static Result Success()
 	{
-		return new Result(true, Error.None);
+		return new Result(false, Error.None);
 	}
 

[Survived] Boolean mutation
serve-sync/SharedKernel/Results/Result.cs:34:36
 
 	public static Result<TValue> Success<TValue>(TValue value)
 	{
-		return new Result<TValue>(value, true, Error.None);
+		return new Result<TValue>(value, false, Error.None);
 	}
 

[Survived] Boolean mutation
serve-sync/SharedKernel/Results/Result.cs:39:21
 
 	public static Result Failure(Error error)
 	{
-		return new Result(false, error);
+		return new Result(true, error);
 	}
 

[Survived] Boolean mutation
serve-sync/SharedKernel/Results/Result.cs:44:38
 
 	public static Result<TValue> Failure<TValue>(Error error)
 	{
-		return new Result<TValue>(default, false, error);
+		return new Result<TValue>(default, true, error);
 	}
 }

[Survived] Block removal mutation
serve-sync/SharedKernel/Results/Result.cs:60:3
 	public static implicit operator Result<TValue>(TValue? value)
 	{
 		if (value is null)
-		{
-			return Failure<TValue>(Error.NullValue);
-		}
+		{}
 
 		Result<TValue> success = Success(value);
