[Survived] Conditional (true) mutation
serve-sync/SharedKernel/Results/ResultExtensions.cs:10:10
 		Func<TOut> onSuccess,
 		Func<Result, TOut> onFailure)
 	{
-		return result.IsSuccess ? onSuccess() : onFailure(result);
+		return (true?onSuccess() :onFailure(result));
 	}
 

[Survived] Conditional (false) mutation
serve-sync/SharedKernel/Results/ResultExtensions.cs:10:10
 		Func<TOut> onSuccess,
 		Func<Result, TOut> onFailure)
 	{
-		return result.IsSuccess ? onSuccess() : onFailure(result);
+		return (false?onSuccess() :onFailure(result));
 	}
 

[Survived] Conditional (false) mutation
serve-sync/SharedKernel/Results/ResultExtensions.cs:18:10
 		Func<TIn, TOut> onSuccess,
 		Func<Result<TIn>, TOut> onFailure)
 	{
-		return result.IsSuccess ? onSuccess(result.Value) : onFailure(result);
+		return (false?onSuccess(result.Value) :onFailure(result));
 	}
 }

[Survived] Conditional (true) mutation
serve-sync/SharedKernel/Results/ResultExtensions.cs:18:10
 		Func<TIn, TOut> onSuccess,
 		Func<Result<TIn>, TOut> onFailure)
 	{
-		return result.IsSuccess ? onSuccess(result.Value) : onFailure(result);
+		return (true?onSuccess(result.Value) :onFailure(result));
 	}
 }
