[Survived] Block removal mutation
serve-sync/SharedKernel/Results/ValidationError.cs:9:2
 	public Error[] Errors { get; } = Errors;
 
 	public static ValidationError FromResult(IEnumerable<Result> results)
-	{
-		Error[] errors = results.Where(r => r.IsFailure)
-								.Select(r => r.Error)
-								.ToArray();
-
-		ValidationError validationError = new(errors);
-
-		return validationError;
-	}
+	{}
 }
 
