[Survived] Statement mutation
other/serve-sync/SharedKernel/RootAggregate.cs:19:3
 	public ICollection<IDomainEvent> PopDomainEvents()
 	{
 		List<IDomainEvent> copy = DomainEvents.ToList();
-		DomainEvents.Clear();
+		;
 
 		return copy;
