[Survived] Block removal mutation
UserAdministrationService/src/UserAdministrationService.Application/DependencyInjection.cs:8:2
 internal static class DependencyInjection
 {
 	internal static IServiceCollection AddServices(this IServiceCollection services)
-	{
-		return services;
-	}
+	{}
 }
 
