[Survived] Equality mutation
UserAdministrationService.Application/Profiles/CreateAdminProfile/CreateAdminProfileCommandHandler.cs:15:7
 	{
 		User? user = await usersRepository.GetByIdAsync(command.UserId, cancellationToken);
 
-		if (user is null)
+		if (user is not null)
 		{
 			return Result.Failure<Guid>(Error.NotFound("UserNotFound", "User not found"));

[Survived] String mutation
UserAdministrationService.Application/Profiles/CreateAdminProfile/CreateAdminProfileCommandHandler.cs:17:47
 
 		if (user is null)
 		{
-			return Result.Failure<Guid>(Error.NotFound("UserNotFound", "User not found"));
+			return Result.Failure<Guid>(Error.NotFound("", "User not found"));
 		}
 

[Survived] Statement mutation
UserAdministrationService.Application/Profiles/CreateAdminProfile/CreateAdminProfileCommandHandler.cs:22:3
 
 		Result<Guid> instructorId = user.CreateInstructorProfile();
 
-		await usersRepository.UpdateAsync(user, cancellationToken);
+		;
 
 		return instructorId;
