[Survived] LogicalNotExpression to un-LogicalNotExpression mutation
src/UserAdministrationService.Application/Register/RegisterCommandHandler.cs:20:7
 	{
 		var userExists = await usersRepository.ExistsByEmailAsync(command.Email, cancellationToken);
 
-		if (!userExists)
+		if (userExists)
 		{
 			return Result.Failure<AuthenticationResult>(Error.Conflict("UserAlreadyExists", "User already exists"));

[Survived] String mutation
src/UserAdministrationService.Application/Register/RegisterCommandHandler.cs:22:63
 
 		if (!userExists)
 		{
-			return Result.Failure<AuthenticationResult>(Error.Conflict("UserAlreadyExists", "User already exists"));
+			return Result.Failure<AuthenticationResult>(Error.Conflict("", "User already exists"));
 		}
 

[Survived] Negate expression
src/UserAdministrationService.Application/Register/RegisterCommandHandler.cs:27:7
 
 		Result<string> hashPasswordResult = passwordHasher.HashPassword(command.Password);
 
-		if (hashPasswordResult.IsFailure)
+		if (!(hashPasswordResult.IsFailure))
 		{
 			return Result.Failure<AuthenticationResult>(hashPasswordResult.Error);

[Survived] Block removal mutation
src/UserAdministrationService.Application/Register/RegisterCommandHandler.cs:28:3
 		Result<string> hashPasswordResult = passwordHasher.HashPassword(command.Password);
 
 		if (hashPasswordResult.IsFailure)
-		{
-			return Result.Failure<AuthenticationResult>(hashPasswordResult.Error);
-		}
+		{}
 
 		User user = new(command.FirstName,

[Survived] Statement mutation
src/UserAdministrationService.Application/Register/RegisterCommandHandler.cs:37:3
 						command.Email,
 						hashPasswordResult.Value);
 
-		await usersRepository.AddUserAsync(user, cancellationToken);
+		;
 
 		var token = jwtTokenGenerator.GenerateToken(user);
