[Survived] Null coalescing mutation (remove left)
src/UserAdministrationService.Domain/EventualConsistency/EventualConsistencyException.cs:12:22
 																							.Error.Description)
 	{
 		EventualConsistencyError = eventualConsistencyError;
-		UnderlyingErrors = underlyingErrors ?? [];
+		UnderlyingErrors = [];
 	}
 

[Survived] Null coalescing mutation (remove right)
src/UserAdministrationService.Domain/EventualConsistency/EventualConsistencyException.cs:12:22
 																							.Error.Description)
 	{
 		EventualConsistencyError = eventualConsistencyError;
-		UnderlyingErrors = underlyingErrors ?? [];
+		UnderlyingErrors = underlyingErrors;
 	}
 
