[Survived] Equality mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:12:7
 {
 	internal Result<Guid> CreateAdminProfile()
 	{
-		if (AdminId is not null)
+		if (AdminId is null)
 		{
 			return Result.Failure<Guid>(Error.Conflict("", "User already has an admin profile"));

[Survived] String mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:14:47
 	{
 		if (AdminId is not null)
 		{
-			return Result.Failure<Guid>(Error.Conflict("", "User already has an admin profile"));
+			return Result.Failure<Guid>(Error.Conflict("Stryker was here!", "User already has an admin profile"));
 		}
 

[Survived] String mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:14:51
 	{
 		if (AdminId is not null)
 		{
-			return Result.Failure<Guid>(Error.Conflict("", "User already has an admin profile"));
+			return Result.Failure<Guid>(Error.Conflict("", ""));
 		}
 

[Survived] Statement mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:18:3
 		}
 
 		AdminId = Guid.CreateVersion7();
-		DomainEvents.Add(new AdminProfileCreatedEvent(Id, AdminId.Value));
+		;
 
 		return Result.Success(AdminId.Value);

[Survived] Equality mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:25:7
 
 	internal Result<Guid> CreatePlayerProfile()
 	{
-		if (PlayerId is not null)
+		if (PlayerId is null)
 		{
 			return Result.Failure<Guid>(Error.Conflict("", "User already has a participant profile"));

[Survived] Statement mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:31:3
 		}
 
 		PlayerId = Guid.CreateVersion7();
-		DomainEvents.Add(new PlayerProfileCreatedEvent(Id, PlayerId.Value));
+		;
 
 		return Result.Success(PlayerId.Value);

[Survived] Equality mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:38:7
 
 	internal Result<Guid> CreateInstructorProfile()
 	{
-		if (InstructorId is not null)
+		if (InstructorId is null)
 		{
 			return Result.Failure<Guid>(Error.Conflict("", "User already has an instructor profile"));

[Survived] String mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:40:51
 	{
 		if (InstructorId is not null)
 		{
-			return Result.Failure<Guid>(Error.Conflict("", "User already has an instructor profile"));
+			return Result.Failure<Guid>(Error.Conflict("", ""));
 		}
 

[Survived] Statement mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:44:3
 		}
 
 		InstructorId = Guid.CreateVersion7();
-		DomainEvents.Add(new InstructorProfileCreatedEvent(Id, InstructorId.Value));
+		;
 
 		return Result.Success(InstructorId.Value);

[Survived] Block removal mutation
src/UserAdministrationService.Domain/UserAggregate/User.Behavior.cs:50:2
 	}
 
 	internal bool IsValidPasswordHash(string password, IPasswordHasher passwordHasher)
-	{
-		return passwordHasher.IsValidPassword(password, _passwordHash);
-	}
+	{}
 }
 
