[Survived] Null coalescing mutation (remove left)
src/UserAdministrationService.Domain/UserAggregate/User.Data.cs:14:29
 				Guid? adminId = null,
 				Guid? playerId = null,
 				Guid? instructorId = null,
-				Guid? id = null) : base(id ?? Guid.NewGuid())
+				Guid? id = null) : base(Guid.NewGuid())
 	{
 		FirstName = firstName;

[Survived] Block removal mutation
src/UserAdministrationService.Domain/UserAggregate/User.Data.cs:15:2
 				Guid? playerId = null,
 				Guid? instructorId = null,
 				Guid? id = null) : base(id ?? Guid.NewGuid())
-	{
-		FirstName = firstName;
-		LastName = lastName;
-		Email = email;
-		AdminId = adminId;
-		PlayerId = playerId;
-		InstructorId = instructorId;
-		_passwordHash = passwordHash;
-	}
+	{}
 
 	private User()
